[
  {
    "courseName": "AERO 1A. and B. Heritage and Values of the United States Air Force",
    "classCode": "AERO 1A",
    "description": "AERO 1A is a survey course designed to introduce students to the United States Air Force and encourages participation in the Air Force Reserve Officer Training Corps. Featured topics include an overview of the Reserve Officer Training Corps (ROTC), special programs offered through ROTC, characteristics, mission and organization of the Air Force, brief history of the Air Force, introduction to leadership and leadership-related issues, Air Force Core Values, Air Force officer opportunities, and an introduction to communication studies. Leadership laboratory is mandatory for AFROTC cadets and complements this course by providing cadets with followership experiences. (1.5 units per quarter) AERO 1B is a survey course designed to introduce students to the United States Air Force and encourages participation in the Air Force Reserve Officer Training Corps. Featured topics include an overview of the Reserve Officer Training Corps (ROTC), special programs offered through ROTC, characteristics, mission and organization of the Air Force, brief history of the Air Force, introduction to leadership and leadership-related issues, Air Force Core Values, Air Force officer opportunities, and an introduction to communication studies. Leadership laboratory is mandatory for AFROTC cadets and complements this course by providing cadets with followership experiences. (1.5 units per quarter)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "AERO 1A. and B. Heritage and Values of the United States Air Force",
    "classCode": "AERO 1B",
    "description": "AERO 1A is a survey course designed to introduce students to the United States Air Force and encourages participation in the Air Force Reserve Officer Training Corps. Featured topics include an overview of the Reserve Officer Training Corps (ROTC), special programs offered through ROTC, characteristics, mission and organization of the Air Force, brief history of the Air Force, introduction to leadership and leadership-related issues, Air Force Core Values, Air Force officer opportunities, and an introduction to communication studies. Leadership laboratory is mandatory for AFROTC cadets and complements this course by providing cadets with followership experiences. (1.5 units per quarter) AERO 1B is a survey course designed to introduce students to the United States Air Force and encourages participation in the Air Force Reserve Officer Training Corps. Featured topics include an overview of the Reserve Officer Training Corps (ROTC), special programs offered through ROTC, characteristics, mission and organization of the Air Force, brief history of the Air Force, introduction to leadership and leadership-related issues, Air Force Core Values, Air Force officer opportunities, and an introduction to communication studies. Leadership laboratory is mandatory for AFROTC cadets and complements this course by providing cadets with followership experiences. (1.5 units per quarter)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Team and Leadership Fundamentals",
    "classCode": "AERO 2A",
    "description": "AERO 2A focuses on laying the fundamental foundation for understanding both team and leadership building. The topics include skills that will allow cadets to improve their leadership on a personal level and within a team. The courses will prepare cadets for their field training experience where they will be able to put the concepts learned into practice. The purpose is to instill a leadership mindset and to motivate sophomore students to transition from AFROTC cadet to AFROTC officer candidate. In addition, what the students learned about Air Force Core Values in AERO 1A and 1B will be reinforced through the use of operational examples, and they will complete writing and briefing assignments that must meet Air Force communication skills requirements. Leadership laboratory is mandatory for AFROTC cadets and complements this course by providing cadets with followership experiences. (1.5 units per quarter)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Team and Leadership Fundamentals",
    "classCode": "AERO 2B",
    "description": "AERO 2B focuses on laying the fundamental foundation for understanding both team and leadership building. The topics include skills that will allow cadets to improve their leadership on a personal level and within a team. The courses will prepare cadets for their field training experience where they will be able to put the concepts learned into practice. The purpose is to instill a leadership mindset and to motivate sophomore students to transition from AFROTC cadet to AFROTC officer candidate. In addition, what the students learned about Air Force Core Values in AERO 1A and 1B will be reinforced through the use of operational examples, and they will complete writing and briefing assignments that must meet Air Force communication skills requirements. Leadership laboratory is mandatory for AFROTC cadets and complements this course by providing cadets with followership experiences. (1.5 units per quarter)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Leading People and Effective Communication",
    "classCode": "AERO 131A",
    "description": "Aero 131A utilizes a cadet’s field training experience to take a more in-depth look at leadership.  The course teaches cadets advanced skills and knowledge in management and leadership. Special emphasis is placed on enhancing leadership skills and communication. Cadets have an opportunity to try out these leadership and management techniques in a supervised environment as juniors and seniors. A mandatory leadership laboratory complements this course by providing advanced leadership experiences in officer-type activities, giving students the opportunity to apply leadership and management principles of this course. One-year course. Prerequisites: AERO 1A, B; AERO 2A, B; or as determined by the Aerospace Studies Department Chair. (4.5 units per quarter)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Leading People and Effective Communication",
    "classCode": "AERO 131B",
    "description": "Aero 131B utilizes a cadet’s field training experience to take a more in-depth look at leadership.  The course teaches cadets advanced skills and knowledge in management and leadership. Special emphasis is placed on enhancing leadership skills and communication. Cadets have an opportunity to try out these leadership and management techniques in a supervised environment as juniors and seniors. A mandatory leadership laboratory complements this course by providing advanced leadership experiences in officer-type activities, giving students the opportunity to apply leadership and management principles of this course. One-year course. Prerequisites: AERO 1A, B; AERO 2A, B; or as determined by the Aerospace Studies Department Chair. (4.5 units per quarter)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "National Security Affairs/Commissioning Preparation for Active Duty",
    "classCode": "AERO 141A",
    "description": "AERO 141A examines the national security process, regional studies, advanced leadership ethics, and Air Force doctrine. The course is designed for college seniors and gives them the foundation to understand their role as military officers in American society and how they are directly tied to our National Security Strategy. It is an overview of the complex social and political issues facing the military profession and requires a measure of sophistication commensurate with the senior college level. The final semester provides information that will prepare the cadets for Active Duty. A mandatory leadership laboratory complements this course by providing advanced leadership experiences in officer-type activities, giving students the opportunity to apply leadership and management principles. One-year course. Prerequisite or corequisite: AERO 131A, B. (4.5 units per quarter)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "National Security Affairs/Commissioning Preparation for Active Duty",
    "classCode": "AERO 141B",
    "description": "AERO 141B examines the national security process, regional studies, advanced leadership ethics, and Air Force doctrine. The course is designed for college seniors and gives them the foundation to understand their role as military officers in American society and how they are directly tied to our National Security Strategy. It is an overview of the complex social and political issues facing the military profession and requires a measure of sophistication commensurate with the senior college level. The final semester provides information that will prepare the cadets for Active Duty. A mandatory leadership laboratory complements this course by providing advanced leadership experiences in officer-type activities, giving students the opportunity to apply leadership and management principles. One-year course. Prerequisite or corequisite: AERO 131A, B. (4.5 units per quarter)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  }
]