[
  {
    "courseName": "Critical Thinking & Writing I",
    "classCode": "HNRS 1H",
    "description": "A two-course, themed sequence (along with HNRS 2H) for Honors students, featuring study and practice of academic discourse, with emphasis on critical reading and writing, composing processes, and rhetorical situation (ENGL 1H and 2H, PHIL 1H and 2H, etc.). The second course will feature more advanced study and practice of academic discourse, with additional emphasis on information literacy and skills related to developing and organizing longer and more complex documents. Themes may address cultural comparisons, science and society, and other topics. (4 units each quarter)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Critical Thinking & Writing II",
    "classCode": "HNRS 2H",
    "description": "A two-course, themed sequence (along with HNRS 1H) for Honors students, featuring study and practice of academic discourse, with emphasis on critical reading and writing, composing processes, and rhetorical situation (ENGL 1H and 2H, PHIL 1H and 2H, etc.). The second course will feature more advanced study and practice of academic discourse, with additional emphasis on information literacy and skills related to developing and organizing longer and more complex documents. Themes may address cultural comparisons, science and society, and other topics. (4 units each quarter)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Cultures & Ideas I",
    "classCode": "HNRS 11H",
    "description": "A two-course sequence (along with HNRS 12H) focusing on a major theme in human experience and culture over a significant period of time (e.g., ARTH 11H and 12H,HIST 11H and 12H, PHIL 11H and 12H, ENGL 11H and 12H). Four Honors sequences will be offered each year. Courses emphasize either broad global interconnections or the construction of Western culture in its global context. Successful completion of C&I I is a prerequisite for C&I II. (4 units each quarter)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Cultures & Ideas II",
    "classCode": "HNRS 12H",
    "description": "A two-course sequence (along with HNRS 11H) focusing on a major theme in human experience and culture over a significant period of time (e.g., ARTH 11H and 12H,HIST 11H and 12H, PHIL 11H and 12H, ENGL 11H and 12H). Four Honors sequences will be offered each year. Courses emphasize either broad global interconnections or the construction of Western culture in its global context. Successful completion of C&I I is a prerequisite for C&I II. (4 units each quarter)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Difficult Dialogues",
    "classCode": "HNRS 20",
    "description": "This seminar-style course is devoted to the analysis from different perspectives of some issue, text, or problem in the area of a professor’s expertise. This course will provide critical thinking skills and an opportunity for students to discuss and debate the toughest questions faced by society today. Honors 20 is required of all Honors students and is open only to Honors students. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Fellowship and Grad School Preparation",
    "classCode": "UGST 101",
    "description": "Seminar for students interested in preparing for a major fellowship competition (e.g., Fulbright, Rhodes, Knight-Hennessy Schwarzman, Marshall, Mitchell, Truman, Goldwater, Udall, Gaither, NSF), internal SCU grants and programs, and preparation for application to graduate or medical school. Open to all students. Taught in winter quarter only.  (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Honors Program Thesis",
    "classCode": "HNRS 195",
    "description": "Course credit for thesis or culminating project of the University Honors Program. Enrollment limited to students in the University Honors Program. This course is Pass/No Pass. There are no lectures for this course—thesis milestones turned in through Camino. Interim grades of “N” will be given until the thesis is successfully submitted. (1 unit) With the agreement of the instructor, an Honors student may get Honors credit for a non-Honors course by adding an enrichment activity or project. The student and the faculty member agree on this added requirement. The goal of the added contract is the student’s acquisition of a deeper and richer command of some aspect of the course material. The student may be afforded an opportunity to present the results of the research to the class. Honors Contract courses may be especially valuable in the student’s junior year as a precursor to the senior thesis. Students wishing to establish a contract for Honors credit must turn in the appropriate application to the office by the end of the first week of the quarter in which the course is taken.",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  }
]