[
  {
    "courseName": "LEAD Scholars Seminar",
    "classCode": "LEAD 1",
    "description": "This fall course aims to assist LEAD scholars in getting the most out of their University experience by developing the academic strategies and personal self-management skills essential for success at Santa Clara. Seminar discussions and exercises focus on a variety of topics including transitional issues, campus engagement, academic resources, and individual growth and development. Reserved for LEAD scholars only. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "LEAD Scholars Seminar",
    "classCode": "LEAD 2",
    "description": "The winter seminar aims to build upon the leadership development of LEAD scholars and encourages application to campus leadership opportunities. Weekly seminar discussions and exercises focus on a variety of topics, including résumé writing, University involvement opportunities, and identity and diversity exploration, as well as spring quarter course registration. Reserved for LEAD scholars only. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Difficult Dialogues",
    "classCode": "LEAD 10",
    "description": "Explores contemporary controversies through case studies. Focuses on the meanings of dialogue and academic freedom through small group discussions and exercises. Reserved for LEAD scholars only. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Exploring Mission-Driven Vocations",
    "classCode": "LEAD 16",
    "description": "In this course, students have the opportunity to explore the various types of professional positions in mission-driven organizations, including nonprofit organizations and benefit corporations, through site visits and guest speakers. Assignments and course content will allow students to reflect upon their own vocational goals, and how to align their passions and strengths to a fulfilling career in mission-driven organization. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Success in Work and Life",
    "classCode": "LEAD 18",
    "description": "In this class, students will learn about various high impact experiences, and take the steps to engage in them. This will include broadening their network, learning more about their field, applying to internships, exploring research positions and discovering paths to graduate school. Reserved for LEAD scholars only. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Exploring Vocations in Law",
    "classCode": "LEAD 19",
    "description": "This course will provide an exploration of law school and the law field. Students will gain insight into how to successfully prepare to apply to law school and what their classes and experiences will be like. Students will also study case law, and explore how to think and write like a lawyer. They will also learn about law specializations and the early career experiences of attorneys. Reserved for LEAD scholars only. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Exploring Healthcare Vocations",
    "classCode": "LEAD 20",
    "description": "This course will explore the wide range of opportunities available in the healthcare field in both the medical and public health sectors. It will also guide students through reflection on their career and educational plans and goals. Students will also develop strategies for accessing vocational and educational opportunities in the field including networking, interviewing skills, resume development, and graduate school exploration. Reserved for LEAD scholars only. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Exploring Engineering Vocations",
    "classCode": "LEAD 21",
    "description": "This course will explore the wide range of opportunities available in the engineering field. It will also guide students through reflections on their career and educational plans and goals. Students will also develop strategies for accessing vocational and educational opportunities in the field including networking, interviewing skills, resume development, and graduate school exploration. Reserved for LEAD scholars only. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Exploring Graduate School",
    "classCode": "LEAD 22",
    "description": "This course will provide an exploration of graduate school. Students will gain insight in how to research and successfully apply to graduate school, as well as explore the graduate school experience. Students will be provided with an overview of graduate school options and guided in researching graduate programs in their specific areas of interest. Reserved for LEAD scholars only. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Advanced Difficult Dialogues",
    "classCode": "LEAD 100",
    "description": "Students explore major local and global issues related to social, environmental, economic, and other problems. Research, presentations, and a project in their disciplines will help them reflect on how they can address these problems through their vocation. Reserved for LEAD scholars only. (5 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Advanced LEAD Seminar",
    "classCode": "LEAD 101",
    "description": "This seminar aims to support two groups of students: transfer students in their transition to SCU and current students who join LEAD after enrolling at SCU. This course prepares them for leadership and vocation within SCU and beyond. Seminar weekly discussions and exercises will focus on a variety of topics including resume writing, presentations on campus resources, and, for transfer students, transition experiences. Reserved for LEAD scholars only. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  }
]