[
  {
    "courseName": "Introduction to the Army and Critical Thinking",
    "classCode": "MILS 11",
    "description": "Introduces students to the personal challenges and competencies that are critical for effective leadership. Students learn how the personal development of life skills such as goal setting, time management, physical fitness, and stress management relate to leadership and officership. Students develop their own personal fitness program under the guidance of an Army master fitness trainer. Two 100-minute classes per week. One one-day weekend field exercise away from the University. Attendance to weekly three-hour leadership lab and one military formal dinner required. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to the Profession of Arms",
    "classCode": "MILS 12",
    "description": "An overview of leadership fundamentals such as goal setting, problem solving, listening, critical thinking, stress management, presenting briefs, providing feedback, and using effective writing skills. Students begin to explore leadership dimensions and values. Two 100-minute classes per week. Attendance to weekly three-hour leadership lab and one military formal dinner required. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Foundations of Agile and Adaptive Leadership",
    "classCode": "MILS 13",
    "description": "An overview of the leadership framework with practical applications in fundamentals such as problem solving, listening, critical thinking, stress management, presenting briefs, and using effective writing skills. Students explore dimensions of leadership, values, attributes, skills, and actions in the context of practical, hands-on, and interactive exercises. Two 100-minute classes per week. One two-day weekend field training exercise away from the University. Attendance to weekly three-hour leadership lab and one military formal dinner required. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Leadership and Decision Making",
    "classCode": "MILS 21",
    "description": "Explores the dimensions of creative leadership strategies and styles by studying historical cases and engaging in interactive exercises. Students practice aspects of personal motivation and team building within the context of planning, executing, and assessing team exercises. Focus will be on the continued development of the knowledge of leadership values and attributes through an understanding of organizational customs and courtesies. Leadership case studies provide tangible context for learning Individual Creeds and Organizational Ethos. One one-day weekend field exercise away from the University. Attendance to weekly three-hour leadership lab and one military formal dinner required. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Army Doctrine, Team Development, and Decision-Making",
    "classCode": "MILS 22",
    "description": "Examines the challenges of leadership in complex contemporary operational environments. Dimensions of the cross-cultural challenges of leadership in a constantly changing world and their application to leadership tasks and situations. Case studies stressing the importance of teamwork and tactics in real-world settings. Attendance to weekly three-hour leadership lab and one military formal dinner required. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Leadership In a Changing Environment",
    "classCode": "MILS 23",
    "description": "Examines the decision-making process and plans/orders that enable small units to complete assigned tasks. Planning techniques used to develop orders and briefing plans and decisions. One two-day weekend field exercise away from the University. Attendance to weekly three-hour leadership lab and one military formal dinner required. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Cadet Initial Entry Training Course",
    "classCode": "MILS 24",
    "description": "A four-week summer training camp at Fort Knox, Kentucky. Students receive pay, travel, lodging, and the Army defrays most meal costs. The course environment is rigorous and teaches skills required for success in the Army ROTC Advanced Course. No military obligation is incurred. Students must pass a physical examination (paid for by ROTC). Completion of MILS 24 qualifies a student for entry into the Advanced Course. Candidates can apply for a class seat anytime during the school year. Each Cadet who enters ROTC and contracts will attend this course if he/she has not already attended U.S. Army Basic Training. Open to first-year students and sophomores who have not taken ROTC courses during the regular school year or for ROTC course alignment. P/NP only. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Special Topics: Foundations of Leadership in a Changing Environment",
    "classCode": "MILS 35",
    "description": "Examines specific topics dealing with leadership at the lieutenant level or challenges facing senior military leadership in the contemporary operating environment. Prerequisite: Department chair approval. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Training Management and the Warfighting Functions",
    "classCode": "MILS 131",
    "description": "Challenges students to study, practice, and evaluate adaptive leadership skills as they are presented with the demands of the ROTC Cadet Leader Course. Challenging scenarios related to small unit tactical operations are used to develop self-awareness and critical thinking skills. Students receive systematic and specific feedback on their leadership abilities. Two 100-minute classes per week. Weekly three-hour labs. One mandatory one-day field training exercise away from the University. Prerequisites: MILS 11, 12, 13, 21, 22, and 23, or consent of department chair. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Applied Leadership In Small Unit Operations",
    "classCode": "MILS 132",
    "description": "Study of intense situational leadership challenges to build student awareness and skills in leading small units. Skills in decision making, persuading, and motivating team members when “under fire” are explored, evaluated, and developed. Two 100-minute classes per week. Weekly three-hour labs. One military formal dinner. Prerequisite: MILS 131 or consent of department chair. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Applied Leadership In Small Unit Operations II",
    "classCode": "MILS 133",
    "description": "Practical applications of intense situational leadership challenges that will provide awareness and specific feedback on leadership abilities. Student skills are evaluated using practical applications in decision making, persuading, and motivating team members when “under fire.” Aspects of military operations are reviewed as a means of preparing for the ROTC Cadet Leader Course. Two 100-minute classes per week. Weekly three-hour labs. One mandatory two-day field training exercise away from the University. Prerequisite: MILS 132 or consent of department chair. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Cadet Leader Course",
    "classCode": "MILS 134",
    "description": "A five-week summer training course conducted at Fort Knox, Kentucky. Only open to (and required of) students who have completed MILS 131, 132, 133, and are contracted. Contracted Cadets receive pay, travel, and lodging, and the Army defrays most meal costs. The course’s environment is highly structured and demanding, stressing leadership at the small-unit level under various challenging circumstances. Although this course is graded on a P/NP basis only, the leadership and skill evaluations at the camp contribute to the subsequent selection process that determines the type of commission and career field of students upon graduation from ROTC and the University. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "The Army Officer",
    "classCode": "MILS 141",
    "description": "Students develop proficiency in planning, executing, and assessing complex operations; in functioning as a member of a staff; and in providing leadership performance feedback to subordinates. Students are given situational opportunities to assess risk, make ethical decisions, and provide coaching to fellow ROTC students. Students are challenged to instruct younger students. Students identify responsibilities of key staff roles and use situational opportunities to develop subordinates. Two 100-minute seminars per week. Weekly three-hour labs. One mandatory one-day weekend field training exercise away from the University. Prerequisite: MILS 133 or consent of department chair. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Company Grade Leadership",
    "classCode": "MILS 142",
    "description": "Explores the dynamics of leadership in the complexity of current military operations. Students examine customs and courtesies, military law, principles of war, and rules of engagement in the face of international terrorism. Aspects of interacting with nongovernmental organizations, civilians on the battlefield, and host nation support are examined and evaluated. Two 100-minute seminars per week. Weekly three-hour labs. One military formal dinner. Prerequisite: MILS 141. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Leadership In a Complex World",
    "classCode": "MILS 143",
    "description": "Significant emphasis is placed on preparing students for their first unit of assignment and transition to Lieutenant. Case studies, scenarios, and exercises are used to prepare students to face the complex ethical and practical demands of leading as commissioned officers in the U.S. Army. Two 100-minute seminars per week. Weekly three-hour labs. One mandatory two-day weekend field training exercise away from the University. Prerequisite: MILS 142. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Military History",
    "classCode": "MILS 176",
    "description": "A survey of the military and diplomatic aspects of American involvement in conflicts from the Anglo-Indian Wars to the present. Two 100-minute classes per week. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Independent Study",
    "classCode": "MILS 199",
    "description": "Examine specific issues facing the U.S. Army as a directed study with the department chair only. Topic selected in consultation with the department chair. Issues of diversity in the military will be embedded in the topic. Prerequisites: Approval of the department chair and must have completed all MILS classes. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  }
]