[
  {
    "courseName": "Differential Equations",
    "classCode": "AMTH 106",
    "description": "Explicit solution techniques for ordinary differential equations, systems of first order differential equations, second order equations with constant coefficients, and higher order linear differential equations. Laplace  transform methods. Engineering applications. Only one of MATH 22 and AMTH 106 may be taken for credit. Prerequisite: MATH 13. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Probability and Statistics",
    "classCode": "AMTH 108",
    "description": "Definitions of probability, sets, sample spaces, conditional and total probability, random variables, distributions, functions of random variables, sampling, estimation of parameters, testing hypotheses. Prerequisite: MATH 14. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Risk Analysis in Civil Engineering",
    "classCode": "AMTH 112",
    "description": "Set theory and probability, random variables, conditional and total probability, functions of random variables, probabilistic models for engineering analysis, statistical inference, hypothesis testing. Prerequisites: MATH 14 and at least junior standing. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Numerical Methods",
    "classCode": "AMTH 118",
    "description": "Numerical solution of algebraic and transcendental equations, numerical differentiation and integration, and solution of ordinary differential equations. Topics in complex analysis and linear algebra.  Solution of representative problems on the digital computer. Prerequisites: AMTH 106 or MATH 22, and one of the following: MECH 45; COEN 11; CSCI 10. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Engineering Mathematics",
    "classCode": "AMTH 120",
    "description": "Review of ordinary differential equations (ODEs) and Laplace transform, vector calculus, linear algebra, orthogonal functions and Fourier series, partial differential equations (PDEs), and introduction to numerical solutions of ODEs. Also listed as MECH 120. Prerequisite: AMTH 106. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Peer Educator in Applied Mathematics",
    "classCode": "AMTH 194",
    "description": "Peer educators in applied mathematics work closely with a faculty member to help students understand course material, think more deeply about course material, benefit from collaborative learning, feel less anxious about testing situations, and enjoy learning. Prerequisite: Enrollment by permission of the instructor. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  }
]