[
  {
    "courseName": "First-Year Seminars in Bioengineering",
    "classCode": "BIOE 1",
    "description": "The first-year seminars introduce students to bioengineering as a discipline, and also introduce them to the research activities in the department of bioengineering. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Physiology",
    "classCode": "BIOE 21",
    "description": "This course will cover five anatomical systems and how the structure of the human body relates to and defines its function in maintaining homeostasis. This course will introduce cytology, histology, and also focus on diseases related to the skeletal, nervous, sensory, muscular, endocrine, and reproductive systems. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Cell and Molecular Bioengineering",
    "classCode": "BIOE 22",
    "description": "The aim of this course is to introduce students to fundamental concepts in cell and molecular biology. Topics covered in the course will include cellular structure and function, biological molecules, molecular mechanism of cellular function, cell proliferation and signaling. This course will also emphasize the importance of applications of genetic engineering in human health and diseases. Course will include lectures, peer reviewed papers, class discussion, short lab exercises, and team projects. Prerequisite: BIOE 21 or BIOL 1B. Corequisite: BIOE 22L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Cell and Molecular Bioengineering Laboratory",
    "classCode": "BIOE 22L",
    "description": "Laboratory for BIOE 22. Corequisite: BIOE 22. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Bio-Devices",
    "classCode": "BIOE 23",
    "description": "This course covers the fundamentals of electronic circuits, with particular emphasis on connecting biosensors to analog-to-digital inputs of computers. This lab-based course introduces measuring, modeling, and designing electronic circuits. Prerequisites: MATH 14 and ELEN 50. Corequisite: BIOE 23L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Bio-Devices Laboratory",
    "classCode": "BIOE 23L",
    "description": "Laboratory for BIOE 23. Corequisite: BIOE 23. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Mechanics: Principles and Modeling",
    "classCode": "BIOE 24",
    "description": "This course covers the principles of engineering mechanics and the general framework for building mathematical models for a variety of dynamic systems. Topics include free-body diagrams, D’Alembert’s law, conservation laws, block diagrams, and state-variable models, etc. Examples of physiological modeling, a fundamental area of biomedical engineering, will be presented. Prerequisite: PHYS 31. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Biomedical Optics",
    "classCode": "BIOE 25",
    "description": "Optical systems are essential in biomedical research and practices. This course covers the principles of optics and examines methods of optical microscopy. Students will learn how to apply imaging techniques (e.g., transmission, reflection, phase, and fluorescence microscopy) to investigate biological samples, design simple optical systems, and calculate system performance. Students will also be responsible for research and presenting a specific application of modern microscopy. Prerequisite: PHYS 32. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Biochemical Engineering",
    "classCode": "BIOE 32",
    "description": "Survey of basic principles of biochemistry and molecular biology, emphasizing on understanding the chemistry and physics of bio-macromolecules—DNA/RNA, protein/peptide, carbohydrates, lipids in living systems as well as in the prospects of bioengineering—biomolecular, biomaterials, and biodevice engineering. Prerequisite: CHEM 31. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Biochemical Engineering Laboratory",
    "classCode": "BIOE 32L",
    "description": "Laboratory for BIOE 32. Corequisite: BIOE 32. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Computer Programming in MATLAB and Python",
    "classCode": "BIOE 45",
    "description": "Computer programming in MATLAB and Python including but not limited to elementary mathematical operations, matrix manipulation, file I/O, 2D and 3D plotting, function definition and invocation, anonymous functions, user controlled input and output, Logical functions, branching and selection structures, repetition structures (loops), iterative solutions, top-down design, matrix algebra, data types, IEEE double precision format floating points, numerical overflow and underflow, data structures, binary searching and sorting, symbolic algebra, numerical techniques, simple graphical user interfaces, and applications to engineering problems. Prerequisite: MATH 13. Corequisite: BIOE 45L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Computer Programming in MATLAB and Python Laboratory",
    "classCode": "BIOE 45L",
    "description": "Laboratory for BIOE 45. Corequisite: BIOE 45. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Bioengineering Research Seminar",
    "classCode": "BIOE 100",
    "description": "A series of one-hour seminars will be presented by guest professors and researchers on their particular research topics in bioengineering or related fields. Students are required to attend four to five seminars and submit a one-page report summarizing the presentation for each seminar. May be repeated for credit up to three times. P/NP grading. Also listed as BIOE 200. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Design Control for Medical Devices",
    "classCode": "BIOE 106",
    "description": "This course will cover the principles behind design control. All of the essential elements required in the regulated medical device environment will be covered from design planning, inputs and outputs to verification, validation, risk management, and design transfer. A problem-based learning approach will be utilized so that students will develop proficiency to apply the principles. Knowledge will be acquired through lectures, class activities, industry guest lectures and field trips. Also listed as BIOE 206. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Medical Device Product Development",
    "classCode": "BIOE 107",
    "description": "The purpose of this course is to provide background information and knowledge to start or enhance a career in medical device product development. Discusses medical device examples, product development processes, regulation, industry information, and intellectual property. Also listed as BIOE 307 and EMGT 307. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Biomedical Devices: Role of Polymers",
    "classCode": "BIOE 108",
    "description": "This course is designed to highlight the role that polymers play in the design and fabrication of various medical devices ranging from simple intravenous drip systems to complex cardiac defibrillator implants and transcatheter heart valves. Topics include polymer basics, biocompatibility, biodegradation, and other tangentially related topics such as regulatory body approvals and intellectual property. Also listed as BIOE 208. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Translational Development for Emerging Biomedical Devices",
    "classCode": "BIOE 109",
    "description": "This course exposes the student to ongoing case-based interventional cardiology diagnostic and therapeutic biomedical device and clinical translational problems, where real-world bioengineering innovative solutions are being envisioned and at times successfully being applied by startup teams of bioengineers and medical professionals. Bioengineering device design concepts and clinical translational development considerations are analyzed and case-based team project reports are assigned for final grading. Prerequisites: BIOE 21, BIOE 108 or BIOE 153 preferred. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Healthcare Innovation",
    "classCode": "BIOE 111",
    "description": "A project-based course that introduces students to healthcare innovation processes for advanced and emerging markets. The course will provide foundational training to address healthcare challenges around the world through innovation. Students in the course will work as teams on problem identification and assessment; iterative development and prototyping of solutions; and concept and business model development; as well as formulation of strategies to ensure regulatory compliance and commercialization success. Prerequisite: Sophomore to senior standing. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Experimental Methods in Bioengineering",
    "classCode": "BIOE 120",
    "description": "This course will cover the principles of data representation, analysis, and experimental designs in bioreactors, biomaterials, and medical devices. Topics include error analyses, modeling, normality testing, hypothesis testing. Special emphasis will be placed on the interpretation of data from high-throughput assays used in “omics”/tissue engineering. Prerequisite: AMTH 106, BIOE 45. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Immune System for Engineers",
    "classCode": "BIOE 130",
    "description": "This course will discuss two significant aspects of human immune systems in bioengineering: 1) Complex hurdles associated with the body’s immune systems for biomaterials, biodevice, and implants; and 2) profound opportunities with engineered therapeutics. Also listed as BIOE 230. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Cancer Immunotherapy",
    "classCode": "BIOE 131",
    "description": "This course aims to provide the scientific and clinical background necessary to understand cancer immunotherapy’s fundamental topics and analyze its strengths and limitations. Emphasis will be on checkpoint blockades, CAR-T and other cell therapy, and cancer vaccines. These topics and the latest developments will be discussed through lectures and journal club presentations. Also listed as BIOE 320. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Medicinal Chemistry and Drug Design I",
    "classCode": "BIOE 138",
    "description": "Small molecule medicines are coming back! In two seminal courses, principles of medicinal chemistry will be discussed in detail, as well as the related drug designs. Medicines and their designs in the following categories will be studied in the part I: Acid-Base disorders; antihistamines; anticholinergics; anti-inflammation (NSAIDs and Glucocorticoids). The contents of the course are offered at the same level as in pharmacy schools. Students are encouraged to have a strong background in biology, organic chemistry, and physiology. Also listed as BIOE 238. Prerequisites: BIOE 22 (or BIOL 1C) and CHEM 31. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Medicinal Chemistry and Drug Design II",
    "classCode": "BIOE 139",
    "description": "Students will study the principles of medical chemistry in detail, as well as the pharmacology for drug design. Medicines and their design will be studied in the following categories: Non-steroidal anti-inflammatory drugs (NSAIDs), Glucocorticoids, Thyroid and Thyroid Drugs, Estrogens and Progestins. On top of the understanding of the principles of drugs, the sequel will be concluded with the “rules” of drug discovery and clinical therapy. Also listed as BIOE 239. Prerequisites: BIOE 22 (or BIOL 1C) and CHEM 31. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Biomaterials Engineering and Characterization",
    "classCode": "BIOE 140",
    "description": "This course will cover the fundamental principles of soft biomaterials characterization in terms of mechanical and rheological properties related to biocompatibility. Areas of focus in the lab included study and fabrication of implantable hydrogels for eukaryotic cell immobilization in scaffold and microscapsules, cytotoxicity measurements in the engineered micro-environment and nutrient diffusion visualized by fluorescence microscopy. Prerequisite: CHEM 12. Also listed as BIOE 240. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Biomaterials Engineering and Characterization Laboratory",
    "classCode": "BIOE 140L",
    "description": "Laboratory for BIOE 140. Corequisite: BIOE 140. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Biomaterials Engineering and Characterization II: Hard Materials",
    "classCode": "BIOE 141",
    "description": "This course will cover materials characterization methods, phase equilibria and processing of first and second generation hard biomaterials with emphasis on bioceramics and metals. Instruction will be complemented by software-enabled simulation of prototyping into a device followed by mechanical and image analysis of defects. Prerequisite: CHEM 12. Also listed as BIOE 241. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Biomaterials Engineering and Characterization II: Hard Materials Laboratory",
    "classCode": "BIOE 141L",
    "description": "Laboratory for BIOE 141. Corequisite: BIOE 141. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Genetic and Therapeutic Engineering",
    "classCode": "BIOE 150",
    "description": "This course covers the fundamental principles and practical skills of genetic engineering, with an emphasis on producing modern medicines including RNA therapeutics and vaccines, recombinant protein and antibody therapeutics, as well as gene therapy such as CAR-T immunotherapy for cancer treatment. Also listed as BIOE 250. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Biomaterials Science",
    "classCode": "BIOE 153",
    "description": "Basic principles of material properties, biomaterials categories, biomaterials engineering concepts and selected applications and practical aspects are taught in this class. This course is a foundation for an entry level medical device engineer or bioengineering advanced degree Prerequisite: CHEM 12. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Biomechanics",
    "classCode": "BIOE 154",
    "description": "Engineering mechanics and applications in the analysis of human body movement, function, and injury. Review of issues related to designing devices for use in, or around, the human body including safety and biocompatibility. Prerequisites: PHYS 33. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Biological Transport Phenomena",
    "classCode": "BIOE 155",
    "description": "The transport of mass, momentum, and energy are critical to the function of living systems and the design of medical devices. This course develops and applies scaling laws and the methods of continuum mechanics to biological transport phenomena over a range of length and time scales. Prerequisites:PHYS 33, AMTH 106. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to NanoBioengineering",
    "classCode": "BIOE 156",
    "description": "This course is designed to present a broad overview of diverse topics in nanobioengineering, with emphasis on areas that directly impact applications in biotechnology and medicine. Specific examples that highlight interactions between nanomaterials and various biomolecules will be discussed, as well as the current status and future possibilities in the development of functional nanohybrids that can sense, assemble, clean, and heal. Also listed as BIOE 256 and ENGR 256. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Biofuel Engineering",
    "classCode": "BIOE 157",
    "description": "This course will cover the basic principles used to classify and evaluate biofuels in terms of thermodynamic and economic efficiencies as well as environmental impact for resource recovery. Special emphases will be placed on emerging applications namely microbial fuel cell technology and photo-bioreactors. Also listed as BIOE 257/ENGR 257. Prerequisites: BIOE 21 (or BIOL 1B), CHEM 12, PHYS 33. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Soft Biomaterials Characterization",
    "classCode": "BIOE 158",
    "description": "This course will cover the fundamental principles of characterization and biodegradation of soft implantable/injectable biomaterials including polymers, hydrogels, liquid crystalline colloids starting with the linkage of microscopic to macroscopic properties and, emphasis on elasticity, adhesion, diffusion, and light scattering. Also listed as BIOE 258. Prerequisite: BIOE 153. Co-requisite: BIOE 158L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Soft Biomaterials Characterization Laboratory",
    "classCode": "BIOE 158L",
    "description": "Laboratory for BIOE 158. Also listed as BIOE 258L. Co-requisite: BIOE 158. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Hard Biomaterials Characterization",
    "classCode": "BIOE 159",
    "description": "This course will cover the fundamental principles of characterization and biodegradation of hard biomaterials including bioceramics and metals starting with the linkage of microscopic to macroscopic properties and, emphasis on corrosion, coatings, (nano/micro)-indentation and accelerated implant analysis.  Instruction will be complimented by software-enabled simulation of prototyping and driving forces’ analyses. Also listed as BIOE 259. Prerequisite: BIOE 153. Co-requisite: BIOE 159L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Hard Biomaterials Characterization Laboratory",
    "classCode": "BIOE 159L",
    "description": "Laboratory for BIOE 159. Also listed as BIOE 259L. Co-requisite: BIOE 159. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Bioinstrumentation",
    "classCode": "BIOE 161",
    "description": "Transducers and biosensors from traditional to nanotechnology; bioelectronics and measurement system design; interface between biological system and instrumentation; data analysis; clinical safety. Laboratory component will include traditional clinical measurements and design and test of a measurement system with appropriate transducers. Prerequisites: BIOE 10, BIOE 21 (or BIOL 1B), ELEN 50. Corequisite: BIOE 161L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Bioinstrumentation Laboratory",
    "classCode": "BIOE 161L",
    "description": "Laboratory for BIOE 161. Corequisite: BIOE 161. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Signals and Systems for Bioengineers",
    "classCode": "BIOE 162",
    "description": "Origin and characteristics of bioelectric, bio-optical, and bioacoustic signals generated from biological systems. Behavior and response of biological systems to stimulation. Acquisition and interpretation of signals. Signal processing methods include FFT spectral analysis and time-frequency analysis. Laboratory component will include modeling of signal generation and analysis of signals such as electrocardiogram (ECG), electromyogram (EMG), and vocal sound pressure waveforms. Prerequisites: BIOE 45, ELEN 50, AMTH 106. Corequisite: BIOE 162L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Signals and Systems for Bioengineers Laboratory",
    "classCode": "BIOE 162L",
    "description": "Laboratory for BIOE 162. Corequisite: BIOE 162. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Bio-Device Engineering",
    "classCode": "BIOE 163",
    "description": "This course will instruct students with the fundamental principles of bio-device design, fabrication and biocompatibility, and let students experiment with state-of-the-art bio-devices. Students will gain hands-on experience with these bio-instruments which are also used in the field. Emphasis is given to the cutting-edge applications in biomedical diagnostics and pharmaceutical drug discovery and development, particularly detection and monitoring interaction, and activity of biomolecules, such as enzymes, receptors, antibodies, nucleic acids, and bioanalytes. Prerequisites: BIOE 22 (or BIOL 1C) and CHEM 31. Corequisite: BIOE 163L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Bio-Device Engineering Laboratory",
    "classCode": "BIOE 163L",
    "description": "Laboratory for BIOE 163. Corequisite: BIOE 163. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Biosignal and Medical Image Processing I",
    "classCode": "BIOE 166",
    "description": "This course covers the principles and methods of signal and image processing and their applications in biomedical engineering. A complete set of signal and image processing tools, including diagnostic decision-making tools will be introduced at a useful, working depth. Also listed as BIOE 216. Prerequisite: BIOE 162. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Medical Imaging",
    "classCode": "BIOE 167",
    "description": "This course will cover basics of technical aspects and clinical applications of medical imaging. Practicing radiologists will introduce the students to the history of radiology and medical imaging, as well as specific modalities such as X-ray, CT, MR, ultrasound, nuclear medicine, and interventional radiology. A brief discussion of applications of information technology to radiology is also included. Also listed as BIOE 267. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Biophotonics and Bioimaging",
    "classCode": "BIOE 168",
    "description": "This course focuses on the interactions of light with biological matter and includes topics on the absorption of light by biomolecules, cells, and tissues, and the emission of light from these molecules via fluorescence and phosphorescence. The course will cover the application of biophotonics in cell biology, biotechnology, and biomedical imaging. Also listed as BIOE 268. Prerequisites: BIOE 22 (or BIOL 1C) and CHEM 31, PHYS 33. Corequisite: BIOE 168L. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Biophotonics and Bioimaging Laboratory",
    "classCode": "BIOE 168L",
    "description": "The lab will provide hands-on experience for basic imaging and microscopy techniques as well as advanced techniques such as fiber optics and optical coherence tomography. Some of the experiments that will be conducted are: measuring the focal length of lenses and imaging using a single lens and a lens system, determining the magnification of optical systems (e.g., of a microscope), interference in young’s double slit and in Michelson configuration, diffraction, polarization and polarization rotation. Also listed as BIOE 268L. Corequisite: BIOE 168. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Mechanobiology",
    "classCode": "BIOE 170",
    "description": "This course will focus on the mechanical regulation of biological systems. Students will gain an understanding of how mechanical forces are converted into biochemical activity. The mechanisms by which cells respond to mechanical stimuli and current techniques to determine these processes will be discussed. Class discussions will primarily center around assigned readings of published literature guided by lecture topics. Also listed as BIOE 270. Prerequisite: BIOE 154. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Physiology and Anatomy for Engineers",
    "classCode": "BIOE 171",
    "description": "Examines the structure and function of the human body and the mechanisms for maintaining homeostasis. The course will provide a molecular-level understanding of human anatomy and physiology in select organ systems. The course will include lectures, class discussions, case studies, computer simulations, field trips, lab exercises, and team projects. Prerequisite: BIOE 21 (or BIOL 1B). Corequisite: BIOE 171L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Physiology and Anatomy for Engineers Laboratory",
    "classCode": "BIOE 171L",
    "description": "Laboratory for BIOE 171. Corequisite: BIOE 171. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Tissue Engineering",
    "classCode": "BIOE 172",
    "description": "Introduces the basic principles underlying the design and engineering of functional biological substitutes to restore tissue function. Cell sourcing, manipulation of cell fate, biomaterial properties and cell-material interactions, and specific biochemical and biophysical cues presented by the extracellular matrix will be discussed, as well as the current status and future possibilities in the development of biological substitutes for various tissue types. Prerequisite: BIOE 22 (or BIOL 1C). (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Tissue Engineering Laboratory",
    "classCode": "BIOE 172L",
    "description": "Laboratory for BIOE 172. Co-requisite: BIOE 172. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Advanced Topics in Tissue Engineering",
    "classCode": "BIOE 173",
    "description": "Overview of the progress achieved in developing tools, technologies, and strategies for tissue engineering-based therapies for a variety of human diseases and disorders. Lectures will be complemented by a series of student-led discussion sessions and student team projects. Also listed as BIOE 273. Prerequisite: BIOE 172, or consent of the instructor. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Microfabrication and Microfluidics for Bioengineering Applications",
    "classCode": "BIOE 174",
    "description": "Microfluidics uses principles from a broad range of disciplines including fluid mechanics, material science and optics for miniaturization, and automation of biochemical applications. This course will introduce the basic physical and engineering concepts which have practical importance in microfluidics and will allow better understanding of molecule and cell manipulation in the micro-domain. The course aims to introduce students to the state-of-art applications of various microfluidic techniques (e.g., mLSI, droplet and paper-based), in biological and biomedical research through lectures and discussion of current literature. Prerequisites: BIOE 10, BIOE 21 (or BIOL 1B), PHYS 33. Corequisite: BIOE 174L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Microfabrication and Microfluidics for Bioengineering Applications Laboratory",
    "classCode": "BIOE 174L",
    "description": "Multilayer soft-lithography will be taught and integrated microfluidic chips will be built. Basic pressure driven microfluidic chip tests will be performed. A team design project that stresses interdisciplinary communication and problem solving is required in this course. Corequisite: BIOE 174. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Biomolecular and Cellular Engineering I",
    "classCode": "BIOE 175",
    "description": "This course will focus on solving problems encountered in the design and manufacturing of biopharmaceutical products, including antibiotics, antibodies, protein drugs, and molecular biosensors, with particular emphasis on the principle and application of protein engineering and reprogramming cellular metabolic networks. Prerequisites: BIOE 22 (or BIOL 1C) and CHEM 31, or equivalent knowledge and by instructor’s permission. BIOE 153 is recommended. Corequisite: BIOE 175L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Biomolecular and Cellular Engineering I Laboratory",
    "classCode": "BIOE 175L",
    "description": "Laboratory for BIOE 175. Corequisite: BIOE 175. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Biomolecular and Cellular Engineering II",
    "classCode": "BIOE 176",
    "description": "This course will focus on the principle of designing, manufacturing synthetic materials and their biomedical and pharmaceutical applications. Emphasis of this class will be given to chemically synthetic materials such as polymers, and inorganic and organic compounds. Also listed as BIOE 226. Prerequisites: BIOE 22 (or BIOL 1C) and CHEM 31, or equivalent knowledge and by instructor’s permission. BIOE 171 and 175 are recommended. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Biomolecular and Cellular Engineering II Laboratory",
    "classCode": "BIOE 176L",
    "description": "Laboratory for BIOE 176. Corequisite: BIOE 176. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Machine Learning and Applications in Biomedical Engineering",
    "classCode": "BIOE 177A",
    "description": "This course covers theoretical foundations and methods that form the core of modern machine learning. Topics include supervised methods for regression and classification (linear regression, logistic regression, support vector machine, instance-based and ensemble methods, neural networks) and unsupervised methods for clustering and dimensionality reduction. Selected biomedical applications will be presented. Also listed as BIOE 227A. Prerequisite: MATH 14. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Machine Learning and Algorithm Implementation",
    "classCode": "BIOE 177B",
    "description": "This course introduces programming in Python and focuses on building machine learning projects with Numpy, TensorFlow and Keras. Also listed as BIOE 227B. Prerequisite: BIOE 177A. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Microfluidics & Lab-on-a-Chip",
    "classCode": "BIOE 178",
    "description": "The interface between engineering and miniaturization is among the most intriguing and active areas of inquiry in modern technology. This course aims to illuminate and explore microfluidics and LOC (lab-on-a-chip) as an interdisciplinary research area, with an emphasis on emerging microfluidics disciplines, LOC device design, and micro/nanofabrication. Credit not allowed for both BIOE 178 and 276. Cross-listed with BIOE 276.",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Neural Engineering",
    "classCode": "BIOE 179",
    "description": "This course provides a foundation in the neural principles underlying existing and upcoming neurotechnologies. The goal is to understand the design criteria necessary for engineering interventions in neural structure and function with application to neurological diseases, disorders, and injuries. Topics include brain imaging and stimulation, neural implants, nanotechnologies, stem cell and tissue engineering. This course includes lectures, literature critiques, and design projects. Also listed as BIOE 275. Prerequisites: BIOE 21 (or BIOL 1B). BIOE 171 recommended. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Clinical Trials: Design, Analysis and Ethical Issues",
    "classCode": "BIOE 180",
    "description": "This course will cover the principles behind the logistics of design and analysis of clinical trials from statistical and ethical perspectives. Topics include methods used for quantification of treatment effect(s) and associated bias interpretation, crossover designs used in randomized clinical trials, and clinical equipoise. Also listed as BIOE 380. Prerequisites: BIOE 120 (or AMTH 108), or with consent of the instructor. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Sampling Plans in Biomedical Engineering",
    "classCode": "BIOE 181",
    "description": "Statistical sampling plans are used from bench top to scale up in diagnostics, biodevice manufacturing for defect sampling by the FDA. Starting from a review of the Central Limit Theorem, continuity correction and moment generating functions, the course transitions into discrete variable distributions used in single, multiple, and rectifying sampling plans. Instruction will be completed by JMP/SAS software. Also listed as BIOE 381. Prerequisites: BIOE 180. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Biosensors",
    "classCode": "BIOE 182",
    "description": "This course focuses on underlying engineering principles used to detect DNA, small molecules, proteins, and cells in the context of applications in diagnostics, fundamental research, and environmental monitoring. Sensor approaches include electrochemistry, fluorescence, optics, and impedance with case studies and analysis of commercial biosensors. Credit not allowed for both BIOE 182 and 277. Cross-listed with BIOE 277. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Physiology and Disease Biology",
    "classCode": "BIOE 185",
    "description": "This course will provide a molecular-level understanding of physiology and disease biology, an overview of gastrointestinal diseases, and an introduction to medical devices used in diagnosis and treatment, as well as challenges in this field. This course will include lectures, class discussions, case studies, and team projects. Also listed as BIOE 285. Prerequisite: BIOE 21 (or BIOL 1B). BIOE 171 recommended. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Biotechnology",
    "classCode": "BIOE 186",
    "description": "This course is designed to introduce basic and practical biotechniques to students with minimum training and background in biomolecular engineering. The basic principles and concepts of modern biotechniques will be illustrated and highlighted by studying real cases in lectures. Also listed as BIOE 286. Prerequisite: BIOE 22 or BIOL 1C. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Biotechnology II",
    "classCode": "BIOE 187",
    "description": "The course is designed to discuss practical applications of recombinant DNA technologies, data science, and other modern technologies in the biotechnology industry beyond pharmaceutical development. Specific topics include microbial, industrial, agricultural, environmental biotechnologies, and forensic science. The technical principles and concepts will be highlighted by reviewing real-world cases in lectures. The course will also discuss critical issues such as ethics, regulations, market, and business. Also listed as BIOE 288. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Co-op Education",
    "classCode": "BIOE 188",
    "description": "Practical experience in a planned program designed to give students practical work experience related to their academic field of study and career objectives. Satisfactory completion of the work assignment includes preparation of a summary report on co-op activities. P/NP grading. Prerequisites: junior status and cumulative GPA ≥ 2.75. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Work Experience and Co-op Technical Report",
    "classCode": "BIOE 189",
    "description": "Credit is given for a technical report on a specific activity, such as a design or research activity, after completing a co-op work assignment. Letter grades will be based on the content and quality of the report. May be taken more than once. Prerequisites: BIOE 188, junior status, cumulative GPA ≥ 2.75, and approval of department co-op advisor. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Drug Development Process",
    "classCode": "BIOE 190",
    "description": "This course is designed to discuss an overview of the modern pharmaceutical development process, from drug discovery and development, manufacturing, and the regulatory approval process. Specific topics will include current concepts of drug discovery, advanced drug screening methods, preclinical studies and requirements, and the four major phases of clinical development. There will be an emphasis on product development and manufacturing processes for biologics, such as monoclonal antibody-based drugs. Also listed as BIOE 290. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Design Project I",
    "classCode": "BIOE 194",
    "description": "Specification of an engineering project, selected with the mutual agreement of the student and the project advisor. Complete initial design with sufficient detail to estimate the effectiveness of the project. Initial draft of the project report. Prerequisite: senior standing. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Design Project II",
    "classCode": "BIOE 195",
    "description": "Continued design and construction of the project, system, or device. Second draft of the project report. Prerequisite: BIOE 194. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Design Project III",
    "classCode": "BIOE 196",
    "description": "Continued design and construction of the project, system, or device. Final project report. Prerequisite: BIOE 195. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Internship",
    "classCode": "BIOE 198",
    "description": "Directed internship in local bioengineering and biotech companies or research in off-campus programs under the guidance of research scientists or faculty advisors. Required to submit a professional research report. Open to upper-division students. (Variable units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Supervised Independent Research",
    "classCode": "BIOE 199",
    "description": "By arrangement. Faculty advisor required. (1-4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  }
]