[
  {
    "courseName": "Graphic Communication",
    "classCode": "CENG 7",
    "description": "Introduction to technical drawing including isometric and multiview drawings, use of sectional views and dimensioning, understanding blueprints and scales. Corequisite: CENG 7L. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Graphic Communication Laboratory",
    "classCode": "CENG 7L",
    "description": "Freehand drawing, manual and computer-aided drafting of physical models, construction of models from drawings. Corequisite: CENG 7. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Surveying",
    "classCode": "CENG 10",
    "description": "The use and care of survey instruments. Principles of topographic mapping, linear measurements, leveling, traverses, curves, boundary, and public surveys. Corequisite: CENG 10L. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Surveying Laboratory",
    "classCode": "CENG 10L",
    "description": "Field work using common surveying instrumentation and equipment. Corequisite: CENG 10. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Computer Applications in Civil Engineering",
    "classCode": "CENG 15",
    "description": "Solution techniques for civil engineering problems using common software and programming languages. Introduction to matrix analysis, graphical and numerical solution methods, regression analysis, and linear optimization using spreadsheets, basic programming, and math analysis programs. Students must complete a paper and presentation on a topic developed with analytical tools used in the course. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Geology",
    "classCode": "CENG 20",
    "description": "Development and formation of geologic materials. Significance of structure, landform, erosion, deposition. Stream and shoreline processes. Surface water. Corequisite: CENG 20L. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Geology Laboratory",
    "classCode": "CENG 20L",
    "description": "Identification, examination, and characterization of rock specimens. Corequisite: CENG 20. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Mechanics I: Statics",
    "classCode": "CENG 41",
    "description": "Resolution and composition of force systems and equilibrium of force systems acting on structures and mechanisms. Distributed forces. Friction. Moments of inertia. Prerequisite: PHYS 31. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Mechanics II: Strength of Materials",
    "classCode": "CENG 43",
    "description": "Analysis of stresses and strains in machines and structural members. Fundamental study of the behavior and response of statically determinate and indeterminate structural members subjected to axial, torsional, flexural, shear, and combined stresses. Introduction to the stability of columns. Prerequisite: CENG 41. Corequisite: CENG 43L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Mechanics II: Strength of Materials Laboratory",
    "classCode": "CENG 43L",
    "description": "Testing of structural elements subjected to axial tension and compression loads, bending, torsion, and combined loading. Analysis of test data and laboratory report writing. Corequisite: CENG 43. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Strength of Materials I",
    "classCode": "CENG 44A",
    "description": "Stress-strain relationships for structural elements subjected to axial, torsional, flexural, shear, and combined loading. Fundamental study of the behavior and response of deformable, statically determinate structural systems. Stress and strain transformations and analysis using Mohr’s circle. Prerequisite: CENG 41. Corequisite: CENG 44AL. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Strength of Materials I Lab",
    "classCode": "CENG 44AL",
    "description": "Testing of structural elements subjected to axial tension and compression loads, bending, torsion, and combined loading. Analysis of test data and laboratory report writing. Corequisite: CENG 44A. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Strength of Materials II",
    "classCode": "CENG 44B",
    "description": "Continuation of topics covered in CENG 44A. Shear flow and shear center. Indeterminate systems. Introduction to plastic behavior and column stability. Prerequisite: CENG 44A. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Construction Materials",
    "classCode": "CENG 45",
    "description": "Exploration of the various materials used and applied in the building construction process. The characteristics, specifications, and applications of basic construction materials such as soil, concrete, wood, steel, and bituminous products. Includes presentation, discussion, and analysis of conventional and non-conventional construction materials along with their sustainability implications. Civil Engineering students can not enroll in this course and should enroll in CENG 115. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Construction Materials Laboratory",
    "classCode": "CENG 45L",
    "description": "Laboratory testing and processing of steel, concrete, wood, and other non-conventional civil engineering construction materials. Corequisite: CENG 45. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Civil Engineering Materials",
    "classCode": "CENG 115",
    "description": "Review of the structure and properties, production processes, and experimental methods used for determining key properties of common civil engineering materials with a focus on steel, concrete, and wood. Non-conventional building materials and their applications are studied along with sustainability implications of any material choice. Prerequisites: CHEM 11 or equivalent and CENG 44A. Corequisite: CENG 115L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Civil Engineering Materials Laboratory",
    "classCode": "CENG 115L",
    "description": "Laboratory testing of steel, concrete, wood, and other non-conventional civil engineering construction materials. Corequisite: CENG 115. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Construction Management",
    "classCode": "CENG 118",
    "description": "Introduction to construction roles and responsibilities, construction project phases, building systems, bidding and cost estimating, building trades and subcontractors, construction methods, and safety and quality management. Also listed as CENG 218. Prerequisite: Junior standing. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Design for Sustainable Construction",
    "classCode": "CENG 119",
    "description": "Design strategies for sustainable commercial and residential construction. Use of LEED criteria for assessing sustainable construction. Team-based project planning, design, and construction. Economic evaluation of sustainable technologies. Prefabrication. Overall project management. Also listed as CENG 219. Prerequisite: junior standing. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Geotechnical Engineering",
    "classCode": "CENG 121A",
    "description": "Origin, development, and properties of soils. Classification of soils and applications of engineering mechanics to soils as an engineering material. Water in soils. Soil-testing methods. Compaction, stabilization, consolidation, shear strength, and slope stability. Prerequisites: CENG 20 and 44A. Corequisite: CENG 121AL. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Geotechnical Engineering Laboratory",
    "classCode": "CENG 121AL",
    "description": "Application of soil testing methods. Corequisite: CENG 121A. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Geotechnical Engineering Design I",
    "classCode": "CENG 121B",
    "description": "Theory and basic factors related to earth pressure, slope stability, and foundations. Prerequisite: CENG 121A. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Air Pollution",
    "classCode": "CENG 122",
    "description": "The study of generation of common air pollutants, their transport, effects, and state-of-the-art air pollution control strategies. Also listed as CENG 252. Prerequisite: CENG 143 or consent of the instructor. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Pollutant Fate and Transport",
    "classCode": "CENG 123",
    "description": "Study of reaction energetics,  kinetics, interphase mass transfer, and partitioning as they relate to pollutant transformation in the environment. Application to surface waters and groundwater.  Also listed as CENG 253. Prerequisites: CHEM 11 or CHEM 11T or equivalent, CENG 143, AMTH 106, and junior standing, or instructor’s consent. Corequisite: CENG 123L. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Pollutant Fate and Transport Laboratory",
    "classCode": "CENG 123L",
    "description": "Use of experimentation and computer modeling to analyze problems in chemical kinetics, pollutant transport, and phase partitioning. Also listed as CENG 253L. Corequisite: CENG 123.  (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Water Law and Policy",
    "classCode": "CENG 124",
    "description": "Introduction to the legal and regulatory concepts related to water. Examines rights, policies, and laws, including issues related to water supply and access (water transfers/water markets, riparian and appropriative doctrines), flood control, water pollution and quality (the Clean Water Act, EPA standards, stream flows for fish), and on-site stormwater management/flood control. A focus on California water law and policy is complemented with some national and international case studies. Also listed as CENG 258 and ENVS 124. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Municipal Engineering Design",
    "classCode": "CENG 125",
    "description": "Various aspects of civil engineering as applied in municipal (public works) design practice. Maps and plats; site layout and earthworks; drainage; streets and utilities. Prerequisites: CENG 7 and 10. Corequisite: CENG 125L. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Municipal Engineering Design Laboratory",
    "classCode": "CENG 125L",
    "description": "Development of CAD drawings for a design project. Corequisite: CENG 125. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Engineering Project Management",
    "classCode": "CENG 128",
    "description": "Time value of money, economic analysis of engineering projects, rate-of-return analysis, cash-flow analysis, depreciation, project management, planning and capital budgeting, scheduling, preliminary cost estimates, risk analysis, financial analysis. Prerequisite: junior standing. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Structural Analysis",
    "classCode": "CENG 132",
    "description": "Distribution of loads in structural systems. Analysis of statically determinate and indeterminate beams, trusses, and frames. Influence lines for beams and trusses. Introduction to structural modeling, and elastic analysis using commercial software programs. Prerequisite: CENG 44A. Corequisite: CENG 44B. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Wood Design",
    "classCode": "CENG 133",
    "description": "Design of wood structural systems. Design of sawn and structural composite lumber members for tension, compression, bending, and shear. Introduction to shear wall and diaphragm design. Design of connections. Also listed as CENG 233. Prerequisite: CENG 132. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Structural Steel Design I",
    "classCode": "CENG 134",
    "description": "Design of structural steel buildings. Design of steel members for tension, flexure, shear, compression, and combined loading. Design of composite floor beams. Introduction to connection design. Prerequisite: CENG 148. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Reinforced Concrete Design",
    "classCode": "CENG 135",
    "description": "Design of one-way slabs, tee beams, and doubly-reinforced beams for flexure and shear; moment coefficient method; deflection estimates; longitudinal bar cutoffs and detailing; biaxial bending and slender columns. Prerequisite: CENG 148. Corequisite: CENG 135L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Reinforced Concrete Laboratory",
    "classCode": "CENG 135L",
    "description": "Experimental tests of reinforced concrete building components; problem solving and review sessions; field trip(s). Corequisite: CENG 135. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Advanced Concrete Structures",
    "classCode": "CENG 136",
    "description": "Confinement, moment-curvature and shear-displacement response; modeling; design and detailing of special moment frames, shear walls, and diaphragms; prestressed concrete beams. Also listed as CENG 236. Prerequisite: CENG 135 and 137. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Earthquake Engineering Design",
    "classCode": "CENG 137",
    "description": "Introduction to seismic sources, wave propagation, and effects on structures. Spectral representations of demands. Design according to current code provisions and using simplified pushover methods. Also listed as CENG 237. Prerequisite: CENG 148. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Geotechnical Engineering Design II",
    "classCode": "CENG 138",
    "description": "Foundation exploration; bearing capacity and settlement analysis; spread foundations; piles and caissons; earth-retaining structures; loads on underground conduits; subsurface construction. Also listed as CENG 238. Prerequisites: CENG 121A and 121B. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Groundwater Hydrology",
    "classCode": "CENG 139",
    "description": "Groundwater occurrence, flow principles, flow to wells, and regional flow. Groundwater contamination, management, and modeling. Field methods. Field trips. Also listed as CENG 259. Prerequisite: CENG 141 or permission of instructor. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Water Resources Engineering",
    "classCode": "CENG 140",
    "description": "Concepts, analysis, and engineering design related to water resources: hydrologic cycle, evaporation, infiltration, precipitation, snow, flood frequency, water supply, and runoff management. Impacts of development, land use, and climate changes on water supply, and the importance of these changes to society. Prerequisite: CENG 141 or permission of instructor. Corequisite: CENG 140L and (AMTH 112 or AMTH 108). (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Water Resources Engineering Laboratory",
    "classCode": "CENG 140L",
    "description": "Computational exercises for water resources analysis, field trips demonstrating hydrologic monitoring systems and complex regional water management systems. Corequisite: CENG 140. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Fluid Mechanics and Hydraulic Engineering",
    "classCode": "CENG 141",
    "description": "Fundamentals of fluid behavior with an emphasis on water. Covers basic fluid properties, flow classification, and fluid statics including forces on submerged surfaces. Introduces and applies fundamental relationships: conservation of mass, momentum, and energy. Hydraulic applications include flow in pipes and pipe networks, steady flow in open channels, and hydraulic machinery. Prerequisites: CENG 41, PHYS 31. Corequisite: CENG 141L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Fluid Mechanics and Hydraulic Engineering Laboratory",
    "classCode": "CENG 141L",
    "description": "Experiments demonstrating the principles of fluid flow and hydraulics for flow in pipes and in open channels. Use of modern data acquisition and writing of formal lab reports. Corequisite: CENG 141. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Water Resources Design",
    "classCode": "CENG 142",
    "description": "Design of system components for water supply and flood control projects including storage facilities, closed conduits, open channels, well fields, and pumping systems. Also listed as CENG 242. Prerequisites: CENG 141 and CENG 140 (CENG 140 may be taken concurrently) or permission of instructor. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Environmental Engineering",
    "classCode": "CENG 143",
    "description": "Water and air quality. Water supply and pollution control; air pollution control. Management of solid wastes. Prerequisites: CHEM 11 or CHEM 11T, MATH 12, and junior standing. Corequisite: CENG 143L. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Environmental Engineering Laboratory",
    "classCode": "CENG 143L",
    "description": "Laboratory analysis of aqueous samples and ideal reactor systems. Analysis of non-point pollution prevention strategies. Solid waste characterization. Corequisite: CENG 143. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Water and Wastewater Treatment",
    "classCode": "CENG 144",
    "description": "Design of water and municipal wastewater treatment systems. Topics include unit operations such as flocculation, sedimentation, filtration, biological treatment, nutrient removal, disinfection, and sludge management..  Also listed as CENG 254. Prerequisites: CENG 143 or instructor’s consent. Corequisite: CENG 144L. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Water and Wastewater Treatment Laboratory",
    "classCode": "CENG 144L",
    "description": "Laboratory experiments to characterize water samples, including BOD and COD measurements. Field trips to local water and wastewater treatment plants. Also listed as CENG 254L. Corequisite: CENG 144. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Transportation Engineering Design",
    "classCode": "CENG 145",
    "description": "Transportation systems analysis. Dynamics and traffic flow. Highway geometric design, traffic control, transportation planning. Transportation policies and economics. Prerequisites: CENG 10 and junior standing. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Design of Cold-Formed Steel Frame Structures",
    "classCode": "CENG 146",
    "description": "Introduction to cold-formed steel design and construction. Practical design of members for tension, compression, shear, and torsion. Connection detailing. Lateral force-resisting systems. Also listed as CENG 246. Prerequisite: CENG 132. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Pavement Design",
    "classCode": "CENG 147",
    "description": "Paving materials. Geometric and structural design of highways. Urban street layout and details. Layout and design of airport runways. Also listed as CENG 247. Prerequisites: CENG 115, 121A and 121B. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Structural Systems",
    "classCode": "CENG 148",
    "description": "Structural requirements for building systems. Design loads, load combinations, and load path. Fire, sound, thermal, and mechanical requirements. An introduction to the design of steel and reinforced concrete beams and columns. Prerequisite: CENG 132. Corequisite: CENG 148L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Structural Systems Laboratory",
    "classCode": "CENG 148L",
    "description": "Modeling, analysis, and evaluation of building structures. Structural drawings/schematics. Corequisite: CENG 148. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Civil Systems Engineering",
    "classCode": "CENG 149",
    "description": "Introduction to engineering systems analysis and management technologies and their applications to civil engineering problems such as transportation, assignment, critical path, and maximum flow problems. Topics include linear programming, nonlinear programming, probability, and queuing theory, as well as relevant applications to civil engineering problems. Also listed as CENG 249. Prerequisites: MATH 13 and junior standing. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Traffic Engineering: Design and Operations",
    "classCode": "CENG 150",
    "description": "Basic characteristics of motor vehicle traffic flow, highway capacity analysis, traffic control devices, traffic data studies and signal design, and traffic safety. Also listed as CENG 250. Prerequisite: CENG 145. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Special Topics in Transportation Engineering",
    "classCode": "CENG 151",
    "description": "Coverage of special topics in transportation engineering including travel demand forecasting, analysis and application, static and dynamic traffic analysis and modeling for short-term and long-term planning and optimization. Also listed as CENG 251. Prerequisite: CENG 145. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "GIS in Water Resources",
    "classCode": "CENG 160",
    "description": "Introduction to Geographical Information Systems (GIS) technology with applications in watershed analysis, interpolation, site suitability assessment, and spatial analysis of environmental data. Obtaining and processing digital information at different scales for state-wide, watershed, and urban areas and combination of location information with tabular information such as census data. Commercial and open-source software are used. Also listed as CENG 260. Prerequisites: junior standing and experience with Windows directory and file management, or permission of instructor. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Sustainable Water Resources",
    "classCode": "CENG 161",
    "description": "Analysis and design of water resource systems, from flood control projects to drinking water supply, as environmental constraints and societal values shift. Quantitative analysis of environmental data is used to detect changes and project future conditions. Includes sustainable and low-impact design techniques, climate change impacts on water, assessing sustainability, life-cycle economics, and current topics. Also listed as CENG 261. Prerequisite: CENG 140 or permission of instructor. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Computational Water Resources",
    "classCode": "CENG 162",
    "description": "Use of professional application software to analyze systems for water resources engineering projects. Computational tools include the development of a computer model to translate rainfall into runoff for a river basin, and assess the impacts of climate variability and change on water supply. Also listed as CENG 262. Prerequisites: CENG 140, which may be taken concurrently, or equivalent. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Solid and Hazardous Waste Management",
    "classCode": "CENG 163",
    "description": "Characterization of solid waste streams. Overview of collection, transport, processing, and disposal options. Waste stream reduction and resource recovery strategies. Also listed as CENG 263. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Building Information Modeling (BIM)",
    "classCode": "CENG 182",
    "description": "Parametric design and modeling, BIM-based scheduling and estimating, model checking and validation, 4D visualization, green building design, applications in integrated project delivery and facilities management, interoperability, standardization, and web-based collaboration. Also listed as CENG 282. Prerequisites: CENG 125 and junior standing. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Building Systems",
    "classCode": "CENG 183",
    "description": "Introduction to the major systems within a building, including heating, ventilation, air conditioning, electrical, energy, life safety, and plumbing. The engineering, construction, and sustainability aspects of each system will be introduced. Also listed as CENG 283. Prerequisite: Junior standing. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Construction Project Delivery",
    "classCode": "CENG 184",
    "description": "Project organization and delivery systems, Project stakeholders authorities and responsibilities, contractual payment schemes, bidding process, preconstruction administration, contracts, payment measurement, change orders, quality management, safety, claims and disputes, risk and liability sharing, project documentation and closeout, lean construction, pull planning, work structuring, lean supply chain, lean project delivery system. Also listed as CENG 284. Prerequisite: Junior standing. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Cost Estimation",
    "classCode": "CENG 185",
    "description": "Types of construction cost estimates and their uses. Direct and indirect costs. Cost budgeting and control. Quantity Takeoff. Cost databases and software. Detailed cost estimates of main building systems. Also listed as CENG 285. Prerequisites: CENG 118. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Construction Planning and Control",
    "classCode": "CENG 186",
    "description": "Work breakdown structure, work sequencing and logic, activity duration estimates, schedule network representations, critical path method, stochastic scheduling, resources loading, resource allocation, time-cost tradeoffs, and project cash flow analysis. Planning of repetitive tasks, and time-cost control. Use of commercial scheduling software. Group project on construction planning. Also listed as CENG 286. Prerequisite: CENG 118. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Heavy Construction",
    "classCode": "CENG 187",
    "description": "Earthmoving with dozers, scrapers, and excavators; hauling, compacting, concrete operations, asphalt paving, work and production plans. Machine power and resistance, piling, cranes, and rigging operations. Also listed as CENG 287. Prerequisite: junior standing. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Co-op Education",
    "classCode": "CENG 188",
    "description": "Practical experience in a planned program designed to give students practical work experience related to their academic field of study and career objectives. Satisfactory completion of the work assignment includes preparation of a summary report on co-op activities. P/NP grading. May not be taken for graduate credit. (1–2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Co-op Technical Report",
    "classCode": "CENG 189",
    "description": "Technical report on a specific activity such as a design or research project, etc., completed during a co-op assignment. Approval of department advisor required. Letter grade based on content and quality of report. May not be taken for graduate credit. Prerequisite: CENG 188. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Civil Engineering Project Development",
    "classCode": "CENG 192A",
    "description": "Introduction to problem-solving methodology for the design of civil engineering systems and components. Selection of Capstone Design Project, definition of problem, and conceptual design. Prerequisite: Junior standing. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Elements of Civil Engineering Practice",
    "classCode": "CENG 192B",
    "description": "Further development of problem-solving methodology; introduction to project management. Applications of engineering techniques and procedures to civil engineering design. Schematic designs, alternatives analysis and cost estimates. Preliminary design of critical components or subsystems of Capstone Design Project. Environmental impact assessment. Prerequisite: CENG 192A. Corequisite: CENG 192C. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Professional Development Seminar",
    "classCode": "CENG 192C",
    "description": "Importance of licensing and lifelong learning in the practice of civil engineering. Advanced workshops on topics relevant to Capstone Design Projects. Review of topics covered on the Fundamentals of Engineering (FE) exam. Corequisite: 192B. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Detailed Project Design",
    "classCode": "CENG 193",
    "description": "Investigation of an approved Capstone Design Project. The design process, including problem formulation, analysis, preliminary design, final design, and plans, is completed. Formal presentation of preliminary and final designs. Prerequisite: CENG 192B. Corequisite: CENG 193L. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Detailed Project Design Lab",
    "classCode": "CENG 193L",
    "description": "Weekly meetings with 193L instructor for approved Capstone Design Project. The design process, including problem formulation, analysis, preliminary design, final design, and plans, is completed. Formal presentation of preliminary and final designs.  Corequisite: CENG 193. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Design Project Communication",
    "classCode": "CENG 194",
    "description": "Completion of design project documentation and public presentation of results. Prerequisite: CENG 193. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Special Topics in Civil Engineering",
    "classCode": "CENG 197",
    "description": "Subjects of current interest. May be taken more than once if topics differ. (1–4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Internship",
    "classCode": "CENG 198",
    "description": "Time off campus with an engineering organization. Different aspects of work in the assigned professional office. Oral and written reports. Prerequisites: Senior standing and approval of internship coordinator. (4–5 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Directed Research",
    "classCode": "CENG 199",
    "description": "Investigation of an approved engineering problem and preparation of a suitable project report. Conferences with faculty advisor are required. Prerequisite: Junior standing. (1–5 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  }
]