[
  {
    "courseName": "Introduction to Engineering",
    "classCode": "ENGR 1",
    "description": "This course provides an introduction to engineering, including fundamentals of engineering study, different engineering disciplines, and interdisciplinary aspects of engineering. This course investigates the connection between science, technology, and society, and also illustrates the extent to which engineering impacts the world. The course also exposes students to entrepreneurship, engineering professionalism, the growth mindset, emerging markets, ethics, and civic engagement. ENGR 1 and ENGR 1L together fulfill the Science, Technology & Society core requirement. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Engineering Laboratory",
    "classCode": "ENGR 1L",
    "description": "The laboratory will provide students with hands-on experience of engineering design and open-ended problem solving. The lab focuses on introducing aspects of the different engineering disciplines and allows students to gain experience with each of the engineering disciplines and reflect on learning gains with teamwork, communication, and engineering skills. Engineering designs will be framed to include the impact of design solutions/technologies on society and will be developed in a team-based environment utilizing visuals, written text, and oral presentation. ENGR 1 and ENGR 1L together fulfill the Science, Technology & Society core requirement. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Engineering Design and Prototyping",
    "classCode": "ENGR 2",
    "description": "Introduction to prototyping in the engineering design framework. Students will work to design and prototype projects on four major pieces of Maker Lab equipment, which they will be trained to use. Prerequisite: ENGR 1L. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Culture, Tech, and  the Common Good I",
    "classCode": "ENGR 11a",
    "description": "First course in a two-course sequence that examines the connections between technological innovation and the common good across different cultures and historical periods. Exploring global case studies, students identify elements, and explore the complexity, of the cultures examined through course modules on significant objects, texts, ideas, issues, and/or events in historical context related to technology and the common good. Students examine both shared and diverse human experiences across cultures to connect the relevance of the past to the cultural present, as well as to personal worldviews, cultural assumptions, and values, in probing technology and the common good. Course will satisfy the Cultures and Ideas 1 requirement. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Culture, Tech, and the Common Good II",
    "classCode": "ENGR 12a",
    "description": "Second course of the two-course sequence that examines the connections between technological innovation and the common good across different cultures and historical periods. Exploring global case studies, students identify elements, and explore the complexity, of the cultures examined through course modules on significant objects, texts, ideas, issues, and/or events in historical context related to technology and the common good. Students examine both shared and diverse human experiences across cultures to connect the relevance of the past to the cultural present, as well as to personal worldviews, cultural assumptions, and values, in probing technology and the common good. Course will satisfy the Cultures and Ideas 2 requirement. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Environmental Quality Engineering",
    "classCode": "ENGR 15",
    "description": "Behavior of chemicals in the environment. Environmental protection strategies. Environmental impact assessment. Risk analysis and economic considerations. Discussion of local, regional, and global environmental problems, and alternative solutions. For non-engineering majors. Prerequisite: MATH 6 or equivalent. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Values and Technology",
    "classCode": "ENGR 16",
    "description": "This course will draw upon the resources of Catholic theology and African Ubuntu theology to help students explore their own perspectives on the purpose and use of technology in the modern world. Intended for engineering students and others who are interested in entering into the design and development of technology, this course will invite students to develop their own set of tech values that inform how they will both use and design contemporary technology, by exploring foundational questions about the nature of humanity, society, and creation. ENGR 16 satisfies the RTC 1 core requirement. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Ethics in Technology",
    "classCode": "ENGR 19",
    "description": "Making the case for constructive ethical application of the most powerful technologies of the 21st century. Normative, principle-based ethical analysis of current and emerging technology in arenas including information, energy, biotech/medicine, military science, robotics, and agriculture. ENGR 19 satisfies the Ethics Core requirement. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Topics in Robotics",
    "classCode": "ENGR 20",
    "description": "Participate in a project-based, hands-on engineering project in a team-based environment. Gain exposure to sensing, actuation, and control techniques and components in the process of developing a robotic system or subsystem. Prerequisite: Instructor permission required. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Sustainable Energy Projects",
    "classCode": "ENGR 25",
    "description": "Students learn the fundamentals of sustainable energy in a wide range of fields and carry out projects in these areas. Activities are normally associated with the Latimer Energy Scholars Program. May be repeated for credit. Prerequisite: Instructor permission required. (1–2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Sustainable Electric Energy",
    "classCode": "ENGR 60",
    "description": "This course explores the twofold 21st-century challenges of the use and conservation of electric energy, and the sustainable generation of electric energy, primarily through the use of photovoltaic cells. The course includes a study of issues relating to the environment, economics, politics, and societal impact. Although physical and mathematical studies and analyses are a part of the course, no background in these areas is required beyond algebra. ENGR 60 satisfies the Science, Technology & Society Core requirement. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Special Topics in Engineering",
    "classCode": "ENGR 85",
    "description": "Subjects of current interest. May be taken more than once if topics differ. (1–4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Engineering Competition Workshop",
    "classCode": "ENGR 90",
    "description": "Workshop to develop aspects of an engineering school sponsored entry into an external competition (examples include Solar Decathlon and Tiny House). May include design, communication, construction, research, analysis, planning, documentation, fundraising, and other activities. Students will meet together to share information, brainstorm, collaborate, and make decisions, and will also work independently or in small teams in focused areas. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Architecture Workshop",
    "classCode": "ENGR 91",
    "description": "Students will explore aspects of architecture with a particular emphasis on design related to an external contest. General topics may include design principles; form and function; space utilization; natural and artificial lighting; BIM and architectural documentation; and texture and color. Special topics may include sustainable building materials, LEED certification process, passive solar design, building integrated photovoltaics, and modular building techniques. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Independent Study",
    "classCode": "ENGR 98",
    "description": "Independent study of an approved engineering problem and preparation of a suitable project report. (1–4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Community-Based Engineering Design",
    "classCode": "ENGR 110",
    "description": "Student teams are partnered with a local community business or organization and complete a design project from problem identification through final prototype. Course focuses on “hands-on” experience in project management, building cross-disciplinary team skills, and prototyping (training and use of the SCU Maker Lab included). This course is open to students at all levels and all majors (engineering or non-engineering). Come make a real difference in a real community! Satisfies the Civic Engagement Core requirement. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "STEM Outreach in the Community",
    "classCode": "ENGR 111",
    "description": "This course examines challenges surrounding STEM (Science, Technology, Engineering, and Math) education such as funding, diversity, and accessibility. Students develop or enhance STEM curricular materials and explore pedagogical techniques specific to working with youth from marginalized communities. Students taking ENGR111 and ENGR 111L will satisfy the ELSJ Core requirement. Corequisite: ENGR 111L. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "STEM Outreach in the Community Lab",
    "classCode": "ENGR 111L",
    "description": "Students lead engineering-focused STEM activities with K–12 students at a community partner’s off-campus site. No specific engineering expertise is required or expected. Corequisite: ENGR 111. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Advanced Sustainable Energy Projects",
    "classCode": "ENGR 125",
    "description": "Students study advanced concepts in sustainable energy and carry out complex projects, typically in a team environment. Activities are normally associated with the Latimer Energy Scholars Program. May be repeated for credit. Prerequisites: ENGR 25 and instructor permission required. (1–2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Humanitarian Engineering",
    "classCode": "ENGR 135",
    "description": "Engineering for social benefit. Introduction to the following concepts: humanitarian and frugal innovation, design for empathy, needs assessment, impact evaluation, and social entrepreneurship. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Frugal Innovation Projects for Social Benefit",
    "classCode": "ENGR 136",
    "description": "Students explore and apply the 10 core competencies of frugal innovation through case studies applied to mobile applications, low-cost diagnostics, frugal habitat, last-mile distribution and micro entrepreneurship, and learn how to design technologies and business models for social benefit. Student projects focus on real-world implementations with social enterprises in emerging markets. Prerequisite: Junior standing or sophomores with instructor consent. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Critical Tools for Social and Environmental Projects",
    "classCode": "ENGR 138",
    "description": "This class offers vital tools for completing projects in unfamiliar communities and/or cultures. Students will learn how to read and understand the human and environmental ecosystem where they and their projects are immersed, and incorporate this information into their design process to develop solutions that are socially, economically, and environmentally appropriate. Students will also learn how to implement a quick “need assessment evaluation” to uncover the scope, depth, impact, and local perception of the need they will solve, while familiarizing themselves with approaches and tools for problem-solving and innovation. Prereq: junior standing. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Diversity and Innovation in STEM",
    "classCode": "ENGR 140",
    "description": "This course focuses on the intersection of diversity, inclusion, and product or service innovation. Build understanding and skills to work with diverse perspectives and competencies from intersectionalities of race, gender, religion, region, and other dimensions of diversity, and derived from historical American systemic ideologies of individual freedom and success within a hierarchy as an individualistic mindset and of social responsibility with justice for all as a relational mindset in oneself, and in other individuals, organizations, systems, and cultures. Learn entrepreneurship and design thinking prototyping techniques while working in teams on innovation challenges that can change the world. Students will explore user-centered design by developing and applying design processes and strategies in hands-on exercises, design critiques, discussions, lectures, and readings. ENGR 140 satisfies the Diversity Core requirement. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Innovation Theology: An Introduction",
    "classCode": "ENGR 141",
    "description": "The course equips future innovators with the ability to discern more compelling answers to where innovations and value are needed and why by cultivating confidence in applying theological inquiry to innovation. ENGR 141 satisfies the Religion, Theology & Culture 2 Core requirement. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Science, Religion, and the Limits of Knowledge",
    "classCode": "ENGR 143H",
    "description": "The limits of scientific knowledge are examined in the framework of nonlinear system theory, metamathematics, and modern physics. The technical background developed in the course is used as a basis for exploring the relationship between science, aesthetics, and religion. Particular emphasis is placed on the rationality of faith, and on controversial questions where the views of scientists and theologians appear to conflict. ENGR 143 satisfies the Religion, Theology & Culture 2 core requirement. Prerequisite: MATH 12 or 31. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Smart Product Design",
    "classCode": "ENGR 144",
    "description": "Design of innovative smart electromechanical devices and products. Topics include a review of the basics of mechanical, electrical, and software design and prototyping, and will emphasize the synthesis of functional systems that solve a customer need, that are developed in a team-based environment, and which are informed by the use of methodologies from the fields of systems engineering, concurrent design, and project/business management. Designs will be developed in the context of a cost-constrained business environment, and principles of accounting, marketing, and supply chain are addressed. Societal impacts of technical products and services are reviewed. Enrollment is controlled in order to have a class with students from diverse majors. Prerequisites: Core Foundation-level natural science and mathematics, or equivalent; instructor permission required. Cross-listed with MECH 144. Co-requisite: ENGR 144L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Smart Product Design Laboratory",
    "classCode": "ENGR 144L",
    "description": "Laboratory for ENGR 144. Cross-listed with MECH 144L. Corequisite ENGR 144. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Innovation, Entrepreneurship, and the Evolution of Silicon Valley",
    "classCode": "ENGR 145",
    "description": "This course will explore technological innovation by studying the evolution of technologies and industries in Silicon Valley. We will review the development of fundamental technologies such as vacuum tubes, semiconductors, and biotechnology, and systems such as radar, communications, aerospace, personal computing, the internet, social media and platforms. This approach will help students to understand 1) the defining features of this region and how it has continued to lead in global technology development even as the fundamental technologies have changed, and 2) the complexity of the innovation process and the influence of the public sector, academia, investors, and other entities on innovation and entrepreneurship. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Nanotechnology and Society",
    "classCode": "ENGR 160",
    "description": "This course examines the fundamental scientific and technological underpinnings of the important new field of nanotechnology; how both the understanding and the technological capabilities have evolved over the past century; and how nanotechnology proposes new applications that can address social and economic goals. An appreciation of the interaction between these goals and the evolution of the technology will be central to the course. Students will develop critical thinking about the prospects for nanotechnology in order to be able to assess the relevant ethical and social issues, and also the possibility and/or likelihood of the development of specific applications. ENGR 160 satisfies the Science, Technology & Society Core requirement. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Globalization and the Cultures of Innovation and Entrepreneurship",
    "classCode": "ENGR 161",
    "description": "This course introduces students to the skills, practices, and processes for understanding and managing innovation and entrepreneurship activities that span cultures throughout the world. These cultural challenges include developing a deep understanding of the needs of customers in emerging markets, producing goods and services with global teams, and outsourcing manufacturing operations. ENGR 161 satisfies the Cultures & Ideas 3 Core requirement. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Thinking in Systems",
    "classCode": "ENGR 162",
    "description": "Systems thinking represents an important tool for analysis and problem-solving, especially when collaborating with others from diverse perspectives, both within and outside of engineering disciplines. The course will introduce students to basic concepts of thinking in systems by providing exposure to and experience with modeling methods from both systems dynamics and general systems theory. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Engineering and the Entrepreneurial Mindset I",
    "classCode": "ENGR 163A",
    "description": "This is the first course in a two-course sequence taken in conjunction with a senior capstone course and relates elements of the capstone experience to themes that are fundamental to entrepreneurial thinking. Activities are framed from the point of view of a business model in which explicit elements of an engineering enterprise are defined, such as customer segments, the value proposition, etc. To be immediately followed with ENGR 163B. (0.5 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Engineering and the Entrepreneurial Mindset II",
    "classCode": "ENGR 163B",
    "description": "This is the second course in a two-course sequence taken in conjunction with a senior capstone course and relates elements of the capstone experience to themes that are fundamental to entrepreneurial thinking. Activities are framed from the point of view of a business model in which explicit elements of an engineering enterprise are defined, such as customer segments, the value proposition, etc. Taken immediately following ENGR 163A. (0.5 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Financing New Ventures",
    "classCode": "ENGR 164",
    "description": "An introduction to the basics of obtaining initial and early-stage financial support for a new entrepreneurial venture. The course reviews financial sources, pitch decks, term sheets, negotiation tactics, and how to create the perfect pitch for obtaining financing. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Creativity: The Art of Innovation",
    "classCode": "ENGR 165",
    "description": "Creative confidence is foundational to human-centered design thinking, innovation, and entrepreneurship. In this interdisciplinary course, students strengthen skills in creativity and innovation through empathy gathering, photography, storytelling, improvisation, music, art, and prototyping. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Design Thinking A",
    "classCode": "ENGR 166A",
    "description": "The basic principles of design thinking, especially as applied to the three essentials for innovating success - user desirability, technical feasibility and business/economic viability. Explores techniques relating to themes such as deep customer understanding, creative brainstorming, and active prototyping.  These topics are applied in the context of a team-based project conducted through the ENGR 166 A and B course sequence (1 unit).",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Design Thinking B",
    "classCode": "ENGR 166B",
    "description": "The basic principles of design thinking, especially as applied to the three essentials for innovating success - user desirability, technical feasibility and business/economic viability. Explores techniques relating to themes such as deep customer understanding, creative brainstorming, and active prototyping.  These topics are applied in the context of a team-based project conducted through the ENGR 166 A and B course sequence. Prerequisite: ENGR 166A (1 unit).",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Go To Market Strategy",
    "classCode": "ENGR 167",
    "description": "This course for engineering undergraduate students reviews essential concepts for new entrepreneurial ventures to include the customer discovery phase, channels of distribution, strategic partners, and monetary metrics. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Legal Considerations for New Ventures",
    "classCode": "ENGR 168",
    "description": "This course for engineering undergraduate students identifies legal risks facing new ventures and reviews techniques and approaches on how to reduce these risks while accomplishing business or engineering goals. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "The Role of Innovation in Social Entrepreneurship and Social Justice",
    "classCode": "ENGR 169",
    "description": "This course focuses on learning about the role and significance of innovation in social entrepreneurship, and on exploring the various types of innovation that social enterprises may leverage. The course provides students with hands-on experience in an organization offering service to underserved populations. This service-based learning engagement will demonstrate an understanding and appreciation of the entrepreneurs engaged in these social businesses. The course introduces Social Entrepreneurship and develops an understanding of business models tied to financial sustainability and scalable social impact. This course is pending ELSJ approval to satisfy the Experiential Learning and Social Justice core requirement. The course fulfills the ELSJ core requirement. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Improv for Engineers",
    "classCode": "ENGR 170",
    "description": "Through theater games, improvisation, warm-up exercises, monologue, and scenes, students will learn the basics of Stanislavski’s method of physical actions to learn the basic principles of acting and in the process increase self-confidence and the ability to collaborate. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Product Opportunity Assessment",
    "classCode": "ENGR 171A",
    "description": "This course focuses on identifying and assessing opportunities for new products and services. Based on the principles of design thinking, it addresses the identification of problems by reviewing methods for understanding the needs and motivations of the customer. It also reviews the development of a validated and solution-independent need statement. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Product Prototype to Test",
    "classCode": "ENGR 171B",
    "description": "This course introduces product prototyping strategies to allow students to test their design concepts with customers with the objective of validating assumptions regarding customer need and desired functionality/features. Prerequisite: ENGR 171A or instructor permission. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Applied Entrepreneurship I",
    "classCode": "ENGR 172A",
    "description": "This is the first course in a two-course sequence in which students will explore an emerging technical market and develop specific viable business models to execute within the SCU educational program. Students will explore applications for the selected technology, identify customers/markets, and define a sustainable business model. Preferential admission may be given to students who have taken other courses in the school’s innovation and entrepreneurship program. Prerequisites: sophomore standing or above, and instructor permission required. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Applied Entrepreneurship II",
    "classCode": "ENGR 172B",
    "description": "This is the second course in a two-course sequence in which students will explore an emerging technical market and develop specific viable business models to execute within the SCU educational program. Students will explore applications for the selected technology, identify customers/markets, and define a sustainable business model. Prerequisites: ENGR 172A and instructor permission. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Business Fundamentals",
    "classCode": "ENGR 173",
    "description": "This course serves as an introduction to fundamental business topics, to include basic economics, business forms and functions, reading simple financial statements, basic marketing concepts, and management concepts. The course includes participation in an online business simulation. Prerequisite: sophomore to senior standing only. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Financial Reporting and Decision-Making",
    "classCode": "ENGR 174",
    "description": "This course develops an understanding of financial statements and how they may be analyzed to assess the performance of an enterprise. The course also reviews capital markets and associated decision making for corporate operation. A business simulation allows students to apply principles of management, operations, marketing, and accounting to a business scenario. Prerequisite: ENGR 173 or instructor permission. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Business Model and Plan Development",
    "classCode": "ENGR 175",
    "description": "This course introduces students to the Business Model Canvas as a framework for describing and organizing the operational elements of a functional enterprise, whether it is a commercial or nonprofit entity. Topics include identifying customers and explicitly stating the value proposition, identifying value delivery mechanisms, articulating strategic partnerships, identifying key resources, and describing anticipated cash flow. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Marketing Strategy",
    "classCode": "ENGR 176",
    "description": "This course reviews the strategic segmenting/targeting/positioning and practical messaging skills used in product marketing and thought leadership positions, which are core to entrepreneurial technology ventures. Specific topics include an overview of core marketing skill sets, practical examples of successful market segmentation and target selection, best practices for positioning and messaging creation, competitive landscape modeling and developing differentiation, translating customer requirements into effective positioning/messaging, and wholesale market (re-)definition. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Intellectual Property for Engineers",
    "classCode": "ENGR 178",
    "description": "This course for engineering undergraduate students provides an overview of United States intellectual property (IP) laws, focused specifically on how those laws impact and apply to engineers. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Intrapreneurship",
    "classCode": "ENGR 179",
    "description": "Intrapreneurship is a form of corporate entrepreneurship, and it focuses on the needs of an established organization (unlike a startup) to create an innovative business opportunity within the existing structure of the organization. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Marine Operations",
    "classCode": "ENGR 180",
    "description": "Introduction to the design, operation, deployment, piloting, and safety issues involving the use of underwater robots. Prerequisite: Instructor permission required. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Advanced Marine Operations",
    "classCode": "ENGR 181",
    "description": "Technical operation, maintenance, and advanced piloting of underwater robots. Crew management. Operational and safety procedures. Prerequisite: Instructor permission required. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Special Topics in Engineering",
    "classCode": "ENGR 185",
    "description": "Subjects of current interest. May be taken more than once if topics differ. (1–4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Co-op Education",
    "classCode": "ENGR 188",
    "description": "Practical experience in a planned program designed to give students practical work experience related to their academic field of study and career objectives. Satisfactory completion of the work assignment includes preparation of a summary report on co-op activities. P/NP grading. May not be taken for graduate credit. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Co-op Technical Report",
    "classCode": "ENGR 189",
    "description": "Credit given for a technical report on a specific activity such as a design or research project, etc., after completing the co-op assignment. Approval of department advisor required. Letter grades based on content and quality of report. May be taken twice. May not be taken for graduate credit. Prerequisite: COEN 188. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Senior Design Project",
    "classCode": "ENGR 193",
    "description": "Junior preparation for senior project. An introduction to project requirements, team management, and project management. Consideration of career documentation and networking. Tentative project selection. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Senior Design Project I",
    "classCode": "ENGR 194",
    "description": "Specification and initial investigation of an engineering project, selected with the mutual agreement of the student and the project advisor. The design process begins, including problem formulation, research, and preliminary design and analysis. Initial draft of the project report with oral presentation. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Senior Design Project II",
    "classCode": "ENGR 195",
    "description": "Continued design and construction of the project, system, or device. The design process continues, including design analysis, testing, and iteration. Second draft of the project report with oral presentation. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Senior Design Project III",
    "classCode": "ENGR 196",
    "description": "Completion of design and construction of the project, system or device. Design process concludes with formal communication of project details and specifications. Final project report and formal presentation of results. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Directed Research/Reading",
    "classCode": "ENGR 199",
    "description": "Investigation of an approved engineering problem and preparation of a suitable project report. Conferences with faculty advisor are required. Prerequisite: Instructor permission required. (1–6 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  }
]