[
  {
    "courseName": "Engineering Graphics and Computer-Aided Design I",
    "classCode": "MECH 10L",
    "description": "An introduction to engineering graphics and computer-aided design (CAD) using a 3D solid modeling software package. Topics include geometric construction, sketching, orthographic projection, isometric, and sectional views. Drawing and CAD laboratory classes will consist of lectures and exercises, demonstrations, and student work sessions. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Materials and Manufacturing Processes",
    "classCode": "MECH 11",
    "description": "The principles of manufacturing processes as related to materials properties, design, and production. A review of structures, properties, and manufacturing processes for main groups of engineering materials including metals and metallic alloys, polymers, and ceramics. Prerequisite: MECH 15. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Engineering Graphics and Computer Aided Design II",
    "classCode": "MECH 12L",
    "description": "Continuation of MECH 10L. An introduction to engineering graphics and computer-aided design (CAD) using a 3D solid modeling software package. Topics include dimensioning and tolerancing, descriptive geometry and auxiliary views, and assemblies. Drawing and CAD laboratory classes will consist of lectures and exercises, demonstrations, and student work sessions. Light machining will be introduced, as well. Prerequisite: MECH 10L, MECH students only. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Engineering Graphics and CAD III",
    "classCode": "MECH 13L",
    "description": "An introduction to advanced computer-aided design (CAD) using an advanced 3D parametric surface and solid modeling commercial tool. Topics include Advanced surface modeling, sheet metal design, meldment structures, topology optimization tools, FEA tools, etc. Prerequisite: MECH 10L or similar, ENGR students only. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Materials Science",
    "classCode": "MECH 15",
    "description": "Physical basis of the electrical, mechanical, optical, and thermal behavior of solids. Relations between micro/atomic structures, processing, and properties. Prerequisite: C- or better in CHEM 11. Corequisite: MECH 15L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Materials Science Laboratory",
    "classCode": "MECH 15L",
    "description": "Laboratory for MECH 15. Corequisite: MECH 15. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Tools for Collegiate-centric Student Competitions",
    "classCode": "MECH 25",
    "description": "Design and development of new student-centric projects that may follow a “concept design-to-build-and-test” type routine. Weekly student-faculty meetings, design reviews, research and prototype development presentations, industry tours, presentations from keynote speakers, etc. Prerequisites: MECH 12L or equivalent. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Applied Programming for Mechanical Engineers",
    "classCode": "MECH 45",
    "description": "Computer programming in MATLAB, including: use of the development environment, m-files, and debugging; data structures; flow control, including loops, vectorization, and conditional statements; functions and variable scope; file input and output; plotting and visualization; selected topics in object-oriented programming. Applications to engineering problems including linear algebra and differential equations. Prerequisite: C- or better in MATH 13. Co-requisite: MECH 45L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Applied Programming for Mechanical Engineers Lab",
    "classCode": "MECH 45L",
    "description": "Laboratory for MECH 45. Co-requisite: MECH 45. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Machining Laboratory",
    "classCode": "MECH 101L",
    "description": "Practical experience with machine tools such as mills, lathes, band saws, etc. Basic training in safe and proper use of the equipment associated with simple mechanical projects. Laboratory. P/NP grading. Prerequisites: MECH 12L and senior standing. Corequisite: MECH 194. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Mathematical Methods in Mechanical Engineering",
    "classCode": "MECH 103",
    "description": "Review of ordinary differential equations and Laplace transform; Fourier series; partial differential equations with applications to problems in vibration and heat conduction; and selected topics from linear algebra. Prerequisite: C- or better in AMTH 106. Corequisite: MECH 103R. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Mathematical Methods in Mechanical Engineering Recitation",
    "classCode": "MECH 103R",
    "description": "Recitation for MECH 103. Corequisite: MECH 103. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Machine Design I",
    "classCode": "MECH 114",
    "description": "Analysis and design of mechanical systems for safe operation. Stress and deflection analysis. Failure theories for static loading and fatigue failure criteria. Team design projects begun. Formal conceptual design reports required. Prerequisites: MECH 12L, 15 and CENG 43. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Machine Design II",
    "classCode": "MECH 115",
    "description": "Continuation of MECH 114. Treatment of basic machine elements (e.g., bolts, springs, gears, bearings). Design and analysis of machine elements for static and fatigue loading. Team design projects completed. Design prototypes and formal final report required. Prerequisite: MECH 114. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Thermodynamics I",
    "classCode": "MECH 121",
    "description": "Definitions of work, heat, and energy. First and second laws of thermodynamics. Properties of pure substances. Application to fixed-mass systems and control volumes. Irreversibility and device/cycle efficiencies. Prerequisite: C- or better in PHYS 32. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Thermodynamics I Recitation",
    "classCode": "MECH 121R",
    "description": "Recitation for MECH 121. Required for all mech students. Corequisite: MECH 121. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Fluid Mechanics",
    "classCode": "MECH 122",
    "description": "Fluid properties and definitions. Fluid statics, forces on submerged surfaces, manometry. Streamlines and conservation flow fields. Euler’s and Bernoulli’s equations. Mass, momentum, and energy analysis. Laminar and turbulent flows. Losses in pipes and ducts. Dimensional analysis and similitude. External flows. Corequisite: MECH 121,MECH 122L and MECH 140. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Fluid Mechanics Laboratory",
    "classCode": "MECH 122L",
    "description": "Laboratory for MECH 122. Corequisite: MECH 122. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Heat Transfer",
    "classCode": "MECH 123",
    "description": "Introduction to the concepts of conduction, convection, and radiation heat transfer. Application of these concepts to engineering problems. Prerequisites: MECH 121, and MECH 122. Corequisite: MECH 123L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Heat Transfer Laboratory",
    "classCode": "MECH 123L",
    "description": "Laboratory work to understand the concept of heat transfer. Practical experience with temperature and heat flux measurement. Corequisite: MECH 123. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Thermal Systems Design",
    "classCode": "MECH 125",
    "description": "Analysis, design, and simulation of fluids and thermal engineering systems. Application of optimization techniques, life cycle, and sustainability concepts in these systems. Prerequisite: MECH 123. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Thermodynamics II",
    "classCode": "MECH 131",
    "description": "Thermodynamic potential and availability, advanced power and refrigeration cycles, chemical equilibrium, advanced power and refrigeration cycles with non-reacting or reacting air/vapor mixture. Prerequisites: MECH 121. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Aerodynamics",
    "classCode": "MECH 132",
    "description": "Fundamentals of aerodynamics. Governing equations (mass, momentum, energy). Inviscid, incompressible flow applied to subsonic air flow: Laplace’s equations and flow superposition, Kutta-Joukowski theorem and generation of lift. Incompressible flow over airfoils: Kutta condition, Kelvin circulation theorem. Lifting flow over arbitrary bodies. Incompressible flow over finite wings: downwash and induced drag. Introduction to fundamental principles of viscous flow and discussion of drag components. Prerequisites: MECH 121, MECH 122 and MECH 122L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Dynamics",
    "classCode": "MECH 140",
    "description": "Kinematics of particles in rectilinear and curvilinear motion. Kinetics of particles, Newton’s second law, energy and momentum methods. Systems of particles. Kinematics and kinetics of plane motion of rigid bodies, energy and momentum methods. Introduction to three-dimensional dynamics of rigid bodies. Prerequisite: CENG 41. Corequisite: AMTH 106. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Mechanical Vibrations",
    "classCode": "MECH 141",
    "description": "Fundamentals of vibration, free and forced vibration of (undamped/damped) single degree and two-degree of freedom systems. Vibration under general forcing conditions. Determination of natuHral frequencies and mode shapes. Prerequisites: MECH 140. Corequisite: MECH 141L and AMTH 118. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Mechanical Vibrations Laboratory",
    "classCode": "MECH 141L",
    "description": "Laboratory for MECH 141. Corequisite: MECH 141. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Feedback Control Systems",
    "classCode": "MECH 142",
    "description": "Introduction to system theory, transfer functions, and state space modeling of physical systems. Course topics include stability, analysis and design of PID, Lead/Lag, other forms of controllers in time and frequency domains, root locus, Bode diagrams, state space pole placement, and gain and phase margins. Prerequisite: MECH 141. Corequisite: MECH 142L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Feedback Control Systems Laboratory",
    "classCode": "MECH 142L",
    "description": "Laboratory for MECH 142. Corequisite: MECH 142. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Mechatronics",
    "classCode": "MECH 143",
    "description": "Introduction to behavior, design, and integration of electromechanical components and systems. Review of appropriate electronic components/circuitry, mechanism configurations, and programming constructs. Use and integration of transducers, microcontrollers, and actuators. Cross-listed as ELEN 123 and COEN 123. Prerequisite: MECH 45 and ELEN 50. Corequisite: MECH 143L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Mechatronics Laboratory",
    "classCode": "MECH 143L",
    "description": "Laboratory for MECH 143. Cross-listed as COEN 123L and ELEN 123L. Corequisite: MECH 143. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Smart Product Design",
    "classCode": "MECH 144",
    "description": "Design of innovative smart electromechanical devices and products. Topics include a review of the basics of mechanical, electrical, and software design and prototyping, and will emphasize the synthesis of functional systems that solve a customer need, that are developed in a team-based environment, and which are informed by the use of methodologies from the fields of systems engineering, concurrent design, and project/business management. Designs will be developed in the context of a cost-constrained business environment, and principles of accounting, marketing, and supply chain are addressed. Societal impacts of technical products and services are reviewed. Enrollment is controlled in order to have a class with students from diverse majors. Cross-listed as ENGR 144.Prerequisites: Core Foundation-level natural science and mathematics, or equivalent; instructor permission required. Corequisite: MECH 144L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Smart Product Design Laboratory",
    "classCode": "MECH 144L",
    "description": "Laboratory for MECH 144. Cross-listed as ENGR 144L.Corequisite: MECH 144. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Aerospace Engineering",
    "classCode": "MECH 145",
    "description": "Basic design and analysis of atmospheric flight vehicles. Principles of aerodynamics, propulsion, structures and materials, flight dynamics, stability and control, mission analysis, and performance estimation. Introduction to orbital dynamics. Prerequisites: MECH 122 and MECH 122L.(4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Mechanism Design",
    "classCode": "MECH 146",
    "description": "Kinematic analysis and synthesis of planar mechanisms. Graphical synthesis of linkages and cams. Graphical and analytical techniques for the displacement, velocity, and acceleration analysis of mechanisms. Computer-aided design of mechanisms. Three or four individual mechanism design projects. Prerequisite: MECH 114. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Finite Element Theory and Applications",
    "classCode": "MECH 151",
    "description": "Basic introduction to finite elements; direct and variational basis for the governing equations; elements and interpolating functions. Applications to general field problems: elasticity, fluid mechanics, and heat transfer. Extensive use of software packages. Prerequisites: CENG 43 andMECH 45 or equivalent and AMTH 106. (3 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Composite Materials",
    "classCode": "MECH 152",
    "description": "Analysis of composite materials and structures. Calculation of properties and failure of composite laminates. Manufacturing considerations and design of simple composite structures. Knowledge of MATLAB or equivalent programming environment is required. Prerequisites: MECH 15, CENG 43, and MECH 45. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Aerospace Structures",
    "classCode": "MECH 153",
    "description": "This introductory course presents the application of fundamental theories of elasticity and stress analysis to aerospace structures. Course topics include fundamentals of elasticity, virtual work and matrix methods, bending and buckling of thin plates, component load analysis, and airframe loads, torsion shear, and bending of thin-walled sections. Prerequisites: CENG 43 and CENG 43L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Astrodynamics",
    "classCode": "MECH 155",
    "description": "This course provides the foundations of basic gravitation and orbital theory. Topics include Review of particle dynamics, classical orbital elements, basic transformation matrices, ground tracks, Hohmann transfer, coplanar rendezvous, combined change maneuver, and interplanetary flight. Prerequisites: MECH 45 or equivalent, and MECH 140. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Nanotechnology",
    "classCode": "MECH 156",
    "description": "Introduction to the field of nanoscience and nanotechnology. Properties of nanomaterials and devices. Nanoelectronics: from silicon and beyond. Measurements of nanosystems. Applications and implications. Laboratory experience is an integral part of the course. Also listed as ELEN 156. Prerequisites: PHYS 33 and either PHYS 34 or MECH 15. Corequisite: MECH 156L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Introduction to Nanotechnology Laboratory",
    "classCode": "MECH 156L",
    "description": "Optional laboratory for MECH 156. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Engineering Simulations and Modeling",
    "classCode": "MECH 157",
    "description": "Simulation and modeling of solids and fluids using modern computational methods. Application of finite element modeling techniques to analyze mechanical systems subjected to various types of loading. Heat conduction and fluid interaction effects with solids. Transient problems including vibrations. Practical experience gained in using commercial simulation packages and interacting with CAD systems. Review of basic finite element theory with particular attention to modeling loads, constraints and materials. Prerequisites: CENG 43, MECH 122, MECH 123 (can be taken concurrently) or equivalent knowledge. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Aerospace Propulsion Systems",
    "classCode": "MECH 158",
    "description": "Fundamentals of air breathing and rocket jet propulsion. Gas dynamics fundamentals, review of thermodynamic relation. Basic theory of aircraft gas turbine engines, propulsive efficiency, and application of Brayton cycle to gas turbine engine analysis. Rocket engine nozzle configuration and design. Thrust Equation. Chemical rocket engine fundamentals. Solid versus liquid propellant rockets. Prerequisites: MECH 121, MECH 122 and MECH 122L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Modern Instrumentation for Engineers",
    "classCode": "MECH 160",
    "description": "Introduction to engineering instrumentation, sensors, electric circuits, computer data acquisition, hardware and software, sampling theory, statistics, and error analysis. Theory of pressure, temperature, acceleration, and strain measurement. Prerequisites:MECH 123 or MECH 142. Corequisite: MECH 160L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Modern Instrumentation for Engineers Laboratory",
    "classCode": "MECH 160L",
    "description": "Laboratory work spans the disciplines of mechanical engineering: dynamics, controls, fluids, heat transfer, and thermodynamics, with emphasis on report writing. Students will design their own experiment and learn how to set up instrumentation using computer data acquisition hardware and software. Corequisite: MECH 160. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Materials Selection and Design",
    "classCode": "MECH 163",
    "description": "Design considerations in the use of materials; materials selection for optimizing multiple properties; materials failure modes and failure mechanism; materials selection to prevent failure; case studies and discussions on process economics, life-cycle thinking, and eco-design. Ansys Granta EduPack will be introduced as a materials and processes database and a tool for students to compare, analyze, and select materials and processes. Prerequisites: MECH 11 and CENG 43. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Special Topics in Material, Mechanics, Manufacturing, and Design",
    "classCode": "MECH 171",
    "description": "Technical Elective in the area of material, mechanics, manufacturing, and design.  A new topic in the area will be introduced.  Topics vary every time it is offered. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Special Topics in Thermofluids and Energy",
    "classCode": "MECH 172",
    "description": "Technical Elective in the area of thermofluids and energy.  A new topic in the area will be introduced.  Topics vary every time it is offered. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Special Topics in Dynamics, Controls, and Robotics",
    "classCode": "MECH 173",
    "description": "Technical Elective in the area of dynamics, controls, and robotics.  A new topic in the area will be introduced.  Topics vary every time it is offered. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Continuum Mechanics",
    "classCode": "MECH 177",
    "description": "General introduction to the mechanics of continuous media. Topics include the kinematics of deformation, the concept of stress, and the balance laws for mass, momentum, and energy. This is followed by an introduction to constitutive theory with applications to established models for viscous fluids and elastic solids. Concepts are illustrated through the solution of tractable initial-boundary-value problems. Prerequisites: MECH 122, CENG 43, and AMTH 106. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Satellite Operations Laboratory",
    "classCode": "MECH 179",
    "description": "This laboratory course reviews the physical principles and control techniques appropriate to communicating with, commanding, and monitoring spacecraft. Students learn to operate real satellite tracking, commanding, and telemetry systems, and to perform spacecraft-specific operations using approved procedures. Given the operational status of the system, students may conduct these operations on orbiting NASA spacecraft and interact with NASA scientists and engineers as part of operations processes. Instructor permission required. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Co-op Education",
    "classCode": "MECH 188",
    "description": "Practical experience in a planned program designed to give students practical work experience related to their academic field of study and career objectives. Satisfactory completion of the assignment includes preparation of a summary report on co-op activities. P/NP grading. May be taken for graduate credit. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Co-op Technical Report",
    "classCode": "MECH 189",
    "description": "Credit given for a technical report on a specific activity such as a design or research project after completing the co-op assignment. Approval of the department co-op advisor is required. Letter grades are based on content and presentation quality of report. Prerequisite: MECH 188. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Mechanical Engineering Project Manufacturing",
    "classCode": "MECH 191",
    "description": "Laboratory course that provides supervised evening access to the machine shop and/or light fabrication area for qualified mechanical engineering students to work on their University-directed projects. Students wishing to utilize the machine shop or light fabrication during the evening lab/shop hours are required to enroll. Enrollment in any section allows students to attend any/all evening shop hours on a drop-in basis. Staff or faculty will be present during each scheduled meeting to supervise as well as be available for consultation and manufacturing advising. Prerequisites: Students must be qualified for machine shop use through successful completion of MECH 101L and passing grade on the Mechanical Engineering Lab Safety Test. Qualifications for light fabrication area use: successful completion of the Light Fabrication Training Seminar and a passing grade on the Mechanical Engineering Lab Safety Test. P/NP. (1 unit)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Peer Educator in Mechanical Engineering",
    "classCode": "MECH 193",
    "description": "Peer Educators in Mechanical Engineering work closely with a faculty member to help students understand course material; think more deeply about course material; benefit from collaborative learning; feel less anxious about testing situations; and/or to help students enjoy learning. Enrollment is by permission of the instructor. P/NP. (1-2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Advanced Design I: Tools",
    "classCode": "MECH 194",
    "description": "Design tools basic to all aspects of mechanical engineering, including design methodology, computer-design tools, simulation, engineering economics, and decision making. Senior design projects begin. Prerequisite: MECH 115. Corequisite: MECH 101L. (4 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Advanced Design II: Implementation",
    "classCode": "MECH 195",
    "description": "Implementation of design strategy. Detail design and fabrication of senior design projects. Quality control, testing and evaluation, standards and specifications, and human factors. Prerequisite: MECH 194. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Advanced Design III: Completion and Evaluation",
    "classCode": "MECH 196",
    "description": "Design projects completed, assembled, tested, evaluated, and judged with opportunities for detailed re-evaluation by the designers. Formal public presentation of results. Final written report required. Prerequisite: MECH 195. (2 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Independent Study",
    "classCode": "MECH 198",
    "description": "By arrangement with faculty. (1–5 units)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  },
  {
    "courseName": "Directed Research/Reading",
    "classCode": "MECH 199",
    "description": "Investigation of an engineering problem and writing an acceptable report. Weekly meetings with a faculty advisor are required. (1-4 units per quarter, for a total of up to 8 units can be considered as technical electives)",
    "professors": [],
    "ratingCount": 0,
    "ratingTotal": 0,
    "quarterAvailability": [],
    "tags": [],
    "rating": null
  }
]