[
    {
      "courseName": "Personal Financial Planning",
      "classCode": "ACTG 5",
      "description": "Overview of the tools and information necessary for personal business decision making. Includes analysis of financial services, credit and borrowing, taxes, compensation planning, consumer purchases, housing decisions, the time value of money, savings, and investments. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Financial Accounting",
      "classCode": "ACTG 11",
      "description": "An introduction to the language of business, the accounting treatment of business transactions, and the analysis of financial reports. This course shows students how financial analysts use accounting principles to prepare financial statements and how managers, investors, and creditors use balance sheets, income statements, cash flow statements, and financial disclosures to make operating, investing, and financing decisions. Prerequisites: Must be a second-year student and have completed BUSN 70 or 170. Seniors who have not completed BUSN 70 may take this class with department permission on a space-available basis. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Managerial Accounting",
      "classCode": "ACTG 12",
      "description": "Introduction to the role of accounting information in the decision making of business managers. The objective is to investigate the use of business data in typical managerial functions such as product costing, planning, control, and operational decision-making. Prerequisite: ACTG 11. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Accounting Data Analysis and Visualization",
      "classCode": "ACTG 120",
      "description": "The course is designed to prepare students with a deeper understanding of both accounting process and the application of accounting knowledge in performing data analysis by leveraging two commonly used tools in data analysis and visualization – Microsoft Excel and Tableau. Prerequisites: Open to business majors only. ACTG 11 and OMIS 15, and must have 70 completed units or department’s permission prior to enrollment. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Intermediate Financial Accounting I",
      "classCode": "ACTG 130",
      "description": "An in-depth study of the concepts underlying external financial reporting, along with expanded coverage of basic financial statements. Detailed analysis of the measurement and reporting of current assets, operational assets, and investments, including the treatment of related revenues and expenses. Significant attention is given to income statement presentation and revenue recognition. Prerequisites: Open to business majors only. ACTG 12 and ACTG 120, and must have 96 completed units or department’s permission prior to enrollment. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Intermediate Financial Accounting II",
      "classCode": "ACTG 131",
      "description": "Intensive analysis of generally accepted accounting principles as applied to accounting for liabilities, stockholders’ equity, and the statement of cash flows. Accounting for income taxes, pensions, leases, and the reporting of corporate earnings per share. Prerequisites: Open to accounting and accounting and information systems majors only. ACTG 130. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Financial Accounting",
      "classCode": "ACTG 132",
      "description": "An in-depth study of accounting for business combinations and consolidation of financial statements of a parent company and its subsidiaries. A broad spectrum of financial reporting issues in the context of financial statement consolidation will be examined.  Other advanced financial accounting topics may also be introduced. Prerequisites: Open to accounting and accounting and information systems majors only. ACTG 131. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Accounting Information Systems",
      "classCode": "ACTG 134",
      "description": "Introduction to procedures by which accounting data is captured, processed, and communicated in computerized information systems. The course describes the ways that accounting information systems are designed, used, and maintained by accounting professionals with an emphasis on implementing accounting cycles and related controls, using key database concepts, and extracting, transforming, and loading data for analytics. Prerequisites: Open to business majors only. ACTG 11 and 12. (ACTG 12 may be taken concurrently.) (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Auditing",
      "classCode": "ACTG 135",
      "description": "Introduction to the basic concepts of auditing. Discussion of applicable regulations, the audit risk model, and client risk assessment. Focus is on an overview of the audit process. Audit sampling, the use of audit data analytics and historical cases will also be discussed. Prerequisites: Open to accounting and accounting and information systems majors only. ACTG 131. (ACTG 131 may be taken concurrently.) (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Cost Accounting",
      "classCode": "ACTG 136",
      "description": "Analysis of cost accounting with a strategic emphasis. Selected topics include job costing, activity-based costing, variance analysis, joint cost allocations, and the use of relevant cost in business decision making. Prerequisites: Open to accounting and accounting and information systems majors only. ACTG 130. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Tax Planning and Business Decisions",
      "classCode": "ACTG 138",
      "description": "A basic introduction to the tax treatment of transactions and events affecting both individuals and businesses and the conceptual framework underlying taxation. Includes issues of importance for successful tax planning with an emphasis on income and expense recognition, individual taxation, and property transactions. Assumes no prior knowledge of the tax law. Prerequisites: Open to business majors only. ACTG 11 and 12. (ACTG 12 may be taken concurrently.) (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Topics in Not for Profit Accounting",
      "classCode": "ACTG 140",
      "description": "This course will introduce the complexities and differences in the accounting conventions for not for profit entities. The course will focus on revenue recognition for different revenue streams, reporting standards, split interest agreements, net asset classifications, and endowment accounting. Prerequisites: ACTG 11. (3 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Accounting Ethics",
      "classCode": "ACTG 144",
      "description": "This course is designed with a particular focus on the roles and ethical responsibilities of the accounting, auditing, and tax professions; ethical behavior by management; and the legal guidelines that address behavior in a business setting. Prerequisites: Open to business majors only. ACTG 11 and 12, and either PHIL 26 or MGMT 6. This course must be taken for a letter grade. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Financial Fraud: Detection and Investigation",
      "classCode": "ACTG 150",
      "description": "Forensic accounting deals with the application of accounting methods to legal problems, and comprises investigative accounting and litigation support activities. Investigative accounting (usually referred to as fraud accounting) refers to the role of the accountant in determining the existence and extent of asset misappropriation and/or financial statement fraud. Litigation support activities include those professional services provided by accountants to attorneys in support of civil or criminal litigation. In addition to examining both aspects of forensic accounting, the legal system and the role of the forensic accountant as an expert witness will be discussed. Prerequisites: Open to business majors only. ACTG 131. (ACTG 131 may be taken concurrently.) (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Financial Statement Analysis",
      "classCode": "ACTG 151",
      "description": "Provides a framework for analyzing financial statements and develops skills useful in evaluating company performance, liquidity, solvency, financial forecasts, and valuation in the context of the company’s strategy and competitive environment. Prerequisites: Open to business majors only. ACTG 11 and FNCE 121 or 121S. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Financial Information Systems",
      "classCode": "ACTG 155",
      "description": "Course focuses on computer-based financial information systems that allow finance and accounting professionals to acquire and manage a company’s financial system. Topics include the business functions of a financial information system, the technical aspects of the system, and the management issues of implementing such a system. Students will acquire hands-on experience using ERP systems. Students who receive credit for OMIS 150 may not take this course for credit. Also listed as OMIS 150. Prerequisites: OMIS 30 and OMIS 105. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Junior Contemporary Business Seminar Series I",
      "classCode": "ACTG 161",
      "description": "A series of seminars covering topics pertinent to those pursuing a professional accounting career. Students are required to attend sessions with the course instructor and attend seminars sponsored by the Department of Accounting. Prerequisites: Open to accounting and accounting and information systems majors only. ACTG 12 or ACTG 120. ACTG 120 may be taken concurrently. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Junior Contemporary Business Seminar Series II",
      "classCode": "ACTG 162",
      "description": "A series of seminars covering topics pertinent to those pursuing a professional accounting career. Students are required to attend sessions with the course instructor and attend seminars sponsored by the Department of Accounting. Prerequisites: Open to accounting and accounting and information systems majors only. ACTG 12 or 120. ACTG 120 may be taken concurrently. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Senior Contemporary Business Seminar Series I",
      "classCode": "ACTG 171",
      "description": "A series of seminars covering topics pertinent to those pursuing a professional accounting career. Students are required to attend sessions with the course instructor and attend seminars sponsored by the Department of Accounting. Prerequisites: Open only to senior-declared accounting and accounting and information systems majors. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Senior Contemporary Business Seminar Series II",
      "classCode": "ACTG 172",
      "description": "A series of seminars covering topics pertinent to those pursuing a professional accounting career. Students are required to attend sessions with the course instructor and attend seminars sponsored by the Department of Accounting. Prerequisites: Open only to senior-declared accounting and accounting and information systems majors. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Peer Educator in Accounting",
      "classCode": "ACTG 191",
      "description": "Work closely with the department to help students in core accounting classes understand course material, think more deeply about the material, and feel less anxious about testing situations. Prerequisites: Declared accounting or accounting and information systems major and permission of instructor and chair required prior to enrollment. (1 or 2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Accounting Internship",
      "classCode": "ACTG 198",
      "description": "Opportunity for upper-division students to work in local accounting or corporate firms. Two written reports and the employer’s evaluation of the student’s work will be required. This course may be repeated for credit depending on the natureof the assignment. Prerequisites: Declared accounting or accounting and information systems major and permission of instructor and chair. (2–5 units per quarter, up to a maximum of 10 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Reading/Directed Research",
      "classCode": "ACTG 199",
      "description": "Independent projects undertaken by upper-division students with a faculty sponsor. Prerequisites: Declared accounting or accounting and information systems major and permission of instructor and chair. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    }
  ]