[
    {
      "courseName": "Communication in Contemporary Life",
      "classCode": "COMM 1",
      "description": "This course introduces students to the role of communication in various contexts (families, organizations, groups, institutions, culture, etc), and modalities (social media, film, journalism, speech, narrative, etc). This course considers the disciplinary background of communication research and theory (psychology, sociology, anthropology, media ecology, etc). The course teaches students to understand the formation and critique of theories of communication, focusing on ethics, diversity, and social justice in each of the contexts by helping students to understand how communication can contribute to a more humane, just, and sustainable world. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Public Speaking",
      "classCode": "COMM 2",
      "description": "This course is designed to provide students with basic theories and skills that are essential to effective public speaking. Topics include audience analysis, organization, persuasion, credibility, and delivery. Students can apply these skills in a variety of public speaking situations, whether in future communication in college courses or in nonacademic settings. Each student will also learn to analyze, criticize, and evaluate the speaking of others. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Digital Storytelling",
      "classCode": "COMM 3",
      "description": "This course challenges students to become educated consumers and creators of stories in the digital age. Students will learn how to produce and critique a podcast, a short film and a multimedia portfolio. They will learn how to identify the basic elements of narrative design and evaluate four different types of stories: fiction, non-fiction, news, and advocacy. What makes each of these storytelling genres unique? When are they most effective? Why use each one? Throughout the quarter, students will learn how to analyze audiences and assess the best storytelling strategies to connect with them. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Approaches to Communication Research",
      "classCode": "COMM 4",
      "description": "This course introduces students to how communication scholars ask and answer questions about the social world. Three modes of inquiry will be explored, including quantitative, qualitative, and critical, as well as the value and practical implications of examining a problem or topic area from three different modes. The course is guided by this focus: How do we ask research questions to understand the social world and solve problems in the field of communication? Prerequisite: completion of 30 units. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Social Interaction",
      "classCode": "COMM 10",
      "description": "This course will explore how communication functions to affect social interactions. The course will cover theories and concepts related to culture, emotion, gender, identity, language, nonverbal communication, power dynamics, and perception in interpersonal relationships, groups, teams, and organizations. These concepts will be further explored through face-to-face, mediated, and virtual contexts. Students will review contemporary scholarship and reflect on their own everyday interactions. Prerequisites: COMM 1, COMM 2, COMM 3, & COMM 4. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Technology and Communication",
      "classCode": "COMM 12",
      "description": "Examination of the relationship between communication technology and society, in the past, present, and future. Hands-on work with the computer and Internet as tools for research and communication. This course satisfies the University STS core requirement. There are no prerequisites for this course. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Digital Filmmaking",
      "classCode": "COMM 30",
      "description": "Designed to help students learn the art and practice of digital filmmaking. Through a combination of lectures, labs, shooting, and editing exercises, students are introduced to the concepts and processes involved in producing a short documentary and a short fictional film. In addition to attendance in class, all students are required to attend production labs. Concurrent enrollment in lab required. Prerequisites: COMM 1, COMM 2, COMM 3, & COMM 4 for majors, no prerequisite for digital filmmaking minors and all other students. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Media and Technology Studies",
      "classCode": "COMM 50",
      "description": "An intermediate course on media research, theory, and industries, focused on print, film, broadcasting, the Internet, and digital and social media in the U.S. context.  The course deepens students’ understanding of the economics and organization of the media industries; the mutual influence of media technologies and society in everyday life; media policy and regulation; and the ways in which social/cultural factors and positioning influence and constrain the construction, representation, interpretation, and effects of media messages. Students will apply these theories and concepts to analyze contemporary media industries and content, and their own use of media.  Prerequisites: COMM 1, COMM 2, COMM 3, & COMM 4. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Journalism",
      "classCode": "COMM 60",
      "description": "Introduction to the theories and techniques of journalism, with emphasis on the role of journalism in a democracy, news values and ethics, reporting and writing techniques. Discussions and readings on the future of journalism. Includes weekly online lab. Prerequisites: COMM 1, COMM 2, COMM 3, & COMM 4 for majors, no prerequisite for journalism minors and all other students. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Global Media and Culture",
      "classCode": "COMM 80",
      "description": "This intermediate-level course broadly conceptualizes global media as (a) media that is produced in different cultural and geographical contexts, whether Mexican telenovelas, anime, social media platforms birthed in Silicon Valley, or French hip-hop, and (b) media that is global in use, scope, and reach, in the sense of being consumed by a transnational audience, for example, YouTube videos or Bollywood cinema. Predicated on this broad definition, the course will critically examine and engage with the essential aspects of the global media system, specifically: (a) the political economy of the global media system; (b) representations of race, gender, ethnicity, disability, class, and sexual identity in media that is consumed, circulated, and produced in more than one national setting; (c) the influence and role of global media, whether television, the print, or internet, in shaping global culture and, conversely, the role of global culture in shaping the development of global media; and (d) global media as both enabling and complicating transnational connections, community, and solidarity. Prerequisites: COMM 1, COMM 2, COMM 3, & COMM 4. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Quantitative Research Methods",
      "classCode": "COMM 100",
      "description": "Provides students with an overview of communication as a social science and of methods for analyzing communication content, media audiences, and interpersonal communication practices. Topics include the fundamentals of research design, ethics, measurement, sampling, data analysis, and statistics. Students will learn how to evaluate quantitative research studies, synthesize quantitative findings, and utilize existing data to answer questions about communication phenomenon. Through hands-on assignments, students gain experience in concept measurement, research design, and data analysis. Prerequisites: COMM 1, COMM 2, COMM 3, and COMM 4 for majors who declared after June 2022; COMM 1 (prior to Fall 2022) and COMM 2 (prior to Fall 2022) for majors who declared before June 2022 . (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Qualitative Research Methods",
      "classCode": "COMM 101",
      "description": "Provides students with an understanding of qualitative methods used in communication research on messages, contexts, and impacts. Explores qualitative methods such as audience ethnography, participant observation, focus groups, textual analysis, in-depth interviewing, and institutional analysis. Students will engage in exercises on design and application of qualitative methods and analyze the data gathered. COMM 1, COMM 2, COMM 3, and COMM 4 for majors who declared after June 2022; COMM 1 (prior to Fall 2022) and COMM 2 (prior to Fall 2022) for majors who declared before June 2022 . (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in Social Interaction",
      "classCode": "COMM 102",
      "description": "Special topics in social interaction. May be repeated for credit as topics vary. Prerequisite: COMM 1 (prior to Fall 2022) or COMM 10. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in Film Production",
      "classCode": "COMM 103",
      "description": "Special topics in film production. May be repeated for credit as topics vary. Prerequisite: COMM 30. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in Film/TV History",
      "classCode": "COMM 104",
      "description": "Special topics in film and tv history. May be repeated for credit as topics vary. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in Media Studies",
      "classCode": "COMM 105",
      "description": "Special topics in media studies. May be repeated for credit as topics vary. Prerequisite: COMM 2 (prior to Fall 2022) or COMM 50. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in Journalism",
      "classCode": "COMM 106",
      "description": "Special topics in journalism. May be repeated for credit as topics vary. Prerequisite: COMM 40 or COMM 60. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in Communication & Technology",
      "classCode": "COMM 107",
      "description": "Special topics in global communication. May be repeated for credit as topics vary. Prerequisite: COMM 2 (prior to Fall 2022), COMM 12, or COMM 50. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in Global Communication",
      "classCode": "COMM 108",
      "description": "Special topics in global communication. May be repeated for credit as topics vary. Prerequisite: COMM 2 (prior to Fall 2022) or COMM 80. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Science of Happiness",
      "classCode": "COMM 110",
      "description": "When we get what we want, why doesn’t that always make us happy? Our relationships are embedded in the pursuit or loss of happiness. This course is an interdisciplinary review of research and theories that explain our experiences of happiness. Topics include the transient nature of happiness, our brain’s biological happiness system, the effects of tragic or fortunate events, blind spots, counterfactual thinking/future-thinking/presentism, and the communication roles of complaints versus gratitude. We will look at how happiness is affected by winning or by losing, as well as why predicting our future happiness (when we choose mates, careers, and material acquisitions) is often flawed. Students will gain an understanding of what might (or might not) bring them and those they care about sustained happiness as a result of the decisions they make throughout their lives. Prerequisite: for communication majors: COMM 1 (prior to Fall 2022) or COMM 10. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Friendships and Romances",
      "classCode": "COMM 111",
      "description": "This course will examine theories, concepts, and research that explain the relational dynamics in our friendships and romances. Using a communication focus and examining published studies and theories, topics will include the power of friendship and how it shapes our lives, cliques, hurtful friendships, cross-gender platonic friends, dating, romantic relationships, intimacy, loneliness, the bio-neurology of love, rejection, and relational endings (losing, leaving, and letting go). Prerequisite: Any one of the following: COMM 1 (prior to Fall 2022), COMM 10, PSYCH 1, PSYCH 2, or SOCI 1. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Persuasion",
      "classCode": "COMM 112",
      "description": "What is the difference between attempting to change someone’s attitude, belief, or behavior? This course examines theories and research about persuasion, social influence, and compliance gaining, including the dynamics of successfully resisting persuasion attempts. We will focus on interpersonal persuasion in social settings (our roles as friends, daughters/sons, parents, romantic partners, co-workers, teammates, and leaders). The course will cover credibility, social proof, influence in groups, persuasive language, compliance gaining techniques, and how subtle persuasion tactics influence our buying, eating, and health choices. Prerequisite: Any one of the following: COMM 1 (prior to Fall 2022) or COMM 10, PSYC 1, PSYC 2, or SOCI 1. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Communication, the Body, and Health",
      "classCode": "COMM 113",
      "description": "This course examines the ways in which human communication affects, and is affected by, processes that occur in our bodies. Students will start by exploring the basic anatomy of the human body as it relates to communication, including the brain, nervous system, facial musculature, endocrine system, cardiovascular system, and the immune system. From there, students will explore how those body systems are implicated in a range of communicative phenomena, including emotion, conflict, stress, burnout, interpersonal relationships, social structure, organizational culture, relationship satisfaction, and sexual behavior. Finally, students will explore the impact of innovative health treatments that utilize communication interventions, including providing social support, human affection exchange, and organizational development. Prerequisites: for Communication majors: COMM 1 (prior to Fall 2022) or COMM 10; for non-majors: completion of social science core (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Body Politics",
      "classCode": "COMM 114",
      "description": "This course uses feminist theory to explore cultural and individual experiences of embodiment and biotechnology. Students will examine biopolitical discourse and its relationship both to individual lived bodies and to biotechnologies that make possible particular bodily configurations. Topics include scientific and cultural studies of birth control devices, assisted reproductive technologies (e.g., in vitro fertilization), weight loss surgery, adaptive technologies for people with disabilities, and hormonal and surgical treatments for transgender people. Prerequisites: for Communication majors: COMM 1 (prior to Fall 2022) or COMM 10; for non-majors: junior standing. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Communication and Gender",
      "classCode": "COMM 115",
      "description": "Explores gendered patterns of socialization, interaction, and language. Goes beyond essentializing female and male modes of communicating to consider ways in which masculinity, femininity, ethnicity, class, age, sexuality, and disability intersect in interpersonal, family, organizational, and public communication, as well as in feminist and men’s movements. Cross-listed with WGST 161. Prerequisite: COMM 1 (prior to Fall 2022), or COMM 10, or  ANTH 3, or permissionof  instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Gender, Health, and Sexuality",
      "classCode": "COMM 115G",
      "description": "Covers the fundamentals of health communication theory and research with a focus on how health is socially constructed at the intersections of biology, medical technology, and communication. Explores how gender identity, sexual orientation, and sexual identity produce and are produced by cultural gender norms as they manifest in embodiment, sexual expression, and experiences of health and illness. Cross-listed with WGST 140. Prerequisite: Any one of the following: COMM 1 (prior to Fall 2022), COMM 10, PSYC 1, PSYC 2, or SOCI 1. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Gender & Leadership",
      "classCode": "COMM 115J",
      "description": "In this course, students build and strengthen their own leadership skills while critically examining the role of gender in leadership. Students will examine and critique scholarly and popular works on gender and leadership, reflect on how concepts from these works apply to their own lives, and practice communication skills related to leadership.  (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Vocation and Gender: Seeking Meaning in Work and Life",
      "classCode": "COMM 115V",
      "description": "An interdisciplinary examination of vocation, understood as both a meaningful career and life outside of work. Incorporates theoretical and empirical methods of the disciplines of communication and women’s studies to provide a rich set of tools with which to make discerning decisions on personal vocation. This course provides a framework for considering personal life choices within the context of cultural norms and for analysis of how individuals and groups engage in interpersonal, organizational, and mediated communication surrounding work/life issues. Cross-listed with WGST 160. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Intercultural Communication",
      "classCode": "COMM 116",
      "description": "This course introduces key research on communication between various cultural groups in the United States. We will examine intercultural relations affected by historical and contemporary power structures, communicative styles, and intersected identities of race, ethnicity, gender, and class. Some topics include cultural space and power, body politics in verbal and nonverbal communication, and history, privilege, and identity formations. This course requires participation in community-based learning (CBL) experiences off campus. Prerequisite: Any one of the following: COMM 1 (prior to Fall 2022), COMM 10 PSYC 1, PSYC 2, or SOCI 1. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Global Interpersonal Communication",
      "classCode": "COMM 116G",
      "description": "This course offers an opportunity to build, reflect, and improve interpersonal relationships cross-culturally. We will discuss and practice global competency in different national settings. Specifically, the course will analyze the micro-level of interactions within the macro-level of contexts such as collective memories, sociocultural beliefs, political systems and the global geopolitical power relations. You will partner with a non-U.S. based student to put theoretical readings into practice. Students and their foreign partners will collaborate on a final project to present their learning. Study abroad experiences are welcome but not required. Prerequisite: Any one of the following: COMM 1 (prior to Fall 2022), COMM 10 or COMM 80 or permission of instructor (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Multicultural Family and Communication",
      "classCode": "COMM 116M",
      "description": "As society continues to diversify, family dynamics and representations have become increasingly more complex. In 1967, the U.S. Supreme Court established the right of people to marry individuals of a different race, and in 2015 extended the right to marry to same sex couples. The interactions between different social realities and policies continue to be dynamic. As the complexity of family relationships has increased, this class will review research on family communicative challenges and strategies, as well as examine media representations on multicultural families. Interracial relations, transcultural adoptions, intercultural parenting, transgender identity negotiation, and immigrant and mix-status families are just a few examples that will be investigated. Prerequisite: COMM 1 (prior to Fall 2022) or COMM 10 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Intercultural Competency: Training and Dialogue",
      "classCode": "COMM 116T",
      "description": "This course will provide you an opportunity to review theories, research, and practice in the area of intercultural leadership. It focuses on developing skills to facilitate intercultural dialogues on diversity-related issues. Students will learn to identify and research for ways to address cultural differences caused by deeply held worldviews. Students will design and facilitate a workshop to enhance cultural competence in interpersonal, intergroup, or organizational settings. Prerequisite: COMM 1 or COMM 10 or permission of the instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Multicultural Folktales and Storytelling",
      "classCode": "COMM 117",
      "description": "Across time and around the world, people have told stories to teach, entertain, persuade, and carry a culture’s history. This course studies oral literature, including fairy tales, trickster tales, urban legends, ghostlore, hero/heroine journeys, and wisdom stories. Explores the values, gender roles, norms, beliefs, sense of justice, spirituality, and diverse worldviews embedded in every tale. Students will study, critically think about, and perform world folktales—developing a personal creative voice, while learning to appreciate folktales as rich multicultural bridges for understanding other people. Every student will learn tale-telling skills that can be applied to enrich the lives of others, in careers and community. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Communication and Sport",
      "classCode": "COMM 118",
      "description": "Communication is embedded in how we play sports, watch sports, express our fandom, interact with others. Additionally, sport is a lens through which we view different aspects of our cultures and interactions. This course examines sports as a component of our culture, investigating the connection between spectator sports and media; issues of race, gender, and power; and communication’s role in sports participation, including topics such as leadership, motivation, cohesion, and teamwork. Students will gain a better understanding of selected communication principles and discover new ways to talk about sports. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Organizational Communication",
      "classCode": "COMM 119",
      "description": "We live in a highly-organized world, where organizational membership is nearly impossible to avoid. In this course, students will be introduced to the principles and practices of organizational communication. Specifically, the class will explore the role of communication in achieving organizational and individual goals, theory and practice of communication in organizations, constitutive organizational communication, and techniques to enhance communication understanding among individuals in organizations. A variety of organizational contexts will be explored including non-profits, NGOs, corporations, small businesses, governments and municipalities, and social organizations. The class will explore the practical application of contemporary theories to develop skills needed for successful communication in current and future organizations. Topics include the role of organizational culture, gender, leadership, conflict management, remote work, negotiation, work/life balance, human resource management, stress, globalization, sustainability, and the role of social justice in the contemporary organization. Prerequisite: COMM 1 (prior to Fall 2022), or COMM 10. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Group Communication",
      "classCode": "COMM 120",
      "description": "Theories and research about the communication dynamics in a variety of relational groups. Topics include childhood groups, gaining entry to groups, being excluded from groups, group hate, social loafing, leadership styles, facilitating groups, task versus social goals, communication roles of members, effects of gender and diversity, moral values of members, and the resolution of group conflicts. Specific groups will include social peer groups, cliques, gangs, small work groups, super-task groups, problem-solving groups, teams, and decision-making groups (including juries). In addition to theory, practical skills for handling group challenges and member conflict will be offered. Prerequisite: Any one of the following: COMM 1 (prior to Fall 2022), COMM 10, PSYC 1, PSYC 2, or SOCI 1. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Leadership and Communication",
      "classCode": "COMM 121",
      "description": "This advanced course is designed to introduce students to principles of leadership in groups and organizations. The course is designed to explore how communication plays a pivotal role in effective leadership and management. Course topics will include theories of leadership, communication-related leadership variables, how leaders influence others, power dynamics and influence, gender and leadership, the role of leaders in public discourse, ethics and leadership, leadership development, critique of predominant leadership narratives, and how leaders respond to crises. Students will spend time reflecting on their own leadership style as well as the leadership styles of others. Activities will attempt to connect theories of leadership with the way that leaders engage in a communicative act with others to accomplish a common goal. Prerequisite: COMM 1 (prior to Fall 2022), or COMM 10. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Communication Training and Development",
      "classCode": "COMM 122",
      "description": "Blending theory and practice, this course is designed for students interested in learning about communication training as a tool for organizational development. This course will expose students to the preparation, implementation, and evaluation of communication workshops, seminars, and training programs for a wide variety of organizations. In addition to instructional design, the course will focus on methods of teaching communication skills to adult learners and instruction and practice in conducting experiential activities. Further topics will include assessment of learning outcomes; evaluation and critique of training programs; proper use of presentation aids; challenges with training; using e-learning and online training delivery platforms; and the training profession. Students will work in a group to design and present a training module focused on communication skills to an actual client group. This course is especially useful for those students who are considering a career in human resources or organizational development. Prerequisite: COMM 1 (prior to Fall 2022), or COMM 10. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Negotiation, Conflict Management, and Mediation in Organizations",
      "classCode": "COMM 123",
      "description": "This course is designed to help students build skills in managing conflict in various forms, especially those arising from organizational or group-related issues. The course will review theories and approaches to conflict management, negotiation theory, and alternative dispute resolution processes. Specific applied topics include negotiating a job offer, managing conflict between work groups, the influence of gender and culture on conflict and negotiation, whistleblowing, organizational dissent, and the impact of the legal system on conflict management. Class activities and self-reflection exercises will be focused on helping students develop better conflict management skills in a variety of contexts. This class is especially useful for those students wishing to pursue a career in human resources or other managerial positions in organizations. Students with prior job experience or coursework in business (internships, a business minor, organizational psychology, organizational communication, etc.) might find this course to be a nice extension to what they have already learned. Prerequisites: COMM 1 (prior to Fall 2022), or COMM 10. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Health Communication",
      "classCode": "COMM 124",
      "description": "Communication concerning health, fitness, illness, disease, and medicine surrounds us.   The communication you have with friends and family and the information you receive from the  media affects the interaction you have with health care providers and the decisions you make about caring for your physical, mental, and emotional health.  In addition, as health care is organized in increasingly complex ways, communicating between health care professionals and with patients can be ineffective. This course provides an opportunity to explore the multiple communication issues relevant to health including language, information processing, and cultural construction of health and illness. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Time and Communication",
      "classCode": "COMM 125",
      "description": "Our social conceptions of time affect how we live on a daily–and weekly, and monthly, and yearly–basis. In this course, we will explore the relationship between communication and time in our interactions, cultures, and societal structures. We will focus on chronemics–the role of time in nonverbal communication–as well as how we talk about time. We will examine time’s effects on communication in relationships, the role of temporality in the workplace, and the many ways in which time exerts agency on our lives. Students will explore their own conceptions of time in a variety of formats. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Dark Side of Communication",
      "classCode": "COMM 126",
      "description": "Not all communication is healthy and productive and scholars have long been fascinated with what happens when communication “goes wrong.” This class will explore how communication can lead to problems in relationships, families, and organizations. The course will explore ways that dark and destructive communication can have detrimental effects on relationships. Exploration into the dark side will include topics such as jealousy, obsessive relational intrusion (stalking), infidelity, stress, burnout, unrequited love, social pain, exclusion, harassment, incivility, bullying, deception, and deceptive affection. The main goal of the course will be to find ways to move from the dark to the light, as some of these dark side concepts have a bright side -- they help people understand themselves, their relationships, their workplaces, and their families even better. For dark side topics that do not have a bright side (e.g., stalking) the course will focus on how individuals might support others who have experienced these things. The course will also evaluate how these dark side topics have disproportionate effects on members of BIPOC, LGBTQIA+, and other marginalized communities. Prerequisite: COMM 1 (prior to Fall 2022), or COMM 10. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Public Speaking",
      "classCode": "COMM 129",
      "description": "This course, which builds on the foundations that students developed in COMM 20, provides students with a deeper engagement with theories, concepts, and skills essential to excellent public speaking. Students will study key classical and contemporary rhetorical theories in order to become stronger public speakers across a variety of audiences and occasions. Students will also critically analyze and evaluate historical and contemporary speeches. Prerequisite: COMM 20 (prior to Fall 2022) or COMM 2. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Screenwriting",
      "classCode": "COMM 130",
      "description": "This course is designed to introduce you to the wonderful and creative world of global screenwriting and how it has impacted traditional Hollywood storytelling. Students are asked to answer multiple questions: Does a uniform visual style exist? Does just one dramatic paradigm exist? Are all films about protagonists and antagonists? Students complete a script treatment, narrative outline, two drafts of a short screenplay, and analyses of published screenplays. Prerequisites: CTW 1 and 2. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Short Documentary Production",
      "classCode": "COMM 131D",
      "description": "In this course, students are introduced to the basic theories and techniques of the documentary mode of filmmaking and are trained to develop, produce, and edit (in groups) their own short documentaries. Students also explore (through readings, screenings, and discussions) the techniques and styles adopted by documentary filmmakers from all over the world and are encouraged to use them as sources of inspiration as they develop their own documentary styles. Clearances, copyright, budgeting, and other fundamental production issues are also introduced. Students are required to attend a production lab and outside film screenings. Prerequisite: COMM 30. (5 Units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Experimental Cinema & Immersive Media ProductionNew Media",
      "classCode": "COMM 131E",
      "description": "As a medium, film/video is constantly evolving both in form and in content. This course considers the shift from traditional cinema to new frontiers of interactive, performative, and VR/AR, and new media. A fusion between visual art, new technologies, and the moving image will redefine the relationship of the spectator to the film. Environments will be created through the combined use of image, sound, and physical elements, which will immerse the viewer on emotional, intellectual, and physical levels. This course will expand your consciousness as you step into the world by blurring boundaries between mediums and working individually and collaboratively. Preference given to communication majors and minors. Prerequisite: COMM 30. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Short Fiction Production",
      "classCode": "COMM 131F",
      "description": "This course is designed to immerse students in the craft and aesthetics of fiction filmmaking. Students work in groups to develop, produce, and edit their own short films based on selected scripts they either write or acquire from student screenwriters. The course also functions as a forum where students explore the film styles of classical and contemporary filmmakers through readings and screenings so that they are grounded in film language and inspired to develop their own film styles. Students are required to attend a production lab. Prerequisite: COMM 30. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Film Production",
      "classCode": "COMM 132",
      "description": "This course is designed for students to film and edit advanced film projects that have been developed in other courses like Screenwriting (Comm 130) and Producing (Comm 133). Students will learn advanced techniques in directing, cinematography and editing. Students are expected to have a completed screenplay and pre-production packet before the quarter starts so they can begin filming immediately.  . Prerequisite: COMM 30 and COMM 131D or COMM 131F or COMM 134, or COMM 135. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directing the Actor",
      "classCode": "COMM 132D",
      "description": "This class will go deep into key strategies for building meaningful connections with your actors. Topics include script analysis, script interpretation, casting, rehearsals, director-actor relationship and director-actor communication. Projects will focus primarily on actor performance. Guest directors will be invited to share their own unique processes with the class. By the end of the course, you will: improve your understanding of how to build character, learn techniques to sharpen your communication with actors, breakdown your script down to performance beats, develop an approach to rehearsals and directing on set, and learn how to pre-empt problems on set and find solutions. Prerequisite: COMM 30, or permission of the instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Producing",
      "classCode": "COMM 133",
      "description": "This course explores the creative fundamentals of producing film and television shows. Students will learn how to develop ideas into pitches, work with writers to create screenplays, build out shooting plans, schedules and budgets, and gain experience working with directors as they make short films. Prerequisite: COMM 30. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Producing the Web Series",
      "classCode": "COMM 133W",
      "description": "More and more independent creators are using web series to deliver inventive entertainment, and many filmmakers are using the medium to push beyond conventional narrative structures. Does the nascent, democratizing web series format alter our understanding of cinema as an art form? Even as the emergence of the internet has thrown the landscape of film and television into financial and artistic flux, many of the techniques and principles at the heart of cinema permeate visual storytelling online. This course explores the short history of the web series - both fiction and non-fiction - in the context of social, political and cultural shifts in the US over the last decade, examining how those that eventually found commercial success on mainstream television (“High Maintenance”, “Insecure,” “Broad City”) managed to evolve while still maintaining their unique, original voice. Students will analyze the structure, content and style of these works while developing a pitch deck, proposal and \"story world\" for a web series of their own. Prerequisite: COMM 30. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Cinematography",
      "classCode": "COMM 134",
      "description": "The principles and aesthetics of cinematography are examined in great detail. Students learn the fundamental principles of lighting, camera and lens techniques for studio and location settings. Students will be trained in economy lighting, which relies on minimal equipment, the “Hollywood look,” as well as key lighting theories. Prerequisite: COMM 30. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Editing",
      "classCode": "COMM 135",
      "description": "The principles and aesthetics of editing are examined in great detail. Students practice the key techniques and styles of editing, including montage, parallel cutting, and ellipsis, while also studying guiding theories of editing. All students are required to attend a production lab. Prerequisite: COMM 30. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Genre, Auteur, and Narrative Strategies: The Family Melodrama",
      "classCode": "COMM 136F",
      "description": "Are films more “real” than television programs? Which medium is a more powerful social force? Do we value television shows less than feature films? When it comes to famous fictional families, what have feature films and television shows been saying about the American family since 1950? This course investigates the differences and uncovers the similarities of how the American Family has been dramatized on the small screen versus the big screen. What has Hollywood been saying about our family structure and how will it change in the coming years? What political, industrial and social factors influenced how each medium portrayed the family?  How does the unique mode of production of each medium affect the look, feel and tone of how we view the family? And finally, how does each medium affect the other? All students are required to attend outside film/video screenings. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Genre, Auteur, and Narrative Strategies: The American Horror Film",
      "classCode": "COMM 136S",
      "description": "Do you love to be scared watching movies? Do you love psychological thrillers, slasher films, and/or monster stories? The American Horror film has fascinated audiences for decades, but what do they reveal about us as a society? This quarter we will investigate America’s obsession with films like Psycho, The Exorcist, The Texas Chainsaw Massacre, Halloween, Scream, Near Dark, Get Out and The Shape of Water. This class is not for the faint of heart! All students are required to attend outside film/video screenings. (5 Units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "American Film History",
      "classCode": "COMM 137",
      "description": "Explores the development of the American film industry from the perspective of its modes of production, filmic styles, cinema movements, and audiences. This evolution is examined within the context of political, economic, and cultural changes of the past century. May be repeated for credit as topics vary. All students are required to attend outside film/video screenings. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Film and Sustainability",
      "classCode": "COMM 137S",
      "description": "Sustainability & Film is a seminar-style class that will explore how films across different genres address the most pressing sustainability issues of our time.  Students will screen and discuss films from both fiction and non-fiction genres, covering issues ranging from climate change, to environmental justice, to agricultural practices, to biodiversity loss, to animal rights, and beyond.  Students will primarily analyze films through a formal lens, studying the relationship between formal/stylistic strategies and content/theme.  Students will also be introduced to additional critical approaches to film including ecocriticism, feminist studies, race studies, and class studies.  (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Television History",
      "classCode": "COMM 138",
      "description": "This course explores the evolution of the television industry in the U.S. and around the world. The development of television is examined in the context of political, economic, and cultural changes of the past century. The course investigates the changing modes of television production as well as the impact of other media technologies on television content, style, and audiences. May be repeated for credit as topics vary. All students are required to attend outside film/video screenings. Prerequisite: COMM 2 (prior to Fall 2022), or COMM 50, or consent of the instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Documentary History",
      "classCode": "COMM 139",
      "description": "This course traces the evolution of documentary filmmaking from its inception by the Lumiere Brothers in the late 1800s to today’s nonfiction filmmakers who use this mode of representation in a variety of innovative ways, including advocacy, poetry, historical documentation, exploration, reflexivity, and experimentation. The key moments in the history of the nonfiction film, its main theories, along with the various styles of documentary filmmaking, are explored in depth. All students are required to attend outside film/video screenings. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Race, Gender & Film",
      "classCode": "COMM 140",
      "description": "In this course, students will examine films produced by women and people of color, with an emphasis on representation of marginalized communities on screen and minority voices in film theory and criticism. Students will explore what makes a particular film “feminist” or \"ethnic\", and examine how sexuality, gender and race inform filmmaking practice and define the director's \"voice\" in the history of cinema. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Black Cinema",
      "classCode": "COMM 140B",
      "description": "This class explores how popular cinema produces and circulates different versions of the Black experience in the U.S. Students will learn to describe, analyze, and evaluate the intersection between form and content in a select number of important Black  films, by situating them in contexts that are simultaneously national, regional, and global. Films will be treated as cultural constructions. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Latinx Cinema",
      "classCode": "COMM 140C",
      "description": "This class explores how popular cinema produces and circulates different versions of the Latinx experience in the U.S. and abroad. Students will learn to describe, analyze, and evaluate the intersection between form and content in a select number of important Latinx films, by situating them in contexts that are simultaneously national, regional, and global. Films will be treated as cultural constructions. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Women in Cinema",
      "classCode": "COMM 140W",
      "description": "In this course, students will explore the role of women in the cinema as on-screen representations, spectators, and filmmakers. Students will survey some of the most influential writings in the field of feminist film theory. The course will approach the history of women in cinema by asking questions such as, what do roles played by women tell us about American culture? How do these representations change when the directors are women? And, how have women changed the film industry? (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Queer Cinema",
      "classCode": "COMM 140Q",
      "description": "In this course, students will be introduced to LGBTQ film in a wide range of historical and cultural contexts, with the aim of investigating relationships between queer representation across different genres, and at different political moments in history. We’ll trace the evolution of queer cinema from early negative representations of sexual and gender deviance as monstrosity to the emergence of camp and New Queer Cinema to queer representation in the indie and studio landscape today, raising provocative questions about the politics of representation, the use of irony and humor as resistance, and the power and the pitfalls of queer art forms as tools of liberation and social justice. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "AI & The Human in Cinema",
      "classCode": "COMM 141",
      "description": "This upper-division course focuses on science fiction cinema that has  imagined, and anticipated developments in artificial intelligence, with their gamut of accompanying promises and dangers, of possible utopian and dystopian outcomes. The course covers three sets of materials. One, foundational readings in film studies, which will enable us to read and understand the films. Two, key philosophical and theoretical perspectives on the idea of the human and the artificially intelligent.  Three, films on AI and related scholarly materials (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Visual Cultural Communication",
      "classCode": "COMM 142",
      "description": "Students use photography to explore questions about how to represent diverse cultures and identities. Students advance their digital photography skills while reflecting on the ethics of representing others and themselves, informed by readings on cultural theory and visual communication theory. In their final projects, students create and share images from local communities in online exhibits. Prior knowledge of digital photography and creation of online content are helpful, but not required. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Cinema in the Age of Globalization",
      "classCode": "COMM 143",
      "description": "This course explores how national cinemas and individual filmmakers have responded to American global film hegemony. Counter cinema is seen not only as a mode of artistic self-expression, but also as a cultural practice whose role is crucial in shaping national cultures. Of particular interest is the development of film traditions such as neorealism, the French New Wave, Third Cinema, exilic/diasporic cinema, and other film movements that have emerged as an alternative to Hollywood’s commercial cinema. Prerequisite: COMM 2 (prior to Fall 2022), COMM 80 or consent of the instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Diversity and Media",
      "classCode": "COMM 144",
      "description": "The theory and practice of the relationships between cultural diversity, power, intersecting identities, and media production, representation, and use. Examination of how different groups historically have been marginalized in public representation and how these images have been, and are being, challenged. Course requirements include self-reflective work as well as research into individual experiences of public images. Focus on the United States. Cross-listed as ETHN 162. Prerequisite: COMM 2 (prior to Fall 2022), or COMM 50 or permission of the instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Business of Media",
      "classCode": "COMM 145",
      "description": "A critical examination of how media industries work. The class will explore issues such as historic and new financial models, power structures, relationships between media producers and distributors, emerging media markets, audience economics, and the role of government regulation and policy. The course will focus on some of the following industries: Hollywood film and television, journalism, and online media. COMM 2 (prior to Fall 2022), or COMM 50 or permissionof the instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Hybrid Films",
      "classCode": "COMM 146",
      "description": "This course will immerse students in the history and aesthetics of film work that lies on the border between fiction and nonfiction. We live in a film culture that encourages us to think of fiction and documentary as distinct forms. Recent world cinema has given birth to a wave of films that resist those categories, that blur those distinctions, and instead explore the productive liminal zone in between. All fiction films, no matter how staged, contain a trace of reality, an element of chance. The inverse is also true: no nonfiction film is ever completely devoid of manipulation. Students will view and analyze works by contemporary filmmakers working in the hybrid space. Assignments will be a combination of written responses to those works and a written treatment for a hybrid film of your own creation. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Public Relations Theories and Principles",
      "classCode": "COMM 150",
      "description": "This course explores the theories and concepts of public relations and business communication today, including program planning, development, execution, and measurement of media relations, traditional PR tactics, and new online digital channels and tools. Communication theory, business planning, effective presentation, writing, critical thinking, integrated marketing communications, fundamentals of business, and business ethics are emphasized. Prerequisites: COMM 2 (prior to Fall 2022), or COMM 50. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Foundations of Strategic Campaigns",
      "classCode": "COMM 151",
      "description": "Illnesses afflicting the population in the United States continue to shift towards lifestyle-related diseases, such as diabetes, obesity, and heart disease. Public health campaigns can help curtail this shift by promoting knowledge and awareness about preventive behavioral changes. This course provides an overview of public health behavior change campaigns: what they are, how they are used, and how to design one based on sound evidence and theory. To achieve the objectives of this course, students will be exposed to lectures and read articles and chapters on public health, health behavior change theories, and case studies about public health campaigns that address a variety of health behaviors. Using the knowledge gained from these course materials, students will work in groups to design a small-scale public health campaign targeting SCU students that addresses a health issue of their choice. The campaign will be developed through the course of the quarter and groups will be asked to submit smaller assignments along the way to build towards their final product. Cross-listed with PHSC 154. Prerequisites: COMM 2 (prior to Fall 2022) or COMM 50; COMM 100 preferred (COMM 110 prior to Fall 2022). (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Campaign Analysis & Evaluation",
      "classCode": "COMM 151A",
      "description": "When campaigns are developed and deployed, how do we know if they worked? This hands-on course will provide students with practical skills and tools to be able to conduct basic analytics on campaign-related data.  Upon completing the course, students will understand the importance of developing specific objectives for campaigns (awareness vs. knowledge vs. behavior) and how to gather and analyze data to assess whether those objectives have been met.  Students will learn how to write specific, measurable, achievable, realistic, and time-oriented (SMART) objectives and identify appropriate data collection strategies to assess these objectives. Students will also learn how to analyze data through the use of case studies and sample data sets.   Prerequisites: COMM 2 (prior to Fall 2022) or Comm 50, and Comm 100 (COMM 110 prior to Fall 2022). (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Media Advocacy",
      "classCode": "COMM 152",
      "description": "Advocacy represents the series of actions taken and issues highlighted to change the “what is” into a “what should be,” considering that this “what should be” is a more decent and a more just society. Media advocacy is the process of working with and using the media to influence public policies and social behavior through shaping debate about a topic.   In this course, we will explore various media tools which can be used for media advocacy.  Students will engage in a quarter-long media advocacy project in which they will be using the tools we learn about to shape the debate about an assigned topic. Prerequisite: COMM 2 (prior to Fall 2022), COMM 50 or permission of the instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Dialogue and Deliberation",
      "classCode": "COMM 153",
      "description": "How can we address differences and resolve conflicts fairly and effectively? This course introduces students to the role of dialogue and deliberation in creating healthier and more democratic organizations, workplaces, and societies. Students learn a range of research-based approaches to handling difference and conflict, and develop communicative skills used by effective individuals, professionals, and community members in real-world situations. Projects include taking part in formal dialogues and deliberations on current issues, both as participants and moderators, and designing ways for institutions to involve stakeholders and the public in conflict resolution and policy development. Prerequisite: COMM 1 and Comm 20 for COMM majors if prior to Fall 2022, or COMM 1 and 2 for COMM majors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Media Audience Studies",
      "classCode": "COMM 154",
      "description": "The audience plays a critical role in our understanding of mass communication. How do media scholars and practitioners conceptualize and study media audiences? How do individuals and groups use media, interpret media messages, and integrate media experiences into their lives? The course will address these questions, looking at a variety of media and media content (e.g., news and entertainment content of books, film, TV, internet) and do so with different characteristics of audiences in mind. We shall see, for example, how audience responses are shaped by factors such as ethnicity, gender, age, or by the context in which the medium and its message is experienced. Prerequisite: COMM 2 (prior to Fall 2022), COMM 50 or permissionof the instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Media and Youth",
      "classCode": "COMM 154Y",
      "description": "This course considers the youth media culture that has become a pivotal part of the experience of childhood and adolescence. Students examine the content of popular media aimed at young people and the media industries that produce this content. Also explored are patterns of media usage throughout childhood and adolescence, the ways that media are integrated into family life, and how educational and entertainment media content shapes children’s knowledge, attitudes, behaviors, and identities. Topics include educational media effects, media violence, gender and racial/ethnic stereotyping, advertising effects, and media literacy efforts. Prerequisite: COMM 2 (prior to Fall 2022), COMM 50 or permission of the instructor. Cross listed with CHST 154Y. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Media Psychology",
      "classCode": "COMM 155",
      "description": "The class is designed to introduce you to theories in media psychology, while also exposing you to many virtual demonstrations/applications of the theories in media psychology. Media psychology is broadly referring to the psychological experience of engaging in immersive media technologies. It encompasses topics like why we play video games, why are cartoons so appealing, especially to children when there are no human actors involved, why social media is so addictive, why we develop \"relationships\" with our TV characters and celebrities, why we are drawn to certain products and brands, and perhaps most relevant to our current times, how we maintain relationships and friendships virtually. We will discuss the role of artificial intelligence in the intersection of psychology and technology. The class will also have a little nod to philosophy, as many of our emerging tech is contingent on what we perceive as \"reality\". We will discuss ethics of AI and new emerging technologies such as deepfakes, facial recognition, and deep learning. We will sometimes be meeting in game environments in lieu of Zoom, and I'll be showing you demos in VR. Prerequisites: COMM 2 (prior to Fall 2022), or COMM 50. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Media Literacy",
      "classCode": "COMM 156",
      "description": "Information is everywhere. We now live in an information-saturated environment. How do we cope with information overload? In this course, we will explore how taking a social scientific media literacy approach to understanding mediated communication can illuminate how we should best manage and cope with information overload. Several questions will guide the course: What is media literacy? How do historical and economic context affect the way we process information we are exposed to? How can individuals become more media literate to cope and manage information overload? These questions are particularly urgent for us to think about in relation to contemporary digital communication, as they are increasing the amount of information we are exposed to. We explore these questions through various activities in the course, reviewing what media literacy is, what components are needed to become media literate, and how to use a media literacy approach to dissect different types of industry through practical application. Prerequisites: COMM 2 (prior to Fall 2022), or COMM 12, or COMM 50. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Environmental Communication",
      "classCode": "COMM 157",
      "description": "This course introduces students to tools for analyzing and engaging in public discourse about the environment. Students draw on communication theory and research to understand strategies used to analyze and represent environmental issues, such as framing, social construction, and risk communication. Students also gain practical experience in applying research to inform the design of a strategic communication campaign on a real world environmental issue as well as a plan to engage the public in environmental decision making.Prerequisite: for COMM majors: COMM 2 (if prior to Fall 2022) or COMM 50. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Community Organizing",
      "classCode": "COMM 158",
      "description": "Introduces students to the history, theory, and practice of community organizing. Topics include major approaches to organizing; organizing in campaigns and social movements; understanding organizing in different political contexts; major organizing tools, tactics, and strategies; communication and issue framing; research for organizing; and cultural competence and humility in addressing power, identity, and justice. Case studies may include organizing for public health; gender, racial and ethnic justice; economic and environmental justice; youth and education; communication policy; and urban policy. Participation in and reflection on a current organizing campaign is an integral component of the course. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Data & Research Based Reporting",
      "classCode": "COMM 160",
      "description": "This course introduces students to depth reporting, using public records and data. Students will learn to report relevant information intelligently and responsibly using data, and will learn how to access and use public records to complete interesting stories. Throughout the course, students will improve their research skills and will further their technique in advanced storytelling. Prerequisite: COMM 40, or COMM 60, or permission of the instructor. [5 units]",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Journalism",
      "classCode": "COMM 161",
      "description": "Advanced news reporting and writing. Emphasis on strategies for public affairs reporting, beat coverage, media ethics, source development, and immersion journalism. Includes hard news, feature and enterprise reporting projects. Participation in community-based learning placements through Arrupe Partnerships is required. Prerequisite: COMM 40 or COMM 60, or by permission of the instructor. Note: This course requires participation in community-based learning (CBL) experiences off campus. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Health Reporting",
      "classCode": "COMM 161C",
      "description": "This advanced journalism class focuses on reporting on current health issues; critiquing news media coverage of health and medical news, especially in the wake of COVID-19; finding and interpreting reliable data; interviewing knowledgeable experts; and ultimately reporting and writing a magazine-length story on a health-related topic that serves the public interest and is accessible to a targeted audience. Prerequisites: COMM 40, or COMM 60 or permission  of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Multimedia Journalism",
      "classCode": "COMM 162",
      "description": "This course focuses on journalism’s efforts to deliver news that can reach, include, and engage the public across multiple digital platforms. In this fast-paced course, students study online news practices and emerging ideas, evaluating digital tools, sites, and models. Students will plan, report, write, and produce in convergent digital media formats that may include text, audio slideshows, podcasts, long-form audio stories, and their own portfolio website. Emphasis on improving journalism skills. Prerequisite: COMM 40 or COMM 60 or permission of instructor.. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Audio Storytelling",
      "classCode": "COMM 163",
      "description": "In this course, students build on the skills they learned in Introduction to Journalism (COMM 60) to report, write, record, and edit non-fiction audio stories similar to those produced by organizations such as National Public Radio and podcasts such as This American Life and In the Dark. The basics of audio recording and editing are covered, as well as a discussion of the unique role audio storytelling plays in the larger world of journalism. Prerequisite COMM 40 or COMM 60. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Reporting on Justice",
      "classCode": "COMM 164",
      "description": "This course focuses on justice system and legal affairs reporting. Students will learn to gather information and write about current legal topics and courtroom decisions, and how they affect the lives of ordinary citizens. In addition, students will learn how the civil and criminal justice systems work and how to access public records. Prerequisites: COMM 40 or COMM 60 or consent of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Long Form Journalism",
      "classCode": "COMM 165",
      "description": "This course will advance journalistic storytelling through production of a journalism project that builds on the skills and knowledge students have acquired through earlier journalism courses. Student work will bring together a more detailed and unfolding style of journalistic writing with video, audio, digital, data and other skills to tell a new, in-depth story or greatly advance a story that has received past coverage. The course will focus on sharpening story ideas, conducting thorough research and interviews, and creating interesting storytelling.  Students also will learn to incorporate narrative writing techniques such as scene setting to provide a richer experience for their readers. Prerequisites: COMM 40 or COMM 60, and one course from the following list: COMM 160, COMM 161 (COMM 141 prior to Fall 2022), COMM 161C, COMM 162 (COMM 142B prior to Fall 2022), COMM 163 (COMM 144B prior to Fall 2022), COMM 164 (COMM 145B prior to Fall 2022), COMM 165M (COMM 146B prior to Fall 2022), or COMM 168.",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Magazine Journalism",
      "classCode": "COMM 165M",
      "description": "Includes story development, market analysis, long-form journalism, investigative reporting techniques, query efforts and sophisticated writing approaches for magazines. Fulfills Core Advanced Writing requirement. Prerequisite: COMM 40 or COMM 60 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "News and Democracy",
      "classCode": "COMM 166",
      "description": "An examination of American journalism and its relationship to democracy. Strengthens students’ news literacy skills, including identifying influences on journalism, evaluating the quality of news, and constructing a personal news diet. Introduces the dynamics of political communication through the media. Analysis of theories of journalism’s role in the democratic process and reform proposals to improve news, politics, and civic engagement. Prerequisite: COMM 40 or 60 for COMM majors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Communication Law",
      "classCode": "COMM 167",
      "description": "An introduction to communication law and regulation. Emphasis on first amendment rights to freedom of speech and information gathering, as well as the law of defamation, privacy, copyright, obscenity, harms to the public, and telecommunications regulation. Students gain experience in applying the law by preparing and delivering legal arguments in a moot court exercise. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Community Journalism",
      "classCode": "COMM 168",
      "description": "This course focuses on journalistic coverage of the complex issues within a community. Students will learn how to report intelligently and responsibly about concerns of interest to readers in a local community.  Students will gain journalistic experience by using solid news judgment to find and follow stories from a “beat” area they are responsible for covering, by developing and maintaining credible sources in their reporting, and by crafting stories of interest to the audience. Through the process of planning, production and editing, students will further hone their information gathering, writing and digital skills. Prerequisite: COMM 40 or COMM 60 or permission of instructor. [5 units]",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Communication Ethics",
      "classCode": "COMM 169",
      "description": "As a journalist, how do you decide when you can, or can not, use an anonymous source?  As a public relations professional, what do you do when a client asks you to do something you know is wrong?  As a filmmaker, is it OK to bend the truth in the story you are telling?  When using social media, do you act differently if you think no one knows your real identity? These and more questions are what we will address in the communication ethics course.  The course is designed to give you applied, hands-on skills to make ethical decisions about situations you do face, and will face, in life and your career. (5 Units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "VR Design",
      "classCode": "COMM 170",
      "description": "Obtain first-hand experience working with VR technology, include how to use softwares like Unity and C# in Visual Studio. Integrate VR and 3D modeling with Digital Humanities projects: Work on implementing one of the designs created by the Ohlone Indian Tribe, Muwekma Ohlone Tribe, and SCU collaboratively. Through this experience, understand how Virtual Reality can aid in History and Art History education. Learn about 360 VR and apply it to use in film and journalism. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Tech & Inequality in Silicon Valley",
      "classCode": "COMM 171",
      "description": "As one of the richest economies and a model of technologically enabled growth in the world, Silicon Valley is marked by deep inequalities. In the last thirty years, income inequality has grown faster in the SF Bay Area than in the state or nation as a whole. In this course, we will examine the darker side of Silicon Valley through examining its history of immigration, the role of women in the tech industry, racialized algorithmic bias, the gig economy, housing justice, and networked struggles for equity in the Valley among other topics. Class materials, in addition to readings, include films, podcasts and popular shows on the Silicon Valley. Prerequisites COMM 2 (prior to Fall 2022) or COMM 80. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Media Ecology",
      "classCode": "COMM 172",
      "description": "Media ecology, the study of media environments, explores how communication media broadly defined (ranging from speaking and writing to mass media to physical and social environments) affects human perception, understanding, feeling, and values. Students will explore both media environments and methods of analyzing them through case studies and projects. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Big Data Analytics",
      "classCode": "COMM 173",
      "description": "Learn big data analytic tools, such as social media scraping, marketing SEO analytics, accessing API, analyzing large amounts of data, and receive an introduction to machine learning using Python and R. Also will involve a significant amount of qualitative methods as formative research to properly train machine learning algorithms. By the end of class, should be able to analyze a large scale dataset and make testable predictions and conclusions. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Digital Feminisms",
      "classCode": "COMM 174",
      "description": "#MeToo. #SayHerName. #TambourineArmy. These hashtags indicate how today's activists and scholars have responded to the proliferation of information and communication technologies with digital practices that bring feminist principles into cyberspace. This course explores how users of digital technology facilitate feminist activism, theory, and practice that cuts across social and material divisions. By uncovering how society and technology function together to reproduce and deepen existing intersectional inequalities, this course takes up questions of social identity and inequality to understand how the convergence of technology and feminism complicates and unsettles norms around gender, sexuality, femininity, and masculinity. Prerequisite: for majors, COMM 1 and COMM 2 (both prior to Fall 2022), or COMM 10. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Theology and Communication",
      "classCode": "COMM 175",
      "description": "Do the practices of communication have any consequences for theology? Christian theology has taken communicative expression seriously throughout the centuries. From a media ecology perspective, this course examines how theology has used communication, how it has evaluated communication, how communication contributes to theology, and how new communication technologies have a contemporary impact on theological and religious practices. Examines a variety of communication expressions (art, music, poetry, television programs, films, websites) as religious expressions; students will create their own theological expression using some contemporary medium. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Dating in the Digital Age",
      "classCode": "COMM 176",
      "description": "This class explores how algorithms and interfaces complicate finding a date and having a relationship in today's world. Because this course evaluates how the social and technological context of communication shapes how people date in the digital world, it also looks at how social identity and societal inequality affect norms about marriage, family, and intimacy. We will investigate (a) the broader economic, political, and cultural forces that shape dating in the digital age, and (b) the ways digital and social media content about relationships and intimacy reflect the complex power dynamics and social structures of different societies around the world. Finally, we will look at how people from different backgrounds make sense of dating and intimacy in a network society. Prerequisite: for majors, COMM 1 and COMM 2 (both prior to Fall 2022), or COMM 10. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Violence and Communication",
      "classCode": "COMM 180",
      "description": "This course looks at the relationship between violence and communication from three angles: (1) violence as communication, (2) violence as a failure of communication, and (3) problems with representing violence. The course involves a range of philosophical and disciplinary perspectives on violence and communication, including media and communication, social theory, and visual culture. The course has a strong global and international focus. The contexts covered include the Holocaust, the partition of India, and 9/11. Prerequisite: COMM 2 (prior to Fall 2022) or COMM 80. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Global Popular Culture",
      "classCode": "COMM 181",
      "description": "This course examines global popular culture in its many forms, whether Hollywood cinema, memes on social media, music that reaches millions via streaming services, or television shows that are loved in countless countries. The course defines global popular culture in broad terms as content or communication that is shared widely across borders, consumed worldwide, or designed for a global audience. The course will address the role of communication technologies such as cinema or the internet in fashioning global popular culture. It will also focus on prominent themes in global popular culture, particularly as these relate to ethnic, cultural, or national identity, gender and sexuality, disability, and other forms of individual or collective expression. Prerequisites: COMM 2(prior to Fall 2022)OR COMM 80 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Asian Popular Culture: Global Influence and Political Communication",
      "classCode": "COMM 181A",
      "description": "What do BTS, Naomi Osaka and milk tea have in common? All have instigated actions for a more just world because of their fans. In this course, we will critically analyze Asian popular culture since the 1980s, using a cultural ethnographic approach. Students will apply lenses of gender, identity, globalization, and communication strategies to examine pop phenomena such as Korean Wave, Cool Japan, Taiwanese and Cantonese popular music, and anime. Students will engage in online videos critique, reflections and presentations on Asian pop culture’s global influences for justice. Prerequisites: COMM 2 (prior to Fall 2022) OR COMM 80, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Disability in Global Popular Culture",
      "classCode": "COMM 181D",
      "description": "This upper-division seminar centers on the treatment of disability across a range of global cultural and media forms, including cinema, comics, art, music, and online communities of and for the disabled. The course views disability through the following theoretical perspectives: as a medical condition that marks it as deviant from the normal; as a socially constructed category of difference, like race or sexual orientation; and as a legal and social category of identity, according to which being disabled is akin to possessing an ethnicity. We will critically examine how characters in global media culture both reflect and challenge the perspectives on disability identified above. We will unpack how ideas of disability as a type of difference intersect with perceptions of racial, ethnic, gender, national, and sexual difference, whether the intellectual inferiority of colonized peoples, and the newly resurgent scientific emphasis on innate biological differences between men and women. Course materials include readings from social theory, media and cultural studies, and historical studies of disability. Additionally, we will read, listen to, view, and analyze a number of media and cultural texts, including film,episodes of animated television series, iconic works of art, musical compositions, and public online forums of communities of self-identified disabled groups. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Global Music: Profits, Poetry, and Politics",
      "classCode": "COMM 181M",
      "description": "Global music as a broad category encompasses music produced in different parts of the world that circulates globally and music that is a product of influences from multiple cultures. This upper-division seminar course will engage with the past and present of global music, thus defined, from three angles. First, it will examine the economics of the global music industry, specifically how the principle of maximizing profitability influences the image of musical artists, music content, and cultural taste. Second, the course will analyze the aesthetic appeal of music from different traditions, in terms of the impact of lyrics, melodies, and other elements of songs and compositions. And, third, it will consider how global music reflects and, in turn, shapes politics and power relations, whether in everyday life or in movements for social change and political protests. The course will look at how musical genres from particular areas of the world have traveled and taken on new forms in other parts of the globe, for example, how African rhythms have shaped jazz and rock or how American protest songs of the 60s have been deployed as powerful statements against authoritarianism continents away. We will pay special attention to the impact of internet-related developments on global music, such as the disruption to the industry caused by streaming technologies and platforms like Spotify, new forums now available to musicians, such as YouTube, and direct access to global audiences without traditional channels of distribution. The global musical traditions covered include jazz, Afro-Cuban and Latin music, rock, hip-hop, fusion, Indian film songs, Flamenco, Rai, disco, EDM, and global percussion traditions. No technical knowledge or background in music theory is required for the course. Requirements: COMM 2 (prior to Fall 2022) or COMM 80, or permission of the instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Communication, Development, and Social Change",
      "classCode": "COMM 183",
      "description": "How does communication content and technology solve problems of global poverty and social change? This course addresses the theories, policies, and practices that help explain the success or failure of new communication technologies in “helping the disenfranchised” achieve a better life for themselves both in the global South and North. We will examine the relationship between media technologies and social change/development initiatives with a focus on liberal, participatory and critical approaches. We will always ground theoretical perspectives in specific examples of development communication projects and strategies. Prerequisite: COMM 2 (prior to Fall 2022) or COMM 80. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Global Media and Postcolonial Identity",
      "classCode": "COMM 184",
      "description": "Paying careful attention to the meaning of the term “postcolonial” in different historical and geographical contexts, this course undertakes a critical analysis of media representations of national and cultural identity in postcolonial societies in Africa, Latin America, and Asia. Evaluates the ways in which media constructions of national identity intersect with understandings of gender, race, religion, and ethnicity. A key focus area of the course is the experience of diasporic postcolonial communities as represented in media. Prerequisite: COMM 2 (prior to Fall 2022) or COMM 80. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Identity, Privacy, and Politics in the Digital Age",
      "classCode": "COMM 185",
      "description": "This course examines the dynamics of communication in new media networks and forums, covering the overlapping categories of social networks, social media, blogs, microblogs, portals, and collective knowledge initiatives such as Wikipedia. We will analyze communication practices in new media with a focus on the following four areas: (1) convergence and links between forms of media and technology, such as mobile phones, computers, and books; (2) changing conceptions of self and community; (3) emerging of paradigms of creative collaboration and artistic and intellectual production; and (4) posed challenges about privacy, copyright, and intellectual ownership. We will examine these areas from a global perspective, keeping in mind both the global nature of new media networks and communities, and the particular trajectories of new media communicative practices in different global contexts. In this regard, we will also address the social, ethical, and political consequences of the “digital divide” between those who are networked and connected in this world and those who lack access to it. Prerequisite: COMM 2 (prior to Fall 2022) or COMM 80. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Media and Social Movements",
      "classCode": "COMM 187",
      "description": "This course explores social movements and media as sites of democratic participation. We will identify historical and political-economic conditions that shape social movements. Our emphasis is on how social movement organizations and activist alliances negotiate their relationships with global and local institutions, including multilateral organizations, transnational corporations, and states. The course also examines the mobilization of social claims for global justice, and the extent to which media and information technologies have been instrumental in the articulation of such claims. Prerequisite: COMM 2 (prior to Fall 2022) or COMM 80. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Food and Communication",
      "classCode": "COMM 188",
      "description": "This upper-division seminar explores the rich, multifaceted, and fascinating relationship between food and communication from the following complementary perspectives. One, we will analyze food as a form of communication, reflecting on what food tells us about society, culture, and identity. What kinds of tensions—for example, between individual choice and collective obligations, national identity and cosmopolitan aspirations, tradition and modernity—are associated with food-related practices? How do we respond to the competing ethical claims of vegetarianism and meat-eating? Two, we will examine communication about food, closely reading representations of food in different forms of media, including art, cinema, television shows, and graphic novels. And, finally, we will look at food as the site and space of cultural encounters, as a marker of both similarity in difference. Course readings and materials are drawn from a number of disciplinary backgrounds, including cultural studies, sociology, media studies, and food studies, and from a range of media genres. Within this broad framework, students will develop an original thesis related to food and communication and produce a high-quality research paper by the end of the seminar. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Communication, Identity, and Citizenship in Asia",
      "classCode": "COMM 189",
      "description": "Citizenship is about belonging. With abundant transnational cultural influences, multinational treaties, and cross-border marriages, the belonging process is complicated. In this course, we will discuss how historically marginalized groups such as immigrants, LGBTQ+, women, and indigenous groups experience belonging, specifically in Asia. We will examine their struggles with citizenship in the larger context of east-west interactions. Finally, we will relate these experiences to those in the United States. Students will learn how the thinking and making of citizens has changed, and are encouraged to imagine how it can continue to change in the future. This course fulfills the Core requirement for C&I 3 and the Asian Studies minor. Prerequisite: COMM 2 (prior to Fall 2022) or COMM 80 or ETHN 5 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Journalism Practicum",
      "classCode": "COMM 190",
      "description": "For writers and editors of The Santa Clara. Students review the student newspaper, offer practical advice, and gain experience in journalism. The Santa Clara staff members assist in teaching students skills in news, sports, feature writing and reporting, and techniques of design and production. Class members meet once a week and are expected to spend at least three hours a week in newspaper work. (1–2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Independent Filmmaking Practicum",
      "classCode": "COMM 191",
      "description": "This course helps emerging filmmakers, artists, and designers in all disciplines; entrepreneurs; students focusing on marketing, public relations, and journalism; and film lovers to advance their skills in the art and business of filmmaking and media. Students produce real-world short projects: fiction, commercial, and documentary. The practicum is designed to give students hands-on experience in producing, directing, cinematography, production design, editing, sound, music, acting, and screenwriting. Students will also help organize the Genesis student film festival. Prerequisite: COMM 30 or consent of the instructor. (1–2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Online Journalism Practicum",
      "classCode": "COMM 192",
      "description": "Designed to get students involved with journalism via digital media. Students report, write, edit, broadcast, and promote news, arts, and entertainment content. Work may air on KSCU, in The Santa Clara student newspaper, websites, or the practicum blog. Students will also learn the basics of digital recording and receive a basic introduction to studio production and new media. (1–2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Yearbook Practicum",
      "classCode": "COMM 193",
      "description": "For editors and principal staff members of the University’s yearbook, The Redwood. Principles of photojournalism, magazine graphic design, and book production. The Redwood staff members assist in teaching skills in reporting, writing, production, and design. Class members meet once a week and are expected to spend at least three hours a week in yearbook work. (1–2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Forensics Practicum",
      "classCode": "COMM 194",
      "description": "Supervised activity in forensics. Includes competition in debate and various speaking events: persuasive, expository, extemporaneous, impromptu speaking, and oral interpretation. Field trips required. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Peer Educator",
      "classCode": "COMM 194P",
      "description": "This course is offered for students who assist in teaching courses in the department for academic credit rather than pay. (1–2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Senior Portfolio",
      "classCode": "COMM 197",
      "description": "A 2-unit course that communication majors complete during their final year. Students will create an online portfolio and write a reflection paper describing how their coursework has shaped who they are and their vocation choices. Prerequisites: All lower-division required  courses, COMM 100, COMM 101, and three of six upper division Communication electives.. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Internship",
      "classCode": "COMM 198",
      "description": "A forum where students can learn how they can best apply classroom instruction to their career objectives through academically supported work experience. Internships at Santa Clara University are closely monitored for appropriateness and practical application. Internships should encourage career skills and professional growth; they should not be just another job. Internships are an important and integral part of the communication craft and serve to introduce the student to the range of opportunities afforded a degree in the discipline. Students are expected to represent the University in a professional manner and to act responsibly with the client and the assignments. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Research/Creative Project",
      "classCode": "COMM 199",
      "description": "Students arrange to work with a faculty member for directed reading or a research project in communication theory, research, ethics, etc. Creative projects may also be arranged in television, print, or another applied area. The Department also uses this number for communication electives taken in study abroad programs. Prerequisites: Written proposal, course meeting schedule, and readings must be approved by instructor and chair prior to registration. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    }
  ]