[
    {
      "courseName": "Mathematical Finance",
      "classCode": "FNCE 116",
      "description": "This course is comprised of an immersion into the mathematics and models of modern finance, with an emphasis on conceptual and mathematical understanding, as well as building and implementing models. It is technology dependent since computers are essential to solving problems in this field. Introduction to Ito calculus and stochastic differential equations; discrete lattice models; models for the movement of stock and bond prices using Brownian motion and Poisson processes; pricing models for equity and bond options via Black-Scholes and its variants; optimal portfolio allocation. Solution techniques include Monte Carlo and finite difference methods. Prerequisites: MATH 122 or AMTH 108. MATH 53 or permission of the instructor (based on familiarity with matrix multiplication, inverses, and determinants through another course, some calculus-based probability, and multivariate calculus (e.g., MATH 14). (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Real Estate Principles",
      "classCode": "FNCE 118",
      "description": "A foundational course that provides students with a general overview of real estate and practical applications of the material. The course covers a broad range of topics including the historical and legal basis of regulations and customs that govern real estate today, real estate service industries, real estate market analysis, the principles in real estate transactions, and the unique characteristics of real estate as an investment asset class. The course will lay a solid foundation for students to pursue specific areas in greater depth through more focused courses in the future. This course does not satisfy an upper-division elective for finance majors and is not included when calculating the finance major GPA. Prerequisites: Sophomore standing or higher or ACTG 11 or ACTG 11A. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Financial Management",
      "classCode": "FNCE 121",
      "description": "Introduction to the basic concepts of financial risk and return, the valuation of uncertain future cash flows, working capital and fixed asset management, and cost of capital. Topics include time value of money, financial analysis and forecasting, valuing corporate securities (stocks and bonds), capital budgeting, short- and long-term financing, and cash management. Prerequisites: OMIS 40, ACTG 11 and proficiency with spreadsheets. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Financial Management",
      "classCode": "FNCE 121S",
      "description": "Introduction to the basic concepts of financial risk and return, the valuation of uncertain future cash flows, working capital and fixed asset management, and cost of capital. Topics include time value of money, financial analysis and forecasting, valuing corporate securities (stocks and bonds), capital budgeting, short- and long-term financing, and cash management. Prerequisites: Restricted to students in the Leavey Scholars Program. OMIS 40, ACTG 11, and proficiency with spreadsheets. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Investments",
      "classCode": "FNCE 124",
      "description": "Introduction to the nature and functions of securities markets and financial instruments. The formulation of investment goals and policies, trading strategies, and portfolio management. Coverage of security analysis and valuation, evaluating portfolio performance, diversification, alternative investments. Prerequisite: FNCE 121 or 121S. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Corporate Financial Policy",
      "classCode": "FNCE 125",
      "description": "In-depth examination of the interrelationships between corporate investment and financing decisions and their impact on a firm’s pattern of cash flows, return, and risk. Special emphasis on the development of analytical techniques and skills for analyzing performance reflected in financial statements. Case studies are used. Prerequisites: FNCE 121 or 121S, and FNCE 124. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Money and Capital Markets",
      "classCode": "FNCE 126",
      "description": "Examines the role and function of financial institutions, financial flows, and interest rate structures in the money and capital markets. Viewed primarily from the perspective of a corporate issuer, it explores the mechanisms by which value is created by financial markets, the roles of players in the system, the securities in each market, the flows of information, and the design and incentive features that manage risk in a practical manner. Common themes and concepts will be developed by the exploration of a new market in each class, examining a corporate issuer’s funding alternatives, and incorporating current news events. Prerequisites: FNCE 121 or 121S, and FNCE 124. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Real Estate Transactions",
      "classCode": "FNCE 127",
      "description": "This course uses real-life investments as a comprehensive means of exploring all phases of the real estate investment life cycle, from identifying potential transactions, examining various valuation methods, conducting due diligence, determining financing alternatives, implementing property management strategies, and analyzing disposition timing. Students will explore various types of real estate investments: multi-family, office, hotel, and ground-up development.This course does not satisfy an upper-division elective for finance majors and is not included when calculating the finance major GPA. Prerequisite: FNCE 118. (5 unit)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Real Estate Finance",
      "classCode": "FNCE 128",
      "description": "Exploration of the real estate market, including investments in residential and commercial real estate by individuals, partnerships, and trusts. Emphasis is on the valuation and cash flow analysis of these projects and an understanding of financing alternatives. Prerequisites: FNCE 121 or 121S. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Real Estate Development",
      "classCode": "FNCE 129",
      "description": "Examines the complex and interdisciplinary process of real estate development, including conceptual planning, feasibility studies, financing, legal documentation, and project management. Explores ways that developers mitigate risks throughout the development process. Describes different types of commercial real estate products and the roles of key players in today’s real estate profession. Students will also gain exposure to the ethical issues frequently encountered in real estate development. This course does not satisfy an upper-division elective for finance majors and is not included when calculating the finance major GPA. Prerequisites: FNCE 118. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ethics and Finance",
      "classCode": "FNCE 130",
      "description": "Exploration of the ethical dimension of financial markets. Each week focuses on a different job function (investment manager, research analyst, trader, fund manager, corporate controller, bank officer, etc.) and explores the intersection between legal responsibility and ethical action. Topics include fiduciary responsibility, insider trading, moral hazard, agency, predatory lending, and financial market regulations concerning disclosure, price manipulation, suitability, etc. Current news items and regulatory activity will be incorporated in weekly discussions. Prerequisites: FNCE 121 or 121S, and FNCE 124. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Real Estate Law",
      "classCode": "FNCE 131",
      "description": "This class covers the principles of real estate law. Students will explore the legal aspects of real estate and general contract law in California. Emphasis is placed on the transaction process: negotiating real estate contracts (i.e. leases, purchase and sale agreements); identifying and handling legal disputes; and contract breaches. This course does not satisfy an upper-division elective for finance majors and is not included when calculating the finance major GPA. Prerequisites: FNCE 118. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Financial Derivatives",
      "classCode": "FNCE 132",
      "description": "Provides an introduction to financial derivative securities, the markets in which they trade, their applications, and valuation frameworks. Securities such as equity calls/puts, forwards/futures, structured products, and fixed income derivatives will be covered. An underlying theme of the course will be valuation using dynamic replication. Applications will cover the use of derivatives in global corporate settings as well as in financial institutions and services. Prerequisites: FNCE 121 or 121S, and FNCE 124. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Fixed Income Securities",
      "classCode": "FNCE 134",
      "description": "Provides an introduction to fixed income by covering the valuation and application of a range of fixed-income securities and credit derivatives. The main objective is to provide a foundation in the basic concepts and mathematics of these securities and their applications, holistically as it pertains to a means to (1) formulate investment strategies, (2) immunize investment portfolios, and (3) hedge attendant risks. Students will be able to describe basic features, pricing, and mathematics (duration and convexity) of fixed-income securities, model risk and return in fixed-income securities, describe basic similarities and differences in the deaures and bond mathematics for plain-vanilla versus more complex fixed-income securities, and describe and price basic credit derivatives and structured credit products. Prerequisites: FNCE 121 or 121S, and FNCE 124. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Applied Portfolio Management",
      "classCode": "FNCE 135",
      "description": "Designed to provide a highly rigorous and analytic framework for applied work in investments and portfolio management. Students who master the course material will acquire the analytical tools and financial theory necessary to make rational investment decisions and understand the paradigms by which investment portfolios are managed. The coursework involves an analysis of contemporary theories and techniques in portfolio management available to professional portfolio managers. Significant literature that emphasizes the role of the modern portfolio manager in achieving diversification and client investment goals is reviewed and evaluated. Prerequisites: FNCE 121 or 121S, FNCE 124, and OMIS 41. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "New Venture Finance",
      "classCode": "FNCE 141",
      "description": "Describes the financing environment for young companies and studies how the private equity market functions. Students will learn how investment funds are structured, investment contracts are written, and understand the economics of different private equity models work. Prerequisites: FNCE 121 or 121S, and FNCE 124. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Entrepreneurial Finance",
      "classCode": "FNCE 143",
      "description": "Covers topics that are directly relevant to entrepreneurs, defined broadly to include all early employees in addition to founders, who are evaluating, communicating, and implementing new business opportunities. This course focuses on the start-up phase with an emphasis on venture-backed companies. The three main sections of the course are: Types of Businesses (primarily lecture and project-based), Financial Models (primarily project-based), and Investment Terms (primarily lecture-based). Types of Businesses covers the three types of entrepreneurs: lifestyle entrepreneurs, wealth-building entrepreneurs, and innovating entrepreneurs, along economic foundations that distinguish the three types of entrepreneurship. Financial Models covers the creation and uses of financial projection: revenue, costs, and profits/losses. Investment Terms covers the way investments in startup companies are generally structured. In all three sections, we will discuss the human biases that often distort entrepreneurial efforts, along with strategies to recognize and avoid the more costly. Prerequisites: FNCE 121 or 121S. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Risk Management",
      "classCode": "FNCE 146",
      "description": "Introduction to financial risk management through its major components: credit, market, operational, legal, and reputational. Also addresses technology tools to manage risk and the role data governance and environmental policy play in risk management. Students who master the material will acquire an understanding of the major areas of risk exposure that all organizations, both public and private, face in operating in today’s complex global marketplace. Prerequisites: FNCE 121 or 121S, and FNCE 124. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Financial Institutions and Services",
      "classCode": "FNCE 149",
      "description": "Analyzes the management of financial institutions and the role of financial services and institutions in the financing/restructuring of industry and government, and facilitating saving and investment. Topics such as asset/liability management, regulatory constraints, liquidity and credit risk considerations, financing and securitization, and off-balance sheet activities are discussed. Macro issues such as financial system stability, information flows, and regulatory capital are also covered. Ethical issues faced by financial industry professionals are considered. Prerequisites: FNCE 121 or 121S, and FNCE 124. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "International Finance",
      "classCode": "FNCE 151",
      "description": "Examination of the functioning of the international monetary system, foreign exchange markets, and the financial problems of business firms operating internationally. Topics covered include hedging exchange rates and interest rates, international investment and financing, financial markets, banking, and financial management. Prerequisites: FNCE 121 or 121S, and FNCE 124. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Business Valuation",
      "classCode": "FNCE 170",
      "description": "Practical valuation tools for valuing a company and its securities. Valuation techniques covered include discounted cash-flow analysis, estimated cost of capital (cost of equity, cost of debt, and weighted average cost of capital), market multiples, free-cash flow, and pro-forma models. Prerequisites: FNCE 121 or 121S, and FNCE 124. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Mergers and Acquisitions",
      "classCode": "FNCE 174",
      "description": "A study of corporate governance and corporate restructurings. Emphasis on how corporate ownership, control, and organizational structures affect firm value. Other topics may include valuing merger candidates, agency theory, and takeover regulation. This course generally places a heavy emphasis on case projects and/or class presentations. Prerequisites: FNCE 121 or 121S, and FNCE 124. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Financial Planning & Analysis",
      "classCode": "FNCE 180",
      "description": "FP&A’s primary role is to bridge a company’s current operating results to its long-term strategic plan. This class provides a comprehensive overview of financial operations and reporting. In doing so, it covers the analyses and processes involved in budgeting, forecasting, and performance management. Students also learn techniques involved in financial communication and benchmarking by developing graphs, dashboards, and other visual aids to illustrate complex concepts. Prerequisites: FNCE 121 or 121S, FNCE 124, and FNCE 125.(5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Applying Financial Models to Financial Data",
      "classCode": "FNCE 186",
      "description": "This course introduces students to various financial databases, accessing data from these databases, and analyzing data using quantitative techniques. Students will explore Bloomberg, Compustat, CRSP, Mergent/Investext, EDGAR, and other online sources such as Yahoo Finance. Downloaded data will be managed in Excel and analyzed using a variety of features that Excel offers, especially its Data Analysis Toolpak, as well as other analytical software. Course assignments focus on current financial events, as students access and analyze data to answer questions related to these events. Prerequisites: FNCE 121 or 121S, and FNCE 124. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Peer Educators in Finance",
      "classCode": "FNCE 191",
      "description": "Peer educators in Finance work closely with a faculty member to help students in a course understand course material, think more deeply about course material, benefit from collaborative learning, feel less anxious about testing situations, and/or to help students enjoy learning. Enrollment is by permission of the instructor. (1 or 2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Investment Banking Fundamentals",
      "classCode": "FNCE 197",
      "description": "In this course, students are introduced to the basic “technical” knowledge needed to apply for a job in investment banking. The material covered focuses heavily on company analysis and valuation methods, such as financial statements analysis, comparable companies’ analysis, benchmarking and relative valuation, financial forecasting and modeling, discounted cash flow valuation, and sensitivity and scenario analysis. All topics will be studied in the context of a HBS case study or a real-world valuation task. If time permits, more advanced topics such as LBO modeling and M&A deal structures will be touched upon, as well. Course participants are expected to simultaneously be active members in the SCU Investment Banking Club, which will be running related workshops in parallel and subsequent to the course. Students must apply directly to the instructor to receive permission to enroll in the course; there are no formal course prerequisites. Preference is given to sophomores that aim to apply for investment banking internships in the following spring. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Internship",
      "classCode": "FNCE 198",
      "description": "Opportunity for selected upper-division students to work in companies and nonprofit organizations. Prerequisites: Finance major, junior or senior standing, successful completion of FNCE 121 or FNCE 121S, and permission of instructor required one week prior to registration. It is a 5-unit course that counts as an elective toward a finance major. In special circumstances, students may qualify for a 1-unit version of this course, such as in cases where a student may require an official SCU link for work authorization (Please note, that this course will not count toward major requirement unless it's taken as a full 5-unit course). (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Reading/Directed Research",
      "classCode": "FNCE 199",
      "description": "Independent projects undertaken by upper-division students with a faculty sponsor. Independent studies are normally permitted only under special circumstances. Prerequisites: Declared finance major, junior or senior standing and a written proposal must be approved by instructor and chair one week prior to registration. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    }
  ]