[
    {
      "courseName": "11A. and 12A. Cultures & Ideas I and II",
      "classCode": "HIST 11A",
      "description": "A two-course sequence focusing on a major theme in human experience and culture over a significant period of time. Courses emphasize either broad global interconnections or the construction of Western culture in its global context. Courses may address such topics as civilization and the city; explorations, migrations, and nations; and empires and rights. Successful completion of C&I I (HIST 11A) is a prerequisite for C&I II (HIST 12A). (4 units each quarter)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "11A. and 12A. Cultures & Ideas I and II",
      "classCode": "HIST 12A",
      "description": "A two-course sequence focusing on a major theme in human experience and culture over a significant period of time. Courses emphasize either broad global interconnections or the construction of Western culture in its global context. Courses may address such topics as civilization and the city; explorations, migrations, and nations; and empires and rights. Successful completion of C&I I (HIST 11A) is a prerequisite for C&I II (HIST 12A). (4 units each quarter)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Historical Interpretation",
      "classCode": "HIST 100",
      "description": "An investigation of the diverse methods historians use to examine the past. Required of all majors. For history majors or with permission of the instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Historical Writing",
      "classCode": "HIST 101S",
      "description": "Researching and writing history papers. Required of all majors. For history majors and minors; majors will be given priority. Recommended to be taken in the sophomore or junior year. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Human Rights and Humanitarianism",
      "classCode": "HIST 21",
      "description": "From reading current news articles, one might surmise that the dignity of human beings and their inherent right of freedom from undue suffering are self-evident, universally acknowledged goods that we should all pursue regardless of culture, place, or time. In fact, however, contemporary ideas about human rights, as well as humanitarian efforts, (often pursued in far distant locales) have a particular history, one rooted in Western Enlightenment-era ideals of individual liberty and the brutal experiences of European imperialism. In this class, we will examine the histories and ideologies of human rights and humanitarianism; consider their underlying assumptions and power dynamics; and investigate the ways these histories relate to current legal, political, and humanitarian organizations and movements. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "History of Sexually Transmitted Diseases",
      "classCode": "HIST 24",
      "description": "This course will survey the impact of sexually transmitted infections in a variety of national contexts, from the early modern period to recent times. The focus is mainly upon the history of classic venereal diseases such as syphilis and gonorrhea as well as more recently HIV/AIDS. How have medical debates about sexual contagion both influenced and been influenced by cultural conventions of blame, stigma, and moral judgment? Do representations of STDs provide a window into how a society organizes gendered expectations and constructs an image of deviant sexuality? How have responses to the problem of STDs changed over time? Can we examine these changes to better understand broader cultural adjustments to issues as diverse as prostitution and promiscuity, medical treatment and prophylaxis, and the politics of feminism, gay rights, and patients rights. Also listed as HIST 124. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Haitian Revolution in World History",
      "classCode": "HIST 43",
      "description": "Between 1789 and 1804, the French Caribbean colony of Saint-Domingue was the site of the most profound and violent realization of the revolutionary spirit sweeping the Atlantic in the “age of democratic revolutions.” This era is usually associated with the French and American revolutions, both key events in the history of democracy and the rhetorical development of human rights as an agenda in the West. However, both stopped short of the most radical realization of the promises of the age of Enlightenment, particularly with regard to slavery and the racial discrimination that went along with it. The slave revolt on Saint-Domingue and the Haitian revolution, by contrast, witnessed the fullest realization of these promises in the form of the only successful slave revolt in human history. The events on Hispaniola took place at the nexus of world historical forces of globalization through commerce, cross-cultural encounter, racial mixing, and the dispersal of radical Enlightenment ideas and their realization in the form of revolution. As a result of the powerful currents of human history that flowed through the region, the Haitian revolution has proved to be an enduring source of both fear and creativity in the history of race relations, slavery, and abolition, and the forging of a new world identity for the descendants of the once enslaved populations of the island. This course will examine the history of the revolutionary years in Haiti, its near erasure from Western historical memory, and the literary and historical recovery of its importance in the 20th and 21st centuries. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Black Migration in the World",
      "classCode": "HIST 57",
      "description": "This course examines the dynamic and sustained relationship between Africa and the African Diaspora through the multiple lenses of African Diaspora of the Indian Ocean, U.S. Blacks, West Indian, Afro-Brazilian, Afro-European, and Afro-Cuban missions, travel, migration and repatriation to various locations in Africa. The course entails a consideration of the religious exchanges, ethnic/racial transformations, travel tropes, and discourses on Pan-African identity that characterized the Back to Africa Movement in various locations of the Atlantic World. It will introduce students to a historiography of Black Intellectuals, individuals, and groups who look to Africa as not a homeland, but as a site of Christian evangelization, trade, pursuit of freedom and social justice.  Also listed as HIST 157 and ETHN 138. (4 Units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Global 1968",
      "classCode": "HIST 68",
      "description": "History is not only an account of what happened, but also why things change.  This class will focus on the political, cultural and social events of 1968, both within and without the United States, and the legacies and ramifications for twenty-first century political culture.  A better comprehension of where we are at present comes from an understanding of the past. In addition to gaining some knowledge of history, the aim of this course is to help students improve their interpretive analyses and critical thinking skills through reading, writing, and class discussions. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Technology: Steam to Cyborgs",
      "classCode": "HIST 79",
      "description": "This course provides an overview of important technological advances since the Industrial Revolution and takes a close look at a few specific technological touchstones from the 1760s to the 1920s. The rise of machines during this period profoundly influenced and challenged what it means to be human. A key goal is to question and explore the social and cultural context of emerging technologies and use the past as a guide for preparing ourselves in our own time of rapid change. Topics include the factory system, steam engines, photography, sound recording, cinema, industrial automation and design, and artificial intelligence. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Cold War",
      "classCode": "HIST 93",
      "description": "This course concentrates on the origins and consequences of the Cold War from a global perspective. The course covers the period from 1945 until 1991, considering economic, political, and social implications of the ideological conflict of communism versus capitalism. The course explores the origins of the conflict, the formation of opposing blocs, the interplay between periods of tension and détente, the engagement with contemporary anti-colonialism movements, and the relationship between the center of the conflict in the North Atlantic/European arena and its global periphery, the demise of the Soviet Union, and the enduring legacies of the Cold War.  (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Genocide and Gender in the 20th Century",
      "classCode": "HIST 102S",
      "description": "This course explores the gendered dimensions of genocide, focusing largely but not only on the Armenian genocide in the Ottoman Empire, the Holocaust during World War II, ethnic cleansing and genocide in Bosnia-Herzegovinain the 1990s, and the Rwandan genocide in 1994. Also listed as WGST 108.  (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "World History Until 1492",
      "classCode": "HIST 104",
      "description": "An overview of the great civilizations of the world prior to the Columbian Exchange, focusing on the geographical, cultural, economic, and political features of the complex societies in East Asia, Southeast Asia, South Asia, Africa, the Middle East, Europe, the Americas, and Oceania. Survey of the foundations of each region. Patterns of connection and interdependence in world history. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Sex and Gender in the Age of High Imperialism",
      "classCode": "HIST 116",
      "description": "An examination of the role of sexuality and gender in the global expansion of European hegemony in the 19th and 20th centuries. Explores these themes through literature, historical scholarship, and film. Also listed as WGST 124. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Human Rights and Humanitarianism",
      "classCode": "HIST 121",
      "description": "From reading current news articles, one might surmise that the dignity of human beings and their inherent right to freedom from undue suffering are self-evident, universally acknowledged goods that we should all pursue regardless of culture, place, or time. In fact, however, contemporary ideas about human rights, as well as humanitarian efforts (often pursued in far distant locales), have a particular history, one rooted in Western Enlightenment-era ideals of individual liberty and the brutal experiences of European imperialism. In this class, we will examine the histories and ideologies of human rights and humanitarianism, consider their underlying assumptions and power dynamics, and investigate the ways these histories relate to current legal, political, and humanitarian organizations and movements. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "History of Plagues, Epidemics, and Infections",
      "classCode": "HIST 123",
      "description": "An exploration of scientific, social, cultural, political, and ethical contexts in the history of infectious diseases and epidemics. Particular attention is given to how the social framing of epidemiological thought has shaped responses by societies, how public health is an intrinsically political matter, and how we can envision the place played by social justice perspectives in fashioning global public health. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "History of Sexually Transmitted Diseases",
      "classCode": "HIST 124",
      "description": "This course will survey the impact of sexually transmitted infections in a variety of national contexts, from the early modern period to recent times. The focus is mainly upon the history of classic venereal diseases such as syphilis and gonorrhea as well as more recently HIV/AIDS. How have medical debates about sexual contagion both influenced and been influenced by cultural conventions of blame, stigma, and moral judgment? Do representations of STDs provide a window into how a society organizes gendered expectations and constructs an image of deviant sexuality? How have responses to the problem of STDs changed over time? Can we examine these changes to better understand broader cultural adjustments to issues as diverse as prostitution and promiscuity, medical treatment and prophylaxis, and the politics of feminism, gay rights, and patients rights. Also listed as HIST 24, WGST 140A. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Gender and Rights in the Modern Era",
      "classCode": "HIST 138S",
      "description": "This course examines gender and rights in diverse contexts of citizenship, marriage and divorce, reproduction, health, the workplace, the body, and other categories of analysis with cases taken from modern Asia, Europe, the Americas, and Africa. The course problematizes the shifting concepts of gender, citizenship, and the body and attempts to analyze the meanings of gendered rights in varying national and transnational contexts.  Also listed as WGST 127. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Haitian Revolution in World History",
      "classCode": "HIST 143",
      "description": "Between 1789 and 1804, the French Caribbean colony of Saint-Domingue was the site of the most profound and violent realization of the revolutionary spirit sweeping the Atlantic in the “age of democratic revolutions.” This era is usually associated with the French and American revolutions, both key events in the history of democracy and the rhetorical development of human rights as an agenda in the West. However, both stopped short of the most radical realization of the promises of the age of Enlightenment, particularly with regard to slavery and the racial discrimination that went along with it. The slave revolt on Saint-Domingue and the Haitian revolution, by contrast, witnessed the fullest realization of these promises in the form of the only successful slave revolt in human history. The events on Hispaniola took place at the nexus of world historical forces of globalization through commerce, cross-cultural encounter, racial mixing, and the dispersal of radical Enlightenment ideas and their realization in the form of revolution. As a result of the powerful currents of human history that flowed through the region, the Haitian revolution has proved to be an enduring source of both fear and creativity in the history of race relations, slavery, and abolition, and the forging of a new world identity for the descendants of the once enslaved populations of the island. This course will examine the history of the revolutionary years in Haiti, its near erasure from Western historical memory, and the literary and historical recovery of its importance in the 20th and 21st centuries. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Islam in the Modern World",
      "classCode": "HIST 145",
      "description": "Islam is an understudied and thus poorly understood force in world affairs. As a result, many myths and fears have developed about its ideas, institutions, and activities. This course analyzes the diversity and complexity of Muslim cultures and societies in global affairs during the past two centuries. Special attention is paid to Muslims in Europe and the United States. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Civil Rights and Anti-Colonial Movements",
      "classCode": "HIST 153",
      "description": "Also listed as ETHN 149. For course description see ETHN 149. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Black Migration in the World",
      "classCode": "HIST 157",
      "description": "This course examines the dynamic and sustained relationship between Africa and the African Diaspora through the multiple lenses of African Diaspora of the Indian Ocean, U.S. Blacks, West Indian, Afro-Brazilian, Afro-European, and Afro-Cuban missions, travel, migration and repatriation to various locations in Africa. The course entails a consideration of the religious exchanges, ethnic/racial transformations, travel tropes, and discourses on Pan-African identity that characterized the Back to Africa Movement in various locations of the Atlantic World. It will introduce students to a historiography of Black Intellectuals, individuals, and groups who look to Africa as not a homeland, but as a site of Christian evangelization, trade, pursuit of freedom and social justice. Also listed as ETHN 138 and HIST 57.  (5 Units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Technology: Steam to Cyborgs",
      "classCode": "HIST 179",
      "description": "This course provides an overview of important technological advances since the Industrial Revolution and takes a close look at a few specific technological touchstones from the 1760s to the 1920s. The rise of machines during this period profoundly influenced and challenged what it means to be human. A key goal is to question and explore the social and cultural context of emerging technologies and use the past as a guide for preparing ourselves in our own time of rapid change. Topics include the factory system, steam engines, photography, sound recording, cinema, industrial automation and design, and artificial intelligence. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Digital and Public History",
      "classCode": "HIST 27",
      "description": "This course is an introduction to the intersection of digital history and public history. The course will explore digital literacy, with a focus on public history. Students will discuss how public history differs from academic history and how public history presents its material. Students will consider how digital history provides a unique outlet for public history. Students will explore how history is preserved online both in primary and secondary sources. Students will learn about the continuity and sustainability of digital history, including a lifelong commitment to both preservation and creation of history. Students will also explore how historians access sources created digitally, which has rapidly changed in just a few decades meaning some sources are inaccessible without old technology. In this course, students will interact and use a variety of digital tools and resources. Students  apply their mastery of the technologies in the culmination of a digital public history exhibition. Also listed as History 127.  (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "African American Pursuit of Freedom",
      "classCode": "HIST 55",
      "description": "This course covers various strategies African Americans used to attain freedom. These include slave rebellions, moral suasion for the Abolitionist movement, pamphleteering and political tracts by Black intellectuals and their impact on contemporaneous political discourse. Conversely, it engages with important judicial, executive, and legislative decisions that affected the African American struggle for freedom, equality, and manhood/womanhood in the 19th century. It will therefore give particular attention to film and written documentaries on rebellions like the Nat Turner rebellion, cases such as the Missouri Compromise (1820), and laws like The Fugitive Slave Law (1850). It will also examine casses like Dred and Harriet Scott (1857), and the proclamations like the Emancipation Proclamation/13th amendment (1863-1865). Also listed as ETHN 137. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "",
      "classCode": "HIST 60. Immigration & Race in the U.S",
      "description": "Since its founding immigration has been one of the most celebrated characteristics of the United States, but it is also one of the most contested. This course will look at the history of immigration to the territory that makes up the United States from the  late 18th century to the present day. Students will also examine immigration policies and practices, integration and exclusion, race and citizenship, and anti-immigrant movements. We will examine the forces driving immigration and the experiences of individuals and communities, as well as the reception of immigrants based on social categories like race, ethnicity, gender, sexuality, socioeconomic status, and religion. As such, we will cover salient issues in immigration discourse over the last  century including xenophobia, exclusion laws, deportation policy, and border policing - all of which are pertinent to immigration policy today. This class will ground students in the history of immigration in the United States, but will also provide opportunities to reflect on current debates.  Also listed as HIST 160. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "United States Political History: Democracy and Elections",
      "classCode": "HIST 65",
      "description": "An exploration of U.S. politics from the creation of the American republic to the present. Themes studied will include the rise and demise of political party systems, clashes between rival interest groups, and the evolving relationship between Americans and their government. The course will focus on several critical turning points in U.S. history when events, individuals, and various social and cultural factors helped shape the nation’s political development. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The American Revolution",
      "classCode": "HIST 70",
      "description": "Intensive study of the origins, progress, and culmination of the American Revolution to 1800. Emphasis is on the interplay between constitutional, social, economic and racial issues during the formative era of the United States. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Civil War Era",
      "classCode": "HIST 72",
      "description": "A study of the major aspects of the antebellum period, the Civil War, and the problems of Reconstruction. Emphasis is on the development of the slave system and resistance to it on the part of African Americans and other abolitionists, and the role of race and gender in the conduct of the war and in the development of Reconstruction. Also listed as History 172. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Natives and Newcomers: Early North America",
      "classCode": "HIST 75",
      "description": "This course explores the history of North America from the eve of European colonization through the mid-18th century. It focuses on key social, economic, and political developments during the period and on cross-cultural interactions between (and among) Euro-American colonists, Native peoples, and peoples of African descent. While the course examines the settler colonies that subsequently became the United States, it also emphasizes the development of the rival French and Spanish empires in North America as well as the rise of pan-Native movements aimed at resisting colonial domination. This course strives to investigate North America’s colonial past by considering a wide range of perspectives, reflecting the diversity of the various peoples who shaped its development. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "North America: Peoples & Lands",
      "classCode": "HIST 83",
      "description": "America’s geography is not just the stage for American History but an integral player in that history. This course explores how Americans’ interactions with the continent’s physical geography and built environments have shaped the nation from the pre-colonial era through the present day. Topics covered include: land use by Native peoples and settlers; U.S. expansion; immigration and internal migrations; urbanization, suburbanization, and gentrification; the conservation, preservation and environmental movements; and the response to natural and human-instigated disasters. Special emphasis is placed on topics related to California, and on the experiences of people marginalized by race, class and gender. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "United States Women’s History",
      "classCode": "HIST 84",
      "description": "Examination of the rich history of the changing social, economic, political, and intellectual life of women in the United States. Focuses on issues of gender, race, class, geographic setting, and ethnicity. Primary and secondary sources will be used to examine women’s self-conceptions and self-identifications, as well as gender constructs and prescribed roles. Also listed as WGST 57. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "United States Environmental History",
      "classCode": "HIST 85",
      "description": "Study of American environmental history from the pre-Columbian period to the present. Examines the interactions in history between the physical environment and economics, politics, gender, race, ethnicity, and religions. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Colonization, Revolution, and Civil War: The United States, Origins to 1877",
      "classCode": "HIST 96A",
      "description": "A survey of the history of the United States from European colonization to Reconstruction. Political, economic, social, and intellectual aspects of America’s first 250 years. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Counternarratives : The United States, 1877 to Present",
      "classCode": "HIST 96B",
      "description": "A survey of the history of the United States from the end of Reconstruction to 9/11 that focuses on counternarratives to interrogate the development of American political, economic, social, and intellectual life over the last century. . (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Race & Sex in Modern America",
      "classCode": "HIST 105",
      "description": "This course examines the history of interracial intimacies from the late 19th century to the present going beyond the black-and-white binary to examine the making and unmaking of multiracial families, communities, and identities in the United States. Students will study the forces that have brought people of different racial, ethnic, and religious backgrounds together and torn them apart. In the process students will develop a critical understanding of the comparative process of racial formation over time, the role the media, and federal and local governments played in policing intimacy across racial lines. Students will end the quarter exploring the influence multiracial individuals, families, and communities have had on local and mainstream institutions and cultural practices. Also listed as ETHN 176. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Race, Class, Gender, and Freedom",
      "classCode": "HIST 114",
      "description": "This course will be devoted to an exploration of the definitions and expressions of freedom within the United States by a variety of groups through the lenses of race, gender and class. The idea of freedom was present from the time our nation was founded and since then, individuals and groups within American society have claimed authority to define and defend their freedoms. The main themes will be political freedom (including speech, religion, civil rights, etc.), economic freedom, personal/sexual freedom, and exporting freedom. Also listed as ETHN 100. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Gender,  Sexuality, & Social Movements in the 20th c. U.S.",
      "classCode": "HIST 119",
      "description": "Gender and sexuality are oftentimes excluded from the studies of political movements, although both intersect with other core categories of analysis (i.e. race, economic status, and citizenship, etc.) that have shaped and been shaped by a century of social and political movements in the United States This course moves  chronologically, exploring major and minor movements, beginning with a discussion of the uses of gender in historical analysis and ending with an exploration of current social movements. In between, we will read primary and secondary sources that illuminate the various, often contradictory, ways that ideas about race, gender, and sexuality have converged to influence major social and political movements that continue to shape our world today. Also listed as WGST 168 and ETHN 169. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Digital and Public History",
      "classCode": "HIST 127",
      "description": "This course is an introduction to the intersection of digital history and public history. The course will explore digital literacy, with a focus on public history. Students will discuss how public history differs from academic history and how public history presents its material. Students will consider how digital history provides a unique outlet for public history. Students will explore how history is preserved online both in primary and secondary sources. Students will learn about the continuity and sustainability of digital history, including a lifelong commitment to both preservation and creation of history. Students will also explore how historians access sources created digitally, which has rapidly changed in just a few decades meaning some sources are inaccessible without old technology. In this course, students will interact and use a variety of digital tools and resources. Students will learn how these technologies have changed, and apply their mastery of of the technologies in the culmination of a digital public history exhibition. Also listed as History 27. (5 units)  153. Civil Rights and Anti-Colonial Movements. Also listed as ETHN 149. For course description see ETHN 149. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "African American  Pursuit of Freedom",
      "classCode": "HIST 155",
      "description": "The course covers various strategies African Americans used to attain freedom. These include slave rebellions, moral suasion for the Abolitionist movement, pamphleteering and political tracts by Black intellectuals and their impact on contemporaneous political discourse. Conversely, it engages with important judicial, executive, and legislative decisions that affected the African American struggle for freedom, equality, and manhood/womanhood in the 19th century. It will therefore give particular attention to film and written documentaries on rebellions like the Nat Turner rebellion, cases such as The Missouri Compromise (1820), and laws like The Fugitive Slave Law (1850), It will also examine cases like Dred and Harriet Scott (1857), and proclamations like the Emancipation Proclamation/13th Amendment (1863–1865). Also listed as ETHN 137. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "African-American History",
      "classCode": "HIST 156",
      "description": "The diversity of the African-American experience—freedom and justice, community and identity, ethnicity and class—continuing through the crusade for political and civil rights, and the impact of gender within the black community, and struggle into the present century. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Turmoil and Reform: United States 1877–1920",
      "classCode": "HIST 158",
      "description": "This informal lecture/discussion course examines the rich history of the evolving social, economic, political, and intellectual life of Americans from the end of Reconstruction through the peace following World War I. This course traces the dramatic changes that took place as the United States transformed into an urban industrial giant. This course also examines tensions between poverty and wealth, and the nation’s struggles over immigrants, gender, race, and America’s rightful role in global politics. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Immigration & Race in the United States",
      "classCode": "HIST 160",
      "description": "Since its founding immigration has been one of the most celebrated characteristics of the United States, but it is also one of the most contested. This course will look at the history of immigration to the territory that makes up the United States from the  late 18th century to the present day. We will examine immigration policies and practices, integration and exclusion, race and citizenship, and anti-immigrant movements. Students also examine the forces driving immigration and the experiences of individuals and communities, as well as the reception of immigrants based on social categories like race, ethnicity, gender, sexuality, socioeconomic status, and religion. As such, we will cover salient issues in immigration discourse over the last  century including xenophobia, exclusion laws, deportation policy, and border policing - all of which are pertinent to immigration policy today. This class will ground students in the history of immigration in the United States, but will also provide opportunities to reflect on current debates. Also listed as HIST 60 (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Parties & Presidents: US Political History",
      "classCode": "HIST 165",
      "description": "An exploration of U.S. politics from the creation of the American republic to the present. Themes studied will include the rise and demise of political party systems, clashes between rival interest groups, and the evolving relationship between Americans and their government. The course will focus on several critical turning points in U.S. history when events, individuals, and various social and cultural factors helped shape the nation’s political development. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Malcolm and Martin",
      "classCode": "HIST 168",
      "description": "This course explores the lives, philosophies, and political activism of Malcolm X and Martin Luther King Jr. In an effort to complicate the violence/nonviolence paradigm, which has often pitted the two men as political opponents, this course seeks to uncover the long trajectory of the philosophical development and political activism of both men through the end of each of their lives, in 1965 and 1968 respectively. Both figures’ lives and activism are situated within the black freedom movement of the 20th century, which was both transnational and global. As such, this course attempts to locate these two figures within various iterations of black nationalism, civil rights activism, anti-colonialism, and Black Power. Also listed as ETHN 133. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The American Revolution",
      "classCode": "HIST 170",
      "description": "Intensive study of the origins, progress, and culmination of the American Revolution to 1800.Emphasis is on the interplay between constitutional, social, economic, and racial issues during the formative era of the United States. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The New Nation: U.S. From Hamilton to Jackson",
      "classCode": "HIST 171",
      "description": "An examination of the social and political history of the United States during the half-century following the American Revolution. Course topics will include: the creation of the American republic; social and economic changes since the colonial period; the rise of political parties; the evolution of slavery, race relations, and white supremacy; early American expansion and foreign relations, including interactions with Native peoples; and the evolving role of government. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Civil War Era",
      "classCode": "HIST 172",
      "description": "A study of the major aspects of the antebellum period, the Civil War, and the problems of Reconstruction. Emphasis is on the development of the slave system and resistance to it on the part of AfricanAmericans and other abolitionists, and the role of race and gender in the conduct of the war and in the development of Reconstruction. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "American Slavery/Emancipation",
      "classCode": "HIST 172A",
      "description": "An investigation of slavery and the slave trade in North America, focusing especially on the United States and its colonial antecedents. We will consider the ways in which Euro-American colonization and the American and Haitian revolutions influenced ideas about race and slavery. We will also examine challenges to slavery, including various forms of resistance by the enslaved, as well as the anti-slavery and abolitionist movements that undermined the institution and contributed to its demise. The course will emphasize the lived experiences of the enslaved and of freed people in the wake of emancipation, as well as slavery’s lingering role in shaping ideas about race. Finally, we will consider more recent depictions of slavery intended for broader audiences, such as literature and film, in order to discuss the place of slavery in public consciousness and historical memory. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Flappers to Beatniks: The U.S. from 1920 to 1960",
      "classCode": "HIST 173",
      "description": "This course will introduce students to the crucial decades of the 1920s to the 1960s.  Through readings and discussions we will examine a variety of influential issues and themes, including politics (both domestic and foreign), sexuality, race, ethnicity, religion and gender.  The assigned readings have been selected to provide a sampling of the variety of current historical approaches to this crucial period that includes the \"Roaring\" Twenties, the Great Depression and the New Deal, World War II, the Cold War, and postwar challenges to domestic conformity leading up to 1960.  Students will be able to hone their own historical skills through both written and oral critiques of these readings. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Protest and Activism: The U.S. in the 1960s and 1970s",
      "classCode": "HIST 174",
      "description": "A study of social reform and reaction in America during the 1960s and 1970s. Emphasis is on the relationship among various social movements, such as the civil rights movement, the women’s movement, the anti-war movement, and the conservativemovement. Students will also examine the continuing effects of these various campaigns upon the overall culture of the United States. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Natives and Newcomers: Early North America",
      "classCode": "HIST 175",
      "description": "This course explores the history of North America from the eve of European colonization through the mid-18th century. It focuses on key social, economic, and political developments during the period and on cross-cultural interactions between (and among) Euro-American colonists, Native peoples, and peoples of African descent. While the course examines the settler colonies that subsequently became the United States, it also emphasizes the development of the rival French and Spanish empires in North America, as well as the rise of pan-Native movements aimed at resisting colonial domination. The course strives to investigate North America’s colonial past by considering a wide range of perspectives, reflecting the diversity of the various peoples who shaped its development. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Celebrity and Politics: U.S. 1980s to Present",
      "classCode": "HIST 176",
      "description": "An investigation of the United States from 1980 to the present. The focus of the course is on the changing nature of American society that intertwines celebrity and politics beginning with the conservative revolution of the Reagan years and ending at our current divisive political landscape and the virtual unlimited access to public figures. The course also examines the changing international context which helped to shape America’s role in the world, especially the fall of the Soviet Union and American military action in the Arab world. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Gays and Lesbians in United States History",
      "classCode": "HIST 177",
      "description": "Examination of the significance of gay men and lesbians across the broad sweep of American history, beginning with pre-Columbian Native Americans and concluding with the modern era. Religious, intellectual, economic, political, and social ramifications will all be examined. Also listed as WGST 138. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Race and World War II",
      "classCode": "HIST 178",
      "description": "Also listed as ETHN 178. For course description see ETHN 178. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Indigenous/Native Americans of the United States",
      "classCode": "HIST 180",
      "description": "Native American history from colonial times to the present from the perspective of native peoples. The focus is on selected Indian peoples in each historical period with an emphasis on native responses to changing historical circumstances, the continuity of Native American cultures, and Indian relations with the U.S. government in the 19th and 20th centuries. Topics include colonialism, Native Americans and environments, regional, and tribal histories. Also listed as ETHN 113. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Whiteness and Immigration in the United States",
      "classCode": "HIST 183",
      "description": "In this seminar, by examining the changing conceptions of “whiteness” over time, students will gain insight into the political, cultural, and economic shifts that have occurred in American history, reshaping the broader dynamics of race and ethnicity that continue to inform American life in the 21st century. Also listed as ETHN 172. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "North America: Peoples & Lands",
      "classCode": "HIST 184",
      "description": "America’s geography is not just the stage for American History but an integral player in that history. This course explores how Americans’ interactions with the continent’s physical geography and built environments have shaped the nation from the pre-colonial era through the present day. Topics covered include: land use by Native peoples and settlers; U.S. expansion; immigration and internal migrations; urbanization, suburbanization, and gentrification; the conservation, preservation, and environmental movements; and the response to natural and human-instigated disasters. Special emphasis is placed on topics related to California and on the experiences of people marginalized by race, class, and gender. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "African Americans in Postwar Film",
      "classCode": "HIST 185",
      "description": "Also listed as ETHN 135. For course description see ETHN 135. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "California",
      "classCode": "HIST 186",
      "description": "Survey of the state’s diverse history: its Indigenous origins, Spanish invasion and missionization, the Mexican period, U.S. conquest, gold rush, and development to the present. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Racism in the United States",
      "classCode": "HIST 187",
      "description": "Multidisciplinary study of racism in the United States. Its historical manifestations from the arrival of Europeans in North America to contemporary time; its psychological and political dimensions; and its impact on U.S. culture, law and economy. Also listed as ETHN 155 (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Making of Modern America: The Progressive Era",
      "classCode": "HIST 188S",
      "description": "This seminar examines the progressives (1880–1920), a group of reformers who struggled to more equitably redistribute the wealth and power of the newly industrialized, urbanized America, achieving mixed results. The impact of this crucial period of reform on politics, gender, class, business, the environment, leisure, and foreign affairs will be examined in order to illuminate current political and social views and actions. Students are evaluated on their informed participation and a research paper. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in United States History",
      "classCode": "HIST 189",
      "description": "Courses offered occasionally on subjects outside the standard curriculum in modern United States history. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ancient Greek Religion",
      "classCode": "HIST 16",
      "description": "Also listed as CLAS 67. For course description see CLAS 67. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ancient Roman Religion",
      "classCode": "HIST 17",
      "description": "Also listed as CLAS 68. For course description see CLAS 68. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The French Revolution: An Introduction",
      "classCode": "HIST 30",
      "description": "The French Revolution of 1789 topped the greatest monarchy in Europe and ultimately ushered in Napoleon Bonaparte’s empire. But it also introduced into the Western world the political vocabulary we still use today. Whenever we use political designations such as left and right, or talk about nationalism and citizenship and the rights of man, the French Revolution is being invoked, whether we know it or not! This class explores the exciting events of the revolution through literature, art, and film and the often-heated debates among historians about the real meaning of these dramatic years. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "This is What Democracy Looks Like? Fascism, Populism and Crisis",
      "classCode": "HIST 33",
      "description": "This course examines the phenomenon of populist politics in 19th and 20th century Europe and the US. It examines populism in history and as political theory; its analytical strengths and weaknesses; the overlap and divergences between right-wing populism and classic European fascism; and the differences between reactionary and progressive forms of populism.  Also listed as HIST 103. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Rebellion and War in Modern France",
      "classCode": "HIST 39",
      "description": "This course surveys the history of France from the founding of the Third Republic in 1870 to the present day with particular emphasis on republican universalism, French overseas imperialism, the Dreyfus Affair, the struggle for women’s equality, the role and experience of France in the two World Wars, and late-20th century patterns of decolonization and migration. (4 units) Also listed as HIST 139.",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Europe",
      "classCode": "HIST 94",
      "description": "A thematic approach to European history, from Early Modern to the present. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "This is What Democracy Looks Like? Fascism, Populism and Crisis",
      "classCode": "HIST 103",
      "description": "This course examines the phenomenon of populist politics in 19th and 20th century Europe and the US. It examines populism in history and as political theory; its analytical strengths and weaknesses; the overlap and divergences between right-wing populism and classic European fascism; and the differences between reactionary and progressive forms of populism.  Also listed as HIST 33. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Heretics and Holy Wars",
      "classCode": "HIST 106",
      "description": "Also listed as CLAS 144. For course description see CLAS 144 (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Archaic Greek History: Scientists and Spartans",
      "classCode": "HIST 107",
      "description": "Also listed as CLAS 107. For course description see CLAS 107. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Classical Greek History",
      "classCode": "HIST 108",
      "description": "Also listed as CLAS 108. For course description see CLAS 108. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Hellenistic Age",
      "classCode": "HIST 109",
      "description": "Also listed as CLAS 109. For course description see CLAS 109. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Roman Republic",
      "classCode": "HIST 110",
      "description": "Also listed as CLAS 110. For course description see CLAS 110. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Roman Empire",
      "classCode": "HIST 111",
      "description": "Also listed as CLAS 111. For course description see CLAS 111. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Gender, Race, and Citizenship in the Atlantic World",
      "classCode": "HIST 115",
      "description": "This course examines the terms by which the notion of citizenship was defined and granted over the course of the past three centuries with a focus on the Atlantic world. Key historical questions we will explore include: Who is a citizen and what defines him or her as a citizen? On what grounds were rights granted to citizens? How were gender and race defined, and how did those definitions determine the meaning of citizenship? How did disenfranchised groups argue for their rights, and in what situations were their claims successful? Also listed as WGST 169. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "State and Church in the Middle Ages, 1000–1450",
      "classCode": "HIST 117",
      "description": "This course examines the struggles between state and church that formed modern Western political institutions. Topics include the rise of royal and papal theocracy, the emergence of the idea of limited government, the foundation of representative institutions as well as modern legal institutions, and the origins of the modern state. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Representation, Rights, and Democracy, 1050–1792",
      "classCode": "HIST 118",
      "description": "This course charts the development of modern democracy from its roots in the Middle Ages to its implementation during the American and French revolutions, with a major emphasis on the tension of political theory and practice in its formation. Topics include the evolution of representation and citizenship and the place of social, economic, racial, and gendered forces in their formation. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Crusades: Christian and Muslim Perspectives",
      "classCode": "HIST 120",
      "description": "This course traces the history of the Crusades from the 11th to 16th centuries, using both Christian and Muslim perspectives on these wars to gauge their impact upon both Western Europe and the Islamic society of the Mediterranean. Students will explore the interplay of religious, social, political, and economic forces that motivated Christians and Muslims during these struggles, the impact the Crusades had upon both Christian and Muslim religious and social sensibilities, and the reasons for the success of the early Crusaders, the complex response of Muslim authorities to the European invasion, and the eventual success of Muslim forces in driving Christian forces far back into Europe. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Holocaust",
      "classCode": "HIST 122",
      "description": "Introduces students to the history of the Holocaust, the persecution and mass murder of Jews in Nazi Germany and Nazi-occupied Europe from 1933 to 1945. Also considers violence, including mass murder, carried out against other groups deemed racially and politically undesirable by the Nazis (e.g., people with mental and physical disabilities, the Romanies, members of the LGBT+ community, Afro-Germans, Slavic peoples). (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Conflicts in Medieval Christianity",
      "classCode": "HIST 126",
      "description": "This course is an examination of the religious tensions and conflicts that helped form later medieval Christianity. It treats heresies, the Inquisition, developing notions of orthodoxy and authority, the warrior Christianity of the Crusades, mendicancy and urban attitudes toward Christian perfection, the new monasticism, the development of a new personal approach to religion, lay tensions with the clergy, and the climate of reformation that spread through later medieval Europe. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Crime, Prostitution, and Poverty in Victorian London",
      "classCode": "HIST 128",
      "description": "This course explores the social and cultural history of London from the 1830s to 1900. Particular emphasis is placed on the strong contrast that Victorian London offered between imperial splendor and grinding misery. Students will examine Victorian perception and experiences of London poverty, filth, prostitution, and assorted vices, as well as art, culture, entertainment, and social reform movements. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in European History",
      "classCode": "HIST 130",
      "description": "Courses offered occasionally on subjects outside the standard curriculum in modern Europe. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Britain and the First World War",
      "classCode": "HIST 131",
      "description": "World War I gave birth to a range of difficult questions regarding the relationship between democratic ideals and how societies organize for modern conflicts, setting a strong pattern for the 20th century and continuing to possess strong resonances for today. What strains and opportunities does war place upon democratic societies? Does modern patriotism enable or distort the aspirations of free societies? What forces propel individuals to assist or resist modern war making? This course encourages students to think of war as not an activity solely directed by generals and politicians, but rather a social and cultural event that is formed and negotiated by citizens, workers, and parents. This course places the World War I battlefront in the context of British imperial history, and especially examines how four years of fighting shaped Britain’s modern national and civic identity. Readings and materials cover the significance of the home front in many forms including the propaganda machine, the Irish problem, public school tradition, industrial organization and trade union activity, and the women’s vote campaign. Civic groups organized by peace protesters, conscientious objectors, suffragists, and striking workers will be explored alongside groups such as national service advocates, Empire leagues, Boys Scouts, and civil preparedness organizations. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Democracy Under Siege: Ancient Athens and Modern America",
      "classCode": "HIST 132",
      "description": "Also listed as CLAS 113. For course description see CLAS 113. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "History of Sexuality",
      "classCode": "HIST 133",
      "description": "Study of the history of sexuality in modern Europe. Examination of topics such as the politics of prostitution, abortion, and pornography; changing sexual norms and practices; the invention of homosexuality and heterosexuality; professional and state involvement in the supervision and regulation of sexualities; intersections of sexuality with gender, ethnicity and race, nationality, class, and religion; connections between sexuality and imperialism; sexual communities and movements. Also listed as WGST 137. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Reformers and Revolutionaries in Tsarist Russia",
      "classCode": "HIST 134",
      "description": "Examination of politics, society, and culture in the Russian Empire from the reign of Peter the Great to the fall of the Romanov Dynasty in 1917. Themes include state building and modernization; peasant rebellion and the institution of serfdom; the nobility and its discontents; imperial expansion and the multiethnic Empire; the Orthodox Church and popular religion; aristocratic revolt and the Russian revolutionary intelligentsia; Alexander II and the Great Reforms; the growth of radicalism; industrialization and social change; the Revolution of 1905; and the crisis of the Old Regime. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Postwar Europe: Gender, Race, and National Identity in 20th-Century Eastern and Western Europe",
      "classCode": "HIST 136",
      "description": "An exploration of the ways in which social anxieties and ideas about gender, race, nationality, class, and sexuality shaped political, economic, social, and cultural developments in post-WWII Eastern and Western Europe. Three units structure the course: Communism and the Cold War; immigrants, race, gender, and national identity in post-war and post-colonial Europe; and challenges to the established order -- including the rebellions/revolutions in 1968, the women's and gay and lesbian liberation movements of the 1970s, and resistance to and the collapse of Communism.Also listed as WGST 172. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Soviet Experiment",
      "classCode": "HIST 137",
      "description": "An examination of the Soviet experiment to build the first self-proclaimed socialist government in history. Emphasis on political and economic policies, cultural practices, everyday life, and the evolution of social identities and roles, taking into account gender, regional, and national differences. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Rebellion & War in Modern France",
      "classCode": "HIST 139",
      "description": "This course surveys the history of France from the founding of the Third Republic in 1870 to the present day with particular emphasis on republican universalism, French overseas imperialism, the Dreyfus Affair, the struggle for women’s equality, the role and experience of France in the two World Wars, and late-20th century patterns of decolonization and migration. Also listed as HIST 39. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in European History",
      "classCode": "HIST 199",
      "description": "Courses offered occasionally on subjects outside the standard curriculum in modern Europe. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Women and African History",
      "classCode": "HIST 56",
      "description": "This course explores themes and perspectives on African Women's lives and their roles, contributions, and agency in shaping  histories, major historical events, civilizations, and societies. We will examine African women's activities in pre colonial, colonial, and postcolonial African societies. Further, we will explore the diversity of African women's experiences in local, regional, trans-oceanic, and international settings. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Black Migration in the World",
      "classCode": "HIST 57",
      "description": "This course examines the dynamic and sustained relationship between Africa and the African Diaspora through the multiple lenses of U.S. blacks, West Indian, Afro-Brazilian, Afro-European, and Afro-Cuban missions, travel, migration, and repatriation to various locations in Africa. The course entails a consideration of the religious exchanges, ethnic/racial transformations, travel tropes, and discourses on Pan-African identity that characterized the Back-to-Africa Movement in various locations of the Atlantic World. It will introduce students to a historiography of Black intellectuals, individuals, and groups who look to Africa as not only an ancestral homeland, but as a site of Christian evangelization, trade, pursuit of freedom and happiness, as well as social justice. Also listed as ETHN 138. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Africa in World History",
      "classCode": "HIST 91",
      "description": "Historical survey of the origins and development of African cultures from ancient times to the onset of European colonialism in the 20th century. Focus on selected civilizations and societies. Patterns of African social, economic, and political life including Womens  and Gendered institutions. Anticolonial Movements, Nationalism, and Pan-African histories. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "War and Peace in the Modern Middle East",
      "classCode": "HIST 97",
      "description": "This course explores the socio-economic and political history of the Middle East from the late Ottoman period to the present. We examine the region’s rich culture, religious heritage, and historical themes and developments. Themes include the impact of European imperialism during the late 19th and early 20th centuries, processes of Ottoman reform and decline, the creation of colonial mandates, the era of Arab nationalism, the Arab-Israeli conflict, the politics of oil, the role of the United States in the region, and the rise of political Islam. Finally, HIS 97 introduces students to an exciting array of primary and secondary sources including maps, films, speeches, treaties, and important correspondence.  (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Black Internationalism in the Atlantic Era",
      "classCode": "HIST 140",
      "description": "This course will explore writings by African-born individuals during the Atlantic period. It will focus on how they describe their experience of slavery and colonialism in Africa, their perceptions of and experiences in the Western World, as well as African-American perceptions of and experiences in Africa. The themes we will explore will include, but not limited to, colonialism, slave captivity narratives, autobiographical and biographical accounts of free blacks and African slaves in Europe and the Americas, the experiences of African royalty abroad, and African contributions to the birth of African-American culture and the emergence of “Creole” societies in the New World. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Politics and Development in Independent Africa",
      "classCode": "HIST 141",
      "description": "African economic, social, and political problems after independence. Major ideologies and international conflict. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Islam in Africa",
      "classCode": "HIST 144S",
      "description": "Examination of the history and contemporary role of Islam in Africa. The principal topics are the development of Islamic ideas and institutions, the impact of Islam on African cultures, the role of Islam in contemporary political and economic development, and the interaction between African and non-African organizations and governments. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in African or Middle Eastern History",
      "classCode": "HIST 149",
      "description": "Courses offered occasionally on subjects outside the standard curriculum in African or Middle Eastern history. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "China’s Rise to Global Power",
      "classCode": "HIST 48",
      "description": "In the past forty years, China has become the second most powerful economy in the world. It has also become a powerful military player as well. Many have assumed that China would become more democratic as it rose in strength. In fact, it has become more authoritarian and some speak of a new Cold War. As China’s ambitions have grown, some wonder about its impact on Taiwan, the South China Seas, and even internationally. In addition, its posture vis-à-vis Russia and the United States has changed as well. This course will trace China’s global rise to power since the founding of the People’s Republic of China. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Gender and Sexuality in East Asia",
      "classCode": "HIST 50",
      "description": "The historical study of women and men is necessarily the historical study of gendered societies. While there are important linkages among China, Japan, and Korea—for example, shared religious traditions, the varied experiences of imperialism, the central role of women and the construction of gender in modernity, and the physical movement of women and men among the three countries—there are also significant differences. This course will explore changes over time in sexualities, work experiences, civic culture, the gendered state, and marriage and family in the three countries. Also listed as WGST 126. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Modern India",
      "classCode": "HIST 54",
      "description": "History is not only what happened, but also why things change. This course is designed to examine the development of modern India from the seventeenth to the twenty-first centuries. We will survey the period as a whole by selecting significant events, processes, themes, and transitions that have shaped modern Indian history. What was the impact of the confluence, integration, and conflicts between different cultures and religions? Why and how did Britain expand, conquer, and prosper at the expense of India? How and why did they exit? How did India become the world’s biggest democracy? The class, in effect, will encompass an overview of the political, economic, social, and technological forces as well as the unique and strong personalities, which have contributed to the making and breaking of India. A better comprehension of where we are at present comes from an understanding of the past. In addition to gaining some knowledge of history, the aim of this course is to help students improve their interpretive analyses and critical-thinking skills through reading, writing, and class discussions. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Modern East Asia",
      "classCode": "HIST 92",
      "description": "An examination of the emergence of modern nations from the rich and diverse cultures of the Pacific and their mutual transformations since 1600. Analyzes linkages within the region and with other regions using concepts borrowed from anthropology, cultural studies, economics, and political science. Particular focus on China, Japan, and Korea from the 1600’s to the present.(4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Medieval and Early Modern Japan",
      "classCode": "HIST 146A",
      "description": "From the early medieval period through the middle of the 19th century, Japan developed as a blend of indigenous cultures, religions, and institutions and continental (Chinese and Korean) civilization and later European and American ideologies and imperialism. This course examines culture, ideas, religions, society/economy, and global interactions. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Modern Japan in the World",
      "classCode": "HIST 146B",
      "description": "An examination of Japanese history in its global context since 1600, with emphases on its 19th century “economic miracle;” problems faced by a rapidly modernizing and globalizing society; questions of national security and imperialism; reconstructing gender, personhood, and rights of Japanese men and women at several key moments in “modern” society; social and political movements such as suffrage and labor; war and reconstruction; and diaspora, both of people and ideas. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Wonders of Ancient China",
      "classCode": "HIST 147A",
      "description": "Chinese civilization from the earliest times to the early modern global encounter with the West. Includes Shang oracle bones, Emperor Qin Shi Huang and his terracotta army, the origins of the Great Wall and the Silk Road, Genghis Khan and the Mongol conquest, Tang empresses, Marco Polo, Zheng He and his expedition to Africa, the glories of the Ming dynasty, and Jesuit missionaries. Topics also include the evolution of Confucianism, Taoism, and Buddhism; development of political institutions; analysis of the pre-industrial economic experience; and state-society relations. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "China in Revolution, 1840-Present",
      "classCode": "HIST 147B",
      "description": "Social, political, economic, and cultural development of China from the early 19th century to the present.  Topics include China’s state formation from monarchy to socialism; cultural history from Confucianism to individualism; issues of poverty and population; intellectual and cultural changes and the role of the West in these changes; and the indigenous forces shaping China’s modern evolution. Students will also have the opportunity to research a current topic as China emerges as a global technological, economic, and military power. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Gender and Sexuality in East Asia",
      "classCode": "HIST 150",
      "description": "The historical study of women and men is necessarily the historical study of gendered societies. While there are important linkages among China, Japan, and Korea—for example, shared religious traditions, the varied experiences of imperialism, the central role of women and the construction of gender in modernity, and the physical movement of women and men among the three countries—there are also significant differences. This course explores changes over time in sexualities, work experiences, civic culture, the gendered state, and marriage and family in the three countries. Also listed as WGST 126. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Race and Imperialism in East Asia",
      "classCode": "HIST 151",
      "description": "Racism and ethnic discrimination were central factors driving imperialism in East Asia in the 19th and 20th centuries. Examining the three cases of France and the US in Vietnam, Japan in Korea, and the US in the Philippines, this course analyzes the role of racism not only in the colonies but also in the evolving definition of imperial nationhood in France, the United States, and Japan. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "History of Christianity in China",
      "classCode": "HIST 152",
      "description": "The history of Christianity in China from the seventh century to the present. We will explore the earliest evidence of Christianity in China, the Franciscan missions to the Mongols, the arrival of the Jesuits, the Chinese rites controversy, the persecution of Christianity, the rise of Protestant missions, and the explosive growth of Christianity in China today. We will also explore issues of church-state conflict, religious debate and conversion, and the complex interplay between foreign missions and Chinese developments.  We end with a discussion of the current surveillance and control of Christianity in China. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Modern India",
      "classCode": "HIST 154",
      "description": "History is not only what happened, but also why things change. This course is designed to examine the development of modern India from the seventeenth to the twenty-first centuries. We will survey the period as a whole by selecting significant events, processes, themes, and transitions that have shaped modern Indian history. What was the impact of the confluence, integration, and conflicts between different cultures and religions? Why and how did Britain expand, conquer, and prosper at the expense of India? How and why did they exit? How did India become the world’s biggest democracy? The class, in effect, will encompass an overview of the political, economic, social, and technological forces as well as the unique and strong personalities, which have contributed to the making and breaking of India. A better comprehension of where we are at present comes from an understanding of the past. In addition to gaining some knowledge of history, the aim of this course is to help students improve their interpretive analyses and critical-thinking skills through reading, writing, and class discussions. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in Asian History",
      "classCode": "HIST 159",
      "description": "Courses offered occasionally on subjects outside the standard curriculum in Asian history. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Dictatorship, Revolution, Narcos -- Mexico Since 1876",
      "classCode": "HIST 61",
      "description": "This course explores the history of Mexico from 1876 to the present, examining the roots of modern Mexican institutions, identity, and inequality. Students will analyze the authoritarian political traditions that influenced Mexican democracy, the social movements that shaped official mythologies and popular memory, and the modernization/technocratic policies that intensified poverty, urbanization, and migration during the twentieth century. Students will study the roles of race, class, and gender in Mexico, as well as foreign intervention, industrialization, and globalization. Special attention is given to how neoliberalism and the erosion of human rights and rule of law transformed Mexican society beginning in the 1980s. Crucially, students will immerse themselves in Mexican and US-Mexico borderlands history through music, film, media, popular art, literature, oral histories, and other primary and secondary sources. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Central America",
      "classCode": "HIST 64",
      "description": "Survey of Central America from independence to the present. Focus on three Central American countries: Nicaragua, Guatemala, and El Salvador. Emphasis on recent developments; social, economic, and political problems (militarism, dictatorship); and the nature of U.S. policy vis-à-vis Central America. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Latin America: Empires & Borderlands",
      "classCode": "HIST 66",
      "description": "Beginning with an exploration of indigenous empires in the Americas, the course then moves towards examining how the Spanish created and enforced their own empire in Mexico and North America that later clashed with U.S. expansion. History 66/166 analyzes the indigenous and Spanish backgrounds in Latin America and North America, providing foundational conceptualizations of conquest and colonialism in the region’s empires. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Modern Latin America",
      "classCode": "HIST 95",
      "description": "In the 20th century, Latin American nations emerged onto the world scene with economic growth that brought conflict and control, dependence and revolution, dictatorship and democracy. The course focuses on Mexico, Argentina, Brazil, Cuba, and Central America as it studies their underlying similarities and differences up to the present. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Dictatorship, Revolution, Narcos -- Mexico Since 1876",
      "classCode": "HIST 161",
      "description": "This course explores the history of Mexico from 1876 to the present, examining the roots of modern Mexican institutions, identity, and inequality. Students will analyze the authoritarian political traditions that influenced Mexican democracy, the social movements that shaped official mythologies and popular memory, and the modernization/technocratic policies that intensified poverty, urbanization, and migration during the twentieth century. Students will study the roles of race, class, and gender in Mexico, as well as foreign intervention, industrialization, and globalization. Special attention is given to how neoliberalism and the erosion of human rights and rule of law transformed Mexican society beginning in the 1980s. Crucially, students will immerse themselves in Mexican and US-Mexico borderlands history through music, film, media, popular art, literature, oral histories, and other primary and secondary sources. .(5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Argentina",
      "classCode": "HIST 162",
      "description": "Soldiers and missions, cities and plains, gauchos and immigrants, war and poetry, beef and wheat, politicians and a pope—these things and more describe the history of the complex, sophisticated land that occupies the southern part of the hemisphere. This course explores Argentina’s progress from a remote mystery to a cosmopolitan center of learning and business. The course brings into focus the challenges of unity, democracy, nationalism, freedom, and justice, with attention to the populist, authoritarian, and constitutional conflicts of the present. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Cuba and the Caribbean",
      "classCode": "HIST 163",
      "description": "A survey from the colonial period to the present of three Caribbean nations: Cuba, the Dominican Republic, and Puerto Rico. Emphasis on 20th-century developments; social, economic, and political issues (dictatorship, revolution, social stratification); and the role of U.S. policy vis-à-vis Cuba and the Caribbean. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Catholic Church in Latin America",
      "classCode": "HIST 164S",
      "description": "Readings, discussion, and research focused on the historical place, social role, and religious significance of the Catholic Church in Latin America, with attention to church-state issues, liberation theology, and the impact of the Church in nations affected by development, globalization, and poverty. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Latin America: Empires & Borderlands",
      "classCode": "HIST 166",
      "description": "Beginning with an exploration of indigenous empires in the Americas, the course then moves towards examining how the Spanish created and enforced their own empire in Mexico and North America that later clashed with U.S. expansion. History 66/166 analyzes the indigenous and Spanish backgrounds in Latin America and North America, providing foundational conceptualizations of conquest and colonialism in the region’s empires. (5 Units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in Latin American History",
      "classCode": "HIST 169",
      "description": "Courses offered occasionally on subjects outside the standard curriculum in Latin American history. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    }
  ]