[
    {
      "courseName": "Introduction to Biological Anthropology",
      "classCode": "ANTH 1",
      "description": "Using an evolutionary framework, we examine how past and current human variation is measured, our place in nature, human genetics, human and nonhuman primate biology and behavior, the primate and hominin fossil record, and the origin and meaning of human biological and behavioral variation. Students gain experience in biological anthropology methods, data analysis and interpretation, and the theoretical frameworks that guide our understanding of what it means to be human. Laboratory 15 hours. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Archaeology",
      "classCode": "ANTH 2",
      "description": "How do archaeologists understand the past? This course examines the methods, theories, and analytical techniques that archaeologists use to study the past and interpret ancient cultures. Selective survey of human cultures over time in different regions of the world. Laboratory 15 hours. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction Cultural Anthropology",
      "classCode": "ANTH 3",
      "description": "This course provides an introduction to the subject matter, research methods, and applications of cultural anthropology. Its purpose is to help students understand how different human groups think and live, how they cope with life’s demands and expectations, and how they make sense of the world. In order to gain additional experience with diverse cultural groups, students are required to participate in off-campus Arrupe partnerships. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Vanished Peoples and Lost Civilizations",
      "classCode": "ANTH 4",
      "description": "“Popular archaeology” is addressed by examining past societies, human migrations and cultural contacts, and ancient human behavior and technologies. Ideas and assumptions found in movies and other popular media will be evaluated in light of current archaeological data and theory. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Popular Culture and Bioanthropology",
      "classCode": "ANTH 5",
      "description": "From King Kong to Clan of the Cave Bear, students examine popular culture interpretations of biological anthropology. After reviewing the history of biological anthropology, we analyze popular avenues (film, cartoons, newspapers, fiction) through which the public has been informed about human variation, the human fossil record, primate behavior, and human genetics. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Screen Time: Culture, Film, and Media in the 21st Century",
      "classCode": "ANTH 6",
      "description": "This course uses anthropological perspectives and methods to explore how popular media shapes, creates, and transforms our understanding of culture, identity, and social relationships in the 21st century. This course is not just about culture, difference, and identity, but also about how we learn about and intersect with cultural and identity formation processes through various forms of media. Throughout the course we will use feature-length films as starting points for thinking critically about culture, gender, class, race/racism, economics, ideology, family, kinship, and violence. We will also be critically discussing how film and media shape our perceptions and understandings of the complex, global, and highly socially mediated world in which we live. One of the core premises of this course, following Bird and Godwin (2006), is that we cannot simply assume that media “speaks for itself.” Building upon the work of cultural and media anthropologists, and the late Neil Postman, the primary goal of this course is to push students to take a more active, and anthropologically informed, approach to the highly mediated world in which we live. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Field Course in Archaeological Methods",
      "classCode": "ANTH 7",
      "description": "On-site archaeological field research with practical experience in the basic techniques of excavation and data analysis. Students will gain experience in mapping, stratigraphic excavation, and field processing of finds. Laboratory component will include community outreach, cataloging, and relevant special analyses. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "11A. and 12A. Cultures & Ideas I and II",
      "classCode": "ANTH 11A",
      "description": "A two-course sequence focusing on a major theme in human experience and culture over a significant period of time. Courses emphasize either broad global interconnections or the construction of Western culture in its global context. Courses may address measuring humanity, peace and violence, social change in the Middle East, migration and transnationalism, and other topics. Successful completion of C&I I (ANTH 11A) is a prerequisite for C&I II (ANTH 12A). (4 units each quarter)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "11A. and 12A. Cultures & Ideas I and II",
      "classCode": "ANTH 12A",
      "description": "A two-course sequence focusing on a major theme in human experience and culture over a significant period of time. Courses emphasize either broad global interconnections or the construction of Western culture in its global context. Courses may address measuring humanity, peace and violence, social change in the Middle East, migration and transnationalism, and other topics. Successful completion of C&I I (ANTH 11A) is a prerequisite for C&I II (ANTH 12A). (4 units each quarter)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "World Geography",
      "classCode": "ANTH 50",
      "description": "This course explores world geography through examination of contemporary global problems including poverty and inequality, political conflict, environmental crises, and natural disasters. Special emphasis on economic development challenges in developing countries and on interconnections among diverse places and events. Also listed as ENVS 50. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Anthropological Theory",
      "classCode": "ANTH 110",
      "description": "This course provides a historical survey of the development of different areas of anthropological theory. By exploring original and secondary writings, students are able to understand how theoretical frameworks differ from each other and how anthropology has evolved as a discipline. Required for majors and minors in anthropology. Students should take this class no later than the winter quarter of their junior year. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Archaeological Methods",
      "classCode": "ANTH 111",
      "description": "Introduction to the techniques of discovery and analysis that archaeologists have found useful in research. Special attention to sampling techniques in survey and excavation. Laboratory analysis will consider techniques for measuring parameters of past demography, diet, craft specialization, and exchange. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Anthropological Methods",
      "classCode": "ANTH 112",
      "description": "This course examines research procedures, ethics, and theoretical issues associated with anthropological practice. Skills and methods of (qualitative and quantitative) research design and analysis are explored in readings and exercises. Required for majors in anthropology. Prerequisites: ANTH 1, 2, 3, with grades of C- or better, or special permission of the department chair. Students should take this class no later than spring quarter of their junior year. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Senior Capstone",
      "classCode": "ANTH 114",
      "description": "An in-depth writing intensive senior seminar in anthropology. Topic will change annually. Required for majors in anthropology. Prerequisite: ANTH 112 with a grade of C- or better, or special permission of the department chair. Students should take this class during the winter quarter of their senior year. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Primate Behavioral Ecology",
      "classCode": "ANTH 130",
      "description": "This course focuses on the theoretical frameworks that guide primate behavioral studies, including in-depth empirical exploration of adaptation, comparative primate behavior, ecology, field studies, and classification. Critical evaluation of core concepts in primate behavioral ecology as well as data collection, presentation, and interpretation in primate field studies are reviewed. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Paleoanthropology",
      "classCode": "ANTH 132",
      "description": "How do we know what we think we know about human evolution? Students explore this question by reading primary literature, examining fossil and comparative data, and exploring current technology for interpreting hominin evolution. Class reviews evolutionary theory and the varying applications of paleoanthropological analysis to understanding past and present variation. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Human Nutrition and Culture",
      "classCode": "ANTH 133",
      "description": "Study of the biocultural interactions that shape dietary patterns and nutritional status of modern humans. Focus on the evolution of the human diet and nutritional requirements; the basic principles of human nutrition and nutritional assessment; and the social, technological, and political factors that influence the nutritional health of human societies today. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Health, Disease, and Culture",
      "classCode": "ANTH 134",
      "description": "This course emphasizes the study of health and disease from biocultural and ecological perspectives; the influence of culture on the ways people explain and treat illness, stress, and healing; and the complexities of health care delivery in pluralistic societies. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Human Development and Sexuality",
      "classCode": "ANTH 135",
      "description": "Examination of evolutionary and biocultural aspects of human growth, development, and sexuality throughout the life cycle. Special emphasis on how various cultural, economic, and political factors influence norms of sexual behavior in different societies. Also listed as PHSC 135. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Forensic Anthropology",
      "classCode": "ANTH 136",
      "description": "Using physical remains to learn what we can about the age, gender, and other characteristics of deceased people, including their nutrition, exposure to diseases, experience with serious accidents, and causes of death. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Evolutionary Medicine",
      "classCode": "ANTH 137",
      "description": "This course examines how evolution has impacted human health and addresses questions such as: How are biology and human health related? How can an evolutionary perspective help us treat diseases? Topics from pregnancy to cancer and diet are examined through the lens of what we know about both human evolution and evolutionary processes. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Biology of Poverty",
      "classCode": "ANTH 138",
      "description": "This course will use a biocultural perspective to study the relationship between poverty and human biology. Using scientific articles, ethnographic texts, pieces from journalistic outlets, and popular science writings, we will learn how cultural understandings of the causes and effects of poverty have shifted over time. We will also examine how individuals navigate the challenges of living in poverty, sometimes exerting their own agency despite having minimal access to resources. Over the course of the quarter, we will turn a critical eye towards discussions of the “poverty problem” or “culture of poverty”. We will develop a more nuanced understanding of the conditions that create and reinforce these inequities, and how they give rise to biological feedback mechanisms that influence individual health outcomes.  (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Food, Culture, and the Environment",
      "classCode": "ANTH 140",
      "description": "Exploration of the history and impact that food choices have made on human societies and the environment. Several foods that are staples in the world today, such as sugar, pepper, and various grains, have significantly affected the environment, patterns of land use, economies (both local and global), cuisine, and the meaning of meals and food sharing. Class topics illustrate the regional and historical impacts of plant and animal domestication, the industrial revolution, and industrial agriculture on people and the environment.  Case studies highlight the cultural significance of foods, food choices, and agricultural economies. Also listed as ENVS 136. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Environmental Archaeology",
      "classCode": "ANTH 142",
      "description": "How archaeologists use environmental data to understand past human societies. Discussion topics include issues of human evolution, complexity, symbolism, social interaction, and technology. Discussion of the data and arguments offered for the role of environments in creating and shaping cultures—how environments and people shape each other. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Warriors, Wives, and Women: Gender in Archaeology",
      "classCode": "ANTH 143",
      "description": "From passive wives to wild warriors, this course interrogates the role of women (and men) in the past. At the center of our discussions will be the variation in gender experiences across time and space. Through archaeological case studies from the United States and across the world, we will explore how religion, class, orientation, and ethnicity impact the lived experience of gender. The course focuses on the diversity of approaches to gender and gender roles in Native American cultures, including adaptation and resistance to colonial power structures. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Historical Ecology",
      "classCode": "ANTH 145",
      "description": "Historical ecology investigates the long-term relationships between cultures and their environments. In this class, these relationships are viewed through the lens of technologies. In addition to examining case studies from around the world, students will integrate various types of historical and scientific data including archival documents, maps, and land use information, to learn how to reconstruct the historical ecology of the Santa Clara Valley. Also listed as ENVS 137. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Anthropological Perspectives on Colonial California",
      "classCode": "ANTH 146",
      "description": "Examines the Spanish and Russian colonization of California, with particular emphasis on their interactions with Native American societies. Ethnohistorical, documentary, and archaeological evidence will be used to explore European and Native American experiences in colonial California and the impact of European colonialism on communities today. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Archaeology: From Farm to City",
      "classCode": "ANTH 147",
      "description": "The world and people have changed radically in the last 10,000 years with the domestication of plants and animals and the development of cities and states. We examine archaeological evidence in different regions of the world (after 12000 BCE) to understand how and why these transformations occurred. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Historical Archaeology",
      "classCode": "ANTH 148",
      "description": "Introduction to the discipline of historical archaeology focusing particularly on colonial and U.S. contexts. Explores the history of underrepresented groups, from women and children to slaves, and colonial or contact interactions. A wide range of data sources used by historical archaeologists to aid in interpreting the past are explored. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Virtual Santa Clara, History & Culture",
      "classCode": "ANTH 149",
      "description": "Examination of public archaeology and museum studies in the digital age. Research on the cultural history of the SCU campus and the creation of content for online exhibits—a “virtual museum”—focusing on Santa Clara’s unique cultural heritage. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Religion in Culture and Society",
      "classCode": "ANTH 150",
      "description": "This course examines a wide range of religious beliefs, symbols, and practices that humans use to bring order and meaning into their existence. It explores theoretical interpretations of religion, the universality of myths and rituals, and the manner in which religious traditions are integrated into the fabric of daily lives and into international politics. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Power and Society",
      "classCode": "ANTH 152",
      "description": "Cross-cultural examination of political behavior in a range of human societies and the effects of social, cultural, and environmental factors on political organization. Religion and politics, the role of women in politics, ethnic competition, secret societies, political ritual and ceremony, and the effects of colonialism and economic change. Special emphasis on the relationship between local communities and national governments. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Anthropology of Music",
      "classCode": "ANTH 153",
      "description": "An intellectual history of ethnomusicology. Approaches and theories from anthropology, musicology, folklore, religious studies, linguistics, critical theory, and gender studies will be explored in order to interrogate music’s relationship to culture, power, and practice. Also listed as MUSC 130. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Environmental Anthropology",
      "classCode": "ANTH 154",
      "description": "Survey of the theories and methods used to examine the complex and dynamic interactions between humans and their physical environment (past and present). An emphasis is placed on the relationships between human cultural systems and ecological contexts by focusing on how humans use and transform ecosystems and how such interactions shape social, political, and economic institutions. Topics include political ecology, environmental justice, ecotourism, and natural resource exploration. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Anthropology of Conflict and Violence",
      "classCode": "ANTH 155",
      "description": "Examines sources and responses to conflict in varied social and cultural contexts. Emphasis on application of negotiation, mediation, and arbitration in different fields. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Anthropology of Muslim Peoples and Practices",
      "classCode": "ANTH 156",
      "description": "Examination of the variety of religious experiences, activities, and interpretations, and the place of Islam in current social and political life such as community organization, local-level politics, governments and political resistance, women’s roles and gender, and contact with the West. Discussion about underlying reasons for the resurgence of Islam and effects for Muslim peoples and societies. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Family, Kin, and Culture",
      "classCode": "ANTH 157",
      "description": "Examines the ways in which kinship and family life can be organized; causes and consequences of different family patterns; and how families differ across cultures, over time, and among different groups in the United States. Also listed as WGST 155. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Applied Anthropology",
      "classCode": "ANTH 158",
      "description": "Application of anthropological knowledge to contemporary human problems. Topics range from the introduction of new forms of economy through international development to anthropologists’ work in refugee resettlement, environmental conservation, public health, social justice movements, and others. Also examined are the ethical dilemmas that emerge from applying anthropological techniques and data. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Globalization and Cultural Change",
      "classCode": "ANTH 159",
      "description": "This course examines the cultural and economic changes brought about by globalization. It prepares students for traveling abroad and provides a reflective space for those who have returned. By critiquing corporate global control, cultural hegemony, and the illusion of unlimited economic growth, this course provides an alternative view of environmental sustainability and global justice. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Global Coast: Adaptation, Risk, and Resilience on the Edge of the Sea",
      "classCode": "ANTH 160",
      "description": "This course uses anthropological perspectives to explore humanity’s histories and challenges on the world’s coasts. Using a range of literature from the social and natural sciences, this course examines issues ranging from coastal urbanization, climate change risk and adaptation, coastal conservation, and pollution. Beginning with an overview of humanity’s relationship with and adaptation to the global coast, this class focuses on contemporary problems that coastal communities face around the world (e.g., sea level rise adaptation). Students will use both quantitative and qualitative frameworks to assess human-coastal relationships, with an eye toward addressing contemporary problems and global challenges. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Women, Gender, and Sexuality",
      "classCode": "ANTH 170",
      "description": "Cross-cultural examination of the roles, statuses, sexuality, and gender constructions of females and males through monographs, films, and guest speakers. Exploration of factors affecting the lives of women and men, such as domestic and public realms of activities, contested identities, political and economic factors, social change, religion, family, and socialization. Also listed as WGST 144. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Anthropology of Aging",
      "classCode": "ANTH 172",
      "description": "Examination of aging and the elderly in a range of human societies. Emphasis on social change, gender, and social and geographic mobility, as well as social, political, and cultural differences in understanding how the elderly adapt to, and cope with, the modern world. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Roman Studies: Rocks, Coins, and Pots",
      "classCode": "ANTH 173",
      "description": "This course provides an introduction to the study of the Roman world, with emphasis on the use of quantitative and qualitative research methods. Students will be introduced to the disciplines of archaeology, numismatics, epigraphy, and ceramic studies, and within these disciplines will examine and compare different methods of evaluating ancient evidence and data sets. Through utilizing different types of evidence and modes of analysis, this course introduces students to the society, culture, history, and economy of the Roman world from the Iron Age to Late Antiquity. Also listed as CLAS 172 and HIST 107. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Study of Selected Cultures",
      "classCode": "ANTH 180",
      "description": "Examination of the social life, culture, and institutions of geographic areas and culture zones not otherwise covered in ANTH 181–188 regional studies course series. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Religion and Culture in Latin America",
      "classCode": "ANTH 184",
      "description": "This course studies the relationship between culture and religion in Latin America, and how they have influenced each other over time. The class is designed in three stages. First, it examines the pre-Columbian world of religious beliefs and practices as embodied in the Maya, Aztec, and Inca cultures. Secondly, it explores how three centuries of Iberian colonialism and Catholic hegemony shaped the values, cultural traditions, and institutions of the region as reflected in the appearance of syncretistic forms of religion of European, African, and indigenous roots. Lastly, it studies the changes that have occurred in the last two centuries as the continent has gradually evolved from Catholic control to religious pluralism. Special attention will be given to the impact of Vatican II on the church in Latin America, the rise and role of liberation theology, and the emergence of Evangelical and Pentecostal Protestantism. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Anthropologies of Latin America: Culture, Politics, and Power",
      "classCode": "ANTH 185",
      "description": "An overview of the processes of social-cultural, economic, and political change in Latin America from an anthropological perspective. Students will study how the histories and legacies of conquest and colonialism continue to impact contemporary peoples. Furthermore, this course examines the intersections of race, class, gender, and ethnicity in the Americas with attention to how colonial era institutions and logics shaped these categories and experiences. Attention is placed on issues of power and inequality. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Mesoamerican Prehistory",
      "classCode": "ANTH 186",
      "description": "A survey of the prehistoric cultures of Mesoamerica from earliest human occupation to European colonization. Examines the origins of agriculture, village life, and the rise and fall of state-level societies through the work of archaeologists and epigraphists. Consideration given to the ecological adaptations, social organization, and belief systems of the Aztecs, Toltecs, Maya, and the inhabitants of Teotihuacan. Comparison of Mesoamerican societies with ancient societies around the world. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Middle East: Gender and Sexuality",
      "classCode": "ANTH 187",
      "description": "Examination through monographs, novels, guest speakers, and films of the situations and activities of Middle Eastern women in a variety of geographical and class settings. Topics include gender, sexuality and the body, women in economic and political process, family and kinship, war, and revolution. Women and gender symbolism as related to politics, development, social change, and religious resurgence. Also listed as WGST 120. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Middle East: Culture and Change",
      "classCode": "ANTH 188",
      "description": "Examination of people’s lives, social organization, and change in the Middle East through archaeological evidence, ethnographies, film, and novels. Emphasis on political culture, the fate of tribal peoples and peasants under modernizing nations, women in society and gender symbolism, contact with the West, Islam and religious resurgence, and revolution. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "First Americans: U.S. Archaeology",
      "classCode": "ANTH 189",
      "description": "What do we know about the indigenous inhabitants of the North American continent before European and Euro-American conquest and occupation? This course will examine the politics and archaeological practicalities of answering this question. Students will be introduced to the deep history and great diversity of Native societies across North America, from debates about the timing, means, and meaning of the first Americans to the varied and complex forms of Native American political organizations before and during the founding of the United States of America. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Seminar in Anthropology",
      "classCode": "ANTH 190",
      "description": "Seminars for juniors and seniors on selected topics in anthropology. By permission of the instructor only. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Peer Educator in Anthropology",
      "classCode": "ANTH 194",
      "description": "Peer educators in anthropology work closely with a faculty member to help students understand course material, think more deeply about course material, benefit from collaborative learning, feel less anxious about testing situations, and/or help students enjoy learning. By permission of the instructor only. (1–2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Field Course in Anthropological Methods",
      "classCode": "ANTH 195",
      "description": "On-site anthropological field research in any of the subfields of anthropology. Practical experience in the basic techniques of observation and field analyses. By permission of the chair and instructor only. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Field Course in Primate Behavioral Ecology",
      "classCode": "ANTH 197",
      "description": "On-site anthropological primatological field research with practical experience in the basic techniques of observation and field data analysis. Special attention to community ecology, proposal writing, data collection, data analysis, and presentation. Students conduct independent data collection to produce a completed scientific paper for which they are the sole author. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Anthropology Proseminar",
      "classCode": "ANTH 198",
      "description": "Opportunity for students to work and conduct anthropological analyses in community agencies, museums, government agencies, and political or industrial organizations. May be repeated for credit with approval of the chair. Required for majors in anthropology. Students must receive approval from their advisor prior to registration. Internship placements must be completed prior to fall quarter of senior year. Field schools and other research experiences may substitute for internship placements with approval. Students must enroll in the internship class during the fall of their junior or senior year. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Reading/Directed Research",
      "classCode": "ANTH 199",
      "description": "Intensive reading in areas not emphasized by the department. Independent research on specific topics not fully covered in departmental courses. May be repeated for credit with approval of the chair. Written departmental approval necessary prior to registration. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Unlisted Course",
      "classCode": "UNLS 999",
      "description": "Empty",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    }
  ]