[
    {
      "courseName": "Arabic Language and Culture I",
      "classCode": "ARAB 1",
      "description": "This course introduces students to Modern Standard Arabic (MSA) and the cultures of the Arabic-speaking world. Through the four basic skills of listening, speaking, reading, writing, as well as cultural knowledge, students will acquire basic knowledge and understanding in the writing system; sounds and pronunciation of Arabic letters; Arabic grammar; writing and reading basic sentences; and building a list of vocabulary in MSA and colloquial Arabic. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Arabic Language and Culture II",
      "classCode": "ARAB 2",
      "description": "A continuation of ARAB 1 designed for students to acquire additional vocabulary, the rules of Arabic grammar, and reading more complex materials. MSA through Al-Kitaab series textbooks will be used to allow students to acquire additional knowledge and understanding in many areas of the Arabic language. Students in this course are exposed to authentic reading and listening materials that are of more depth and length than those used in ARAB 1. Prerequisite: ARAB 1 or Placement Test recommendation. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Arabic  Language and Culture III",
      "classCode": "ARAB 3",
      "description": "A continuation of ARAB 2 in which students will acquire additional vocabulary, a more advanced understanding of Arabic grammar, and will write and read more complex materials with comprehension of case system and sentence structure. MSA through Al-Kitaab series textbooks will be used to allow students to acquire additional knowledge and understanding in the structure of the Arabic language. Students in this course are exposed to authentic reading and listening materials through lectures, discussions, exercises, and communicative language activities. Prerequisite: ARAB 2 or Placement Test recommendation. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Cultures & Ideas: Arabic Media, Culture, and Politics",
      "classCode": "ARAB 11A",
      "description": "Students will learn how media, culture and politics intersect in the contemporary Arab Middle East. Students will examine the role of the evolving Arab media landscape in shaping the socio-political information environment in Arab countries. Topics include Arab Enlightenment & Nationalism, Arab press, rise of satellite television, the Al-Jazeera phenomenon, censorship and free speech.  Does NOT satisfy the CORE language requirement. Prerequisites: NONE (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Cultures & Ideas: Arabic Media, Culture, and Politics",
      "classCode": "ARAB 12A",
      "description": "Students will learn about the Arab Spring (AS) and the role of media, journalistic writings, short films, songs, social media, and reporting. They will examine authoritarianism in the Middle East, the sociology of social movements and uprisings. The course will include case studies of the uprisings in Tunisia, Libya, Syria, Yemen, and Egypt. It scrutinizes the dynamics of the uprisings, demonstrations, activists, and eye witness accounts. Does NOT satisfy the CORE language requirement. Prerequisites: NONE (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Arabic Language and Culture IV",
      "classCode": "ARAB 21",
      "description": "This course is intended for students who completed ARAB 3 or equivalent. Students will learn to understand short to medium length texts, write longer complex sentences using connectors such as and, but, in addition, etc. describe a variety of real life situations and topics such as describing a city, a friend, a place, etc. Students will learn to communicate effectively in social situations such as introducing one’s lifestyle, habits, hobbies, ordering food, etc. Students will present and explain in Arabic social and cultural aspects of Arabic culture such as music, holidays, and education. Students will compare elements in Arabic culture with their own culture. Prerequisite: ARAB 3 or Placement Test recommendation. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Arabic Language and Culture V",
      "classCode": "ARAB 22",
      "description": "Continuation of Intermediate ARAB 21 with focus on building additional vocabulary, using Arabic-English dictionary, reading and discussion of Arabic texts dealing with the literature, arts, geography, history, and culture of the Arabic-speaking world. The teaching/learning process in this level is proficiency-oriented where emphasis is placed on the functional usage of Arabic, in social interactions, greetings, and the discovery and appreciation of the rich cultural diversity of the Arab world and its place in the global arena.. Prerequisite: ARAB 21 or Placement Test recommendation. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Arabic Language and Culture VI",
      "classCode": "ARAB 23",
      "description": "Continuation of ARAB 22 with focus on grammatical and linguistic structure in texts dealing with the literature, arts, geography, history, and culture of the Arabic-speaking world. The teaching/learning process in this level is proficiency-oriented where emphasis is placed on the functional usage of Arabic. Prerequisite: ARAB 22 or Placement Test recommendation. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Intermediate Arabic Conversation",
      "classCode": "ARAB 50",
      "description": "This course focuses on the spoken Arabic dialect of the Levant (Lebanon, Syria, Jordan, and Palestine) as one of the major Arabic dialects spoken and understood in the Arab world. The course is a combination of lecture, discussion, exercises, and communicative language activities. It aims to develop conversational skills focusing on the use of topic-structured drills and activities that are appropriate to the context in which the language will be spoken. Representative examples of colloquial literature, plays, songs, and TV series will be introduced. Colloquial Arabic will be the primary language of instruction. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Modern Arabic Culture and Society",
      "classCode": "ARAB 137",
      "description": "This course will introduce the students to the major aspects of Arabic and Islamic culture in the context of the complex history of the Arabic world. It will include coverage of religious and ethnic diversity, language, the Arabic family structure, values, traditions, and customs. Arabic literature and poetry from the classical period to the present will be introduced. The Arabic visual and performing arts, music, food, and clothing will be covered. This course is open to all upper-division students who are interested in learning about Arabs and their culture. This course is taught in English; knowledge of Arabic is desirable but not required. Course does not fulfill University Core foreign language requirement. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Reading the Quran",
      "classCode": "ARAB 171",
      "description": "This class will introduce students to the Quranic discourse in English translation as a literary product of 7th-century Arabia. No prior knowledge of Arabic or the Quran is required, though it is encouraged. The Quran is the sacred scripture of 2 billion Muslims, or 1 in 4 people in the world, and by 2030 it is estimated that 1 in 3 people will be Muslim. Yet, few Americans have ever read the Quran and even fewer understand its literary significance. This class looks at the Quran within its historical context, first as an aural experience, and second as a written scripture unfolding over the course over the 23-year mission of the Prophet Muhammad. For 1,400 years, the Quran has served as the gold standard of the Arabic language and the pinnacle of Arabic literary and linguistic achievement. Course is taught in English. Prerequisite: None. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Arab Americans: History, Literature, and Culture",
      "classCode": "ARAB 185",
      "description": "This course explores how Arab-Americans write about and reflect on being American. We will explore themes such as immigration, citizenship, religious differences, gender relations, cultural politics and cross-cultural encounters. Our course will be oriented toward answering important questions such as: How did Arabs blend into American society and became American? Why are Arab-Americans concentrated in Michigan, New York, and California? How did they recreate their communities? How did historical events shape and influence their writing and texts? What traditions and cultural practices have they preserved, e.g., foods, language, religion? We will explore how writers and filmmakers elaborate new modes and spaces of representation; how they address issues of marginalization, race, gender, identity, cultural hybridity and intergenerational conflicts. Course taught in English. Does NOT satisfy the CORE language requirement. Prerequisites: NONE  (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Peer Educator in Arabic",
      "classCode": "ARAB 194",
      "description": "Peer educators are invited by faculty to work closely with them, facilitating learning in a lower-division course. May be repeated for credit by permission of the instructor. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Reading",
      "classCode": "ARAB 199",
      "description": "Individually designed programs of advanced readings. Written permission of the instructor and department chair is required in advance of registration. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Chinese Language and Chinese-Speaking Cultures I",
      "classCode": "CHIN 1",
      "description": "Designed for those having no previous study of Mandarin Chinese. A proficiency-based course emphasizing the four critical communicative language skills (listening, speaking, reading, and writing). Development of a cultural understanding of Chinese and Chinese-speaking communities. No prerequisite. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Chinese Language and Chinese-Speaking Cultures II",
      "classCode": "CHIN 2",
      "description": "Continuation of CHIN 1, Chinese 2 continues basic training in the four critical communicative language skills. Further development of cultural understanding of Chinese and Chinese-speaking communities. Prerequisite: Chinese 1 or Placement Test Recommendation. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Chinese Language and Chinese-Speaking Cultures III",
      "classCode": "CHIN 3",
      "description": "CHIN 3 completes first-year Chinese. This course emphasizes the development of the four critical communicative language skills (listening, speaking, reading, and writing). Development of a cultural understanding of Chinese and Chinese-speaking communities. Prerequisite: CHIN 2 or Placement Test recommendation. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Chinese Language and Chinese-Speaking Cultures I",
      "classCode": "CHIN 21",
      "description": "The first course in a three-part learning of the fundamentals of spoken and written Mandarin Chinese at the intermediate level. Progressive and authentic readings and exercises in conversation and composition. Development of a cultural understanding of Chinese and Chinese-speaking communities. Prerequisite: CHIN 3 or Placement Test recommendation. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Chinese Language and Chinese-Speaking Cultures II",
      "classCode": "CHIN 22",
      "description": "Continuation of CHIN 21, CHIN 22 focuses on  Chinese and Chinese-speaking cultures , together with progressive development of all Chinese language skills and cultural literacy. Broadening appreciation of Chinese cultures and Chinese-speaking communities through authentic readings and discussions. Prerequisite: CHIN 21 or Placement Test recommendation. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Chinese Language and Chinese-Speaking Cultures III",
      "classCode": "CHIN 23",
      "description": "Completion of Intermediate Chinese. The successful completion of Intermediate Chinese may prepare students for Upper-Division courses in broader Chinese cultures and other aspects in Chinese-speaking communities. Prerequisite: CHIN 22 or equivalent. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Chinese Conversation: Culture and Society I",
      "classCode": "CHIN 100",
      "description": "This course focuses on advanced conversational practice in Chinese. Students will develop proficiency in Chinese language in different cultural contexts, and utilize the language necessary to participate in Chinese-speaking communities. Students will also develop cultural competence and critical thinking skills by exploring a variety of cultural topics through videos, films, readings, and other media, and analyzing current events, societal issues, economic developments, and changing culture in the Chinese-speaking world. This course is taught in Chinese. Prerequisite: CHIN 23 or a placement test recommendation for Chinese UD courses. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Chinese Conversation: Culture and Society II",
      "classCode": "CHIN 101",
      "description": "This course is the second course in the series of advanced level Chinese courses. Students will further develop their advanced conversational language skills in cultural contexts. Emphasis is placed on continuing to develop cultural competence and critical thinking skills by exploring a variety of cultural topics through videos, films, readings, and other media, and analyzing current events, societal issues, economic developments, and changing culture in the Chinese-speaking world. This course is taught in Chinese. Prerequisite: CHIN100 or a placement test recommendation for Chinese UD courses. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Chinese III",
      "classCode": "CHIN 102",
      "description": "This course completes the advanced Chinese series and is aimed at expanding the vocabulary in written and spoken Chinese and developing an ability to comprehend and use complex grammatical structures with ease. Course conducted in Chinese. Prerequisite: CHIN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Business Culture in the Chinese-speaking World",
      "classCode": "CHIN 103",
      "description": "This course is designed for students to explore Chinese business etiquettes and norms in the Chinese-speaking world.  It aims at helping students deepen their critical thinking on business opportunities and challenges based on an understanding of the socio-political, economic, and cultural environments in business contexts in the Chinese-speaking communities. As a result, they may build ethical and respectful business relationships with their potential Chinese-speaking business partners. The course not only covers Chinese business etiquettes, but also introduces Chinese philosophy, values, traditional ideology, and cultures that shape today’s business behaviors and beliefs in the local communities. Students will also have a chance to conduct case analyses of international companies that have successfully adapted to the Chinese-speaking market. Students will also learn fundamental business expressions and terms along with exploring business cultures. This course is taught in Chinese. Pre-requisites: two years of Chinese learning.  Prerequisite: CHIN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Language of Love and Affection in Sinophone Films",
      "classCode": "CHIN 125",
      "description": "This course is an introduction to cinemas in Sinophon (Chinese-speaking) communities, with a special focus on the representation and the language of love (family, friends, romance, etc.).  Beyond “what” is represented, students are expected to explore “how” and “why” love is represented and the embedded sociocultural and sociolinguistic aspects.  This introductory course is discussion-based and invites students from various cultural backgrounds to participate via comparisons with their own cultural products and perspectives.  This course is taught in English, and it does not fulfill the Second Language Core Requirement.  Prerequisite: NONE (5 Units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Sinophone Pop Culture in a Global Context",
      "classCode": "CHIN 126",
      "description": "This course examines the popular culture in Sinophone (Chinese speaking) communities, e.g. Mainland China (PRC), H.K., Taiwan (ROC), and other overseas communities through a sociolinguistic and cultural anthropological approach, with a special focus on the contemporary development and distinctive features of six different cultural products and genres, including (1) pop songs/singers, (2) music videos, (3) commercial ads, (4) TV dramas, (5) social media, and (6) video/mobile games. Students are expected to apply their insights gained through theoretical discussions and debates regarding cultural differences and diverse perspectives. It is taught in English and does not fulfill the Second Language Core Requirement. Prerequisites: NONE (5 Units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Chinese History and Culture",
      "classCode": "CHIN 127",
      "description": "This course introduces students to key aspects of China’s history and culture. This course explores the legacies of various dynasties and significant historical events and figures in chronological order; and introduces traditional Chinese ideology, traditions and values, arts and crafts, folk customs, etc. Course conducted in Chinese. Prerequisite: Two years of Chinese language or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Social Justice in Taiwan–Past, Present, and Future",
      "classCode": "CHIN 128",
      "description": "This course is an introduction to social justice in Taiwan, focusing on four aspects — (1) transitional justice (from authoritarianism to democracy), (2) marital justice (first Asian country legalizing same-sex marriage), (3) linguistic justice (revival movement of mother/indigenous languages), and (4) environmental justice (sustainability).  It is designed to motivate SCU students to explore the sociocultural and historical factors that have been driving this long-neglected young democratic entity to pursue social justice in the above-mentioned aspects, and to demonstrate their understanding of these issues through several multimodal projects.  It is taught in English and does not fulfill the Second Language Core Requirement. Prerequisite: None (5 Units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Modern Chinese Culture",
      "classCode": "CHIN 137",
      "description": "This course introduces students to the culture in modern China through literature (fiction and other reading matter), popular music, and film with an emphasis on business etiquette and culture in China. All readings are in English. No Chinese language is required, though students with Chinese language background are encouraged to work with Chinese sources if they wish. This course does not fulfill the University Core foreign language requirement. Prerequisite: None. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Peer Educator in Chinese",
      "classCode": "CHIN 194",
      "description": "Peer educators are invited by faculty to work closely with them, facilitating learning in a lower-division course. May be repeated for credit by permission of the instructor. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics",
      "classCode": "CHIN 197",
      "description": "Variable topics in culture, literature, and film. May be retaken for credit. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Study",
      "classCode": "CHIN 198",
      "description": "Individually designed programs of advanced study. Restricted to seniors who find themselves in special circumstances (i.e., Asian studies or international studies minors). May be taken only once. Courses exempted from challenge may not be taken as directed study. Prerequisite: Written course outline must be approved by instructor and department chair in advance of registration. (1–3 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Reading",
      "classCode": "CHIN 199",
      "description": "Individually designed programs of advanced readings. Prerequisite: Written permission of the instructor and department chair is required in advance of registration. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Elementary French I",
      "classCode": "FREN 1N",
      "description": "This course is designed to develop basic communicative skills in preparation for FREN 1 and FREN2. Conducted in level-appropriate French. Prerequisite: Placement Test survey recommendation. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to French Language and Francophone Cultures I",
      "classCode": "FREN 1",
      "description": "FREN 1 is an elementary, proficiency-based course, which aims to develop students’ communicative language skills and intercultural competence. It requires active in-class performance, emphasizing interaction (speaking, viewing/listening, reading, writing) in authentic contexts and engagement with French and Francophone cultures and perspectives. Conducted in French. Prerequisite: Placement Test survey and test recommendation. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to French Language and Francophone Cultures II",
      "classCode": "FREN 2",
      "description": "FREN 2 expands students’ communicative language skills and Intercultural competence.  This proficiency-based course requires active participation in class, emphasizing interaction (speaking, viewing/listening, reading, writing) in authentic contexts and engagement with French and Francophone cultures and perspectives. Offered only in winter. Course conducted in French. Prerequisite: French 1 OR a Placement Test recommendation. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to French Language and Francophone Cultures III",
      "classCode": "FREN 3",
      "description": "This course continues to expand students’ communicative language skills and intercultural competence. This proficiency-based course requires active participation in class, emphasizing interaction (speaking, viewing/listening, reading, writing) in authentic contexts and engagement with French and Francophone cultures and perspectives. Offered only in Spring. Course conducted in French. Prerequisite: French 2 OR a Placement Test recommendation. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Cultures and Ideas: The French-Speaking World",
      "classCode": "FREN 11A",
      "description": "Part 1 of a  two-part course in the study of the French-speaking world. Does NOT satisfy the CORE language requirement. Prerequisites: NONE (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Cultures and Ideas: The French-Speaking World",
      "classCode": "FREN 12A",
      "description": "Part 2 of a two-part course in the study of the French-speaking world.  Does NOT satisfy the CORE language requirement. Prerequisites: NONE (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "French Language and Francophone Cultures I",
      "classCode": "FREN 21",
      "description": "This intermediate-level course focuses on real-world language use, the integration of French and Francophone cultures and the development of students’ reading, writing, listening and speaking skills. The course reviews first-year grammar while introducing new vocabulary and structures.  It emphasizes engagement with authentic materials in order to deepen students’ cultural awareness of the Francophone world and fosters critical thinking and reflection.  Course taught in French.  Prerequisite: FREN  3 OR a Placement Score and recommendation. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Close Encounters of a Different Kind: Tales and Legends from the Francophone World",
      "classCode": "FREN 21A",
      "description": "This intermediate-level language course aims to improve the student’s ability to speak, read, and write in French, to systematically review grammar previously studied, to master new vocabulary and concepts in French, and to enhance their knowledge of the cultural diversity of the French-speaking world through the study of (folk/fairy) tales and legends and the characters that inhabit them. Students will be introduced to a variety of oral and written art forms, customs, and material culture from different Francophone regions; they will sharpen their cultural and critical skills, and develop an active understanding of the importance of folk traditions (folklife) and the various ways they help us discover and express who we are and how we fit into the world. This course will heavily emphasize oral communication; students will be expected to speak in French in a number of situations ranging from question and answer to oral presentations, group work and/or situations. Prerequisite:  FREN 3 or Placement Test Recommendation. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "French Language and Francophone Cultures II",
      "classCode": "FREN 22",
      "description": "This intermediate-level course expands students’ engagement with real-world language use and authentic materials in order to improve their communicative skills (reading, writing, listening, and speaking). The course also aims to deepen students’ knowledge of Francophone cultures and societies and to foster their critical thinking and reflection. Offered only in winter. Prerequisite:  FREN 21/21A OR a Placement Test score and recommendation. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Language, Film, & Youth Cultures",
      "classCode": "FREN 22A",
      "description": "This intermediate-level course is designed to provide students with the opportunity to improve their grammar as well as conversational and writing skills through the exploration of youth cultures as they are represented in French & Francophone Cinema. It is built around viewing and discussing feature-length French ilms to enable students to reach an advanced level of language proficiency and to foster a better understanding of contemporary French and Francophone cultures. The course will emphasize extensive grammar practice in speaking and writing in French as well as building practical vocabulary with an emphasis on comprehension and oral/written expression.  PREREQUISITE: This course is offered to students who have successfully completed FREN 21 or FREN 21A or Placement Test score and recommendation. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Intermediate French Conversation",
      "classCode": "FREN 50",
      "description": "A course concentrating on development of a student’s ability to speak and understand various French accents. Film viewing each week. Recommended for students going abroad. Course includes French-speaking field trips and discussions with French visitors. No auditors. Prerequisite: FREN 22 or equivalent. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to French and Francophone Studies",
      "classCode": "FREN 100",
      "description": "This foundational course provides students with a systematic review of the fundamental structures of French grammar and emphasizes the development of oral communication, cultural literacy, and analytic skills through different genres of cultural expression. In this course, students will gain a deeper insight into French thought, history, and culture. An essential course for studying abroad. Course conducted in French. Prerequisite: FREN 22/22A or Placement Test Recommendation. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Literary and Cultural Analysis",
      "classCode": "FREN 101",
      "description": "This is an introductory course on literary analysis preparing students to all subsequent upper-division courses in French and Francophone Studies. This course is designed to help students develop critical thinking and reflect on how language and culture impact the creation of meaning in different genres including prose, poetry, and theater. Students will acquire critical vocabulary and skills that they will apply to close readings of literary texts. Course conducted in French. Prerequisite: FREN 22, 22A, or100 or Placement Test recommendation. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced French III",
      "classCode": "FREN 102",
      "description": "Variable topics in specific fields. Studies abroad. (Units vary based on program)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Critical Writing in French",
      "classCode": "FREN 103",
      "description": "This foundational course develops students’ advanced writing skills in French so as to foster their analytical skills and creativity. Students will engage with different genres and learn about different aspects of advanced writing, including language, structure, description, various writing concepts and techniques that will help them develop more organized writing and a sophisticated argument in narrative form.It is recommended that all Majors and Minors take at least one advanced writing course.. Prerequisite: FREN 100 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "(W)rites of Passage: French Writing Workshop",
      "classCode": "FREN 103A",
      "description": "French 103A is a foundational course for students wishing to improve their written French. The class will be organized around the theme of youth and include the following topics: coming of age, self-discovery, falling in love, social justice and the university experience. College is, after all, a rite of passage that symbolically marks the end of childhood and the start of adulthood. This course therefore, is about rites of passage, but also writing the passage: exploring various writing styles, practices and techniques in order to develop your own “voice” and become a more creative, skilled and confident writer. It is recommended that all Majors and Minors take at least one advanced writing course. Prerequisite: FREN 100 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Art of Story-Telling: Creative Writing Workshop",
      "classCode": "FREN 104",
      "description": "In this writing workshop, students will craft creative stories in French based on their own life experiences as well as invent original pieces of fiction with more fantastical settings.  The connection between reading and writing will be stressed and students will read texts from established authors for inspiration and to use as models to improve their own writing.   Students will give and receive feedback on their writing from their peers and the instructor.  The course will provide a full review of French grammar as students develop the ability to revise and edit their own work.  If you love French and have a passion for story-telling, then this writing workshop is for you!  It is recommended that all Majors and Minors take at least one advanced writing course.  Prerequisite: FREN 100 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Across Language Borders: Interpretation and Translation",
      "classCode": "FREN 105",
      "description": "This translation workshop will introduce students to the art and practice of translation. Students will learn to examine how meaning travels across cultural and linguistic borders and how translation serves as a tool for cross-cultural communication. We will focus on the process of translating by examining the structural and stylistic differences between English and French, and the issues of literalness, imitation, analogy, interpretation and cultural transfer.  Although some of the reading material will be in English, the course will be conducted in French.  It is recommended that all Majors and Minors take at least one advanced writing course. . Prerequisite: FREN 100 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Oral Communication in French",
      "classCode": "FREN 106",
      "description": "Intensive oral practice of French in the context of socio-political issues and themes as they relate to contemporary French and Francophone societies. Extensive practice and debate will help students express themselves, understand French in a variety of situations and reflect about socio-political and cultural complexities. An added value of this course is its “practicum forum” which leads students to make audio sketches, reports, debates, mock interviews and thus assess their own ability and progress.Prerequisite: FREN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "French Business Culture and Institutions",
      "classCode": "FREN 108",
      "description": "Basic French business terminology and practices. Business letter writing emphasized. Examination of French business institutions (agriculture, finance, advertising, transportation, etc.). Special emphasis on understanding the underlying cultural mores that make French business different from U.S. business.  Course conducted in French. Prerequisite: FREN 101 or equivalent. (5 units).",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Contemporary France: Cultures, Society and Politics",
      "classCode": "FREN 110",
      "description": "In this course, students will take a close look at fundamental issues reflecting the rapidly changing dimensions of contemporary French culture and society. Through an interdisciplinary approach combining close readings of literary and historical texts, films, visual arts, as well as critical and theoretical articles, we will explore the social, political, and cultural evolution of France as well as gain a firm understanding of important historical events. Prerequisite: FREN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to the Francophone World",
      "classCode": "FREN 111",
      "description": "Cultural, political, economic, educational, and social aspects of the Francophone world. Exploration through literary works, film excerpts, newspapers, as well as critical articles of issues involving nationalism, race, gender, identity, and alienation. Geographic areas include the Caribbean, Morocco, sub-Saharan Africa, and Vietnam. Course conducted in French. Prerequisite: FREN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Sub-Saharan African/Caribbean Women Writers",
      "classCode": "FREN 113",
      "description": "An introduction to literature written by sub-Saharan African/Caribbean women writers. Through literature (interviews, personal testimonies, novels, autobiography) and film (documentaries, movies), students will witness the changing faces of sub-Saharan Africa, from colonial times to the present, as seen through the eyes of women. Course conducted in French. Also listed as WGST 123. Prerequisite: FREN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Literatures and Cultures of the Maghreb",
      "classCode": "FREN 114",
      "description": "This course focuses on works by Francophone writers and filmmakers from North Africa (Morocco, Tunisia, Algeria). We shall examine the historical and aesthetic evolution of this literary and filmic production, and how it reflects on the colonial past and the postcolonial condition. Other topics include the way these writers and filmmakers seek to construct identities in the wake of profound cultural changes brought about by colonization, decolonization, immigration, and globalization, and how they expose the power conflicts along the lines of class, gender, race, ethnicity, and national belonging. Attention will also be devoted to the discursive strategies and filmmaking practices that they elaborate to address these issues in a resistant, subversive, and direct criticism. Course conducted in French. Prerequisite: FREN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "French Literature & Culture I",
      "classCode": "FREN 115",
      "description": "Readings in French literature from its beginnings in the Moyen Age to the end of the 18th century. Rotated topics include the theme of love, the comic, the writer’s relationship to societies, the emerging genre of the theatre, etc. Course conducted in French. Prerequisite: FREN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "French Literature & Culture II",
      "classCode": "FREN 116",
      "description": "Readings in French literature of the 19th and 20th centuries. Rotated topics include drama, the novel, literature and the arts, experimentation (literary and dramatic), etc. Course conducted in French. May be taken independently of FREN 115. Prerequisite: FREN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "French Orientalism: Representation of Otherness in Literature, Cinema, and Visual Arts",
      "classCode": "FREN 117",
      "description": "This course examines differing constructions of the Oriental “Other” as it took shape in French literary and non-literary representations from the 18th to the 21st century. We will analyze how politics and ideology inform the construction and reproduction of knowledge about the “Other” as well as the complex interactions between race, ethnicity, gender, sexuality, exoticism, and the various subject-object positions occupied by the observer, traveler, writer/voyeur. We will also analyze how these French writers, painters, photographers, travelers, and filmmakers have used alterity as a mirror for self-reflection, as a tool to critique sociopolitical practices, and as the locus of a threat to cultural homogeneity and national identity. This course will engage theories of Orientalism, identity and difference, and colonialism and postcolonialism. Selected literary texts, paintings and films include works by Montesquieu, Pierre Loti, Théophile Gautier, Flaubert, Delacroix, Matisse, Albert Camus, Allegret, and Coline Serreau. Prerequisite: FREN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in French & Francophone Theatres",
      "classCode": "FREN 140",
      "description": "In this course, we will examine plays from the French and Francophone world, and the language of performance. We will center on the sociopolitical and cultural contexts of the plays as well as representations of critical issues such as class, gender, politics, sexuality, immigration, terrorism, as well as the role of language. We will look at theatre as a written text, an art form, a performance, and spectacle. Prerequisite: FREN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The French Revolution in a Global Context",
      "classCode": "FREN 150",
      "description": "This course focuses on the 18th century, called the century of light (meaning the “light” of “reason”), when French writers, philosophers, pamphleteers, artists, who considered themselves European and citizens of the world, shook off traditional authorities of kings, priests, fathers, and refused the legitimacy of ready-made ideas. We shall examine their ideals of liberty, equality, and justice and their attacks on war, colonialism, slavery, the death penalty, intolerance, and religious fanaticism. We will seek to discover the relationship between our societies and their legacy as that legacy had a global impact—inspiring the American and French revolutions. Readings of representative novels, short stories, “discours,” letters and plays, and study of artworks in their cultural (political, social, historical) contexts. Prerequisite: FREN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "20th-Century France: War, Memory, and Trauma",
      "classCode": "FREN 171",
      "description": "This course will explore some of the major literary and artistic movements of the 20th century, such as the Engagée literature, the Anti-theatre, the New Novel, the New Wave. We will examine the aesthetic evolution of this literary and filmic production, and how it reflects on the profound cultural, social, political and historical changes in France. Class discussions, scholarly research and critical analysis form part of the course and foster the understanding and assimilation of basic methodological concepts and tools. Course conducted in French. Prerequisite: FREN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to French Cinema",
      "classCode": "FREN 172",
      "description": "An examination of the evolution of style and theme in French cinema from its birth in 1895 to the present. Study of films by major directors (Renoir, Pagnol, Cocteau, Truffaut, Malle, Beineix, Diane Kurys). Main themes of French culture illustrated in the films. Course conducted in French. Prerequisite: FREN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Immigration, Race, and Identity in Contemporary France",
      "classCode": "FREN 173",
      "description": "This course explores the experience of immigrants and their children to France as portrayed by authors and filmmakers from different origins. It centers on the historical and political circumstances that form the context of this artistic production and examines the theoretical problems involved in analyzing questions of immigration, marginalization, race, gender, ethnicity, and national identity in France. Course conducted in French. Prerequisite: FREN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "French and Francophone Novels and Films: Culture, Gender, and Class",
      "classCode": "FREN 174",
      "description": "Covers both French and Francophone novels (including novels from sub-Saharan Africa, the Caribbean, and Vietnam), and films based on the same texts. The goals are (1) to introduce students to French and Francophone culture through analysis of significant texts and through the lens of films, and (2) to develop critical skills of interpretation applicable to all disciplines. Course taught in French. (Note: At times, this course may be conducted in English but would contain a French component for French and Francophone studies majors and minors). Also listed as WGST 175. Prerequisite: FREN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Transnational Cinema",
      "classCode": "FREN 175",
      "description": "Increased mobility, new patterns of migration, demographic changes, and global exchanges characterize the development of a transnational film culture with its own trends and aesthetics. This course introduces students to the concept, practices, and the sociopolitical discourses of transnational filmmaking. Particular attention will be devoted to the historical and cultural contexts that have shaped the development of transnational cinemas, asking how this cinema reflects the cultural, social, linguistic, and political realities of an increasingly interconnected world. This course will also further students’ understanding of film language and contemporary critical debates on global issues including multiculturalism, transnational identity, politics of location, cultural conflicts, displacement, diasporic practices, and “contact zones.” Prerequisite: FREN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "French Perspectives on Social Justice",
      "classCode": "FREN 176",
      "description": "The term social justice is an old one, dating back at least to Enlightenment France, but it is now more present than ever in 21st century politics and culture, especially in the debates over feminism, sexuality, race, immigration, inequality and environmentalism. This course examines the idea of social justice through the lens of French culture and history, and it raises the following questions: What is social justice? How has it been articulated or invoked?  How can we gain insight into contemporary calls for social justice, both in France and around the world? Class discussions will be structured around short  readings of French history and literature, as well as viewings of world cinema. Prerequisite: FREN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Technology, Science and Society: From Romanticism to the Digital Age",
      "classCode": "FREN 177",
      "description": "When we think of technology today, we tend to think of smartphones, social media and the Internet. Technology has come to be identified with what is only a particular kind (i.e., information technology), but the concept itself is far broader. Accordingly, this class seeks to study the formative influences and social impacts of technology and techno-culture. Its starting point will be the utopian science of nineteenth-century Paris, which saw the rise of photography, daguerreotypes, automata, panoramas and electrodynamics, amongst other interesting experiments. Such “romantic” technologies were described in terms of spiritual quest and self-expression, often in ways which anticipate contemporary obsessions with social media and technological progress. In order to explore both romantic and present-day understandings of technology and its social implications, we will establish a dialogue between nineteenth-century techno-culture and our current digital age. Prerequisite: FREN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Women in French Literature",
      "classCode": "FREN 182",
      "description": "Analysis of the representation of women in the works of major French writers, both male and female, from the Middle Ages to the 21st century. Provides information on French women writers’ contributions with, as background, information on French women’s roles and experiences throughout the ages. Special attention will be given to the continuity among women writers and to the impact of their minority status upon their writing. Readings set against the backdrop of the Monarchy, the French Revolution of 1789, the Napoleonic regime, the Franco-Prussian war, and the two World Wars will point out to an emerging feminist awareness that found expression in both literature and political activism. Course conducted in French. Also listed as WGST 176. Prerequisite: FREN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "20th- and 21st-Century French Women Writers",
      "classCode": "FREN 183",
      "description": "The varied literary contributions of French and Francophone writers such as Colette, Simone de Beauvoir, Marguerite Duras, Gabrielle Roy, Mariama Bâ, Linda Lê; their differing perceptions of the traditional stereotypes of women and perspectives related to social class. Consideration of whether feminine literature has unique qualities. Course conducted in French. Also listed as WGST 177. Prerequisite: FREN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "French Applied Linguistics",
      "classCode": "FREN 185",
      "description": "Aspects of modern French linguistics (phonology, phonetics, morphology, syntax). Contrastive analysis. Course conducted in French.  Prerequisite: FREN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Politics of Love",
      "classCode": "FREN 186",
      "description": "Students will focus on the theme of love (from the passionate love of Tristan and Iseult to the modern concept of love and marriage) and study how different literary movements have adapted love stories to reflect their values and their visions of the world. Why do these cultural representations and social constructions of the gendered human body and sexuality often show off the social insertion of the hero and the exclusion of feminine characters? In other words, what are the social, sexual, political consequences of the power games present in the love stories read this quarter? Course conducted in French. Prerequisite: FREN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Peer Educator in French",
      "classCode": "FREN 194",
      "description": "Peer educators are invited by faculty to work closely with them, facilitating learning in a lower-division course. May be repeated for credit by permission of the instructor. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics",
      "classCode": "FREN 197",
      "description": "Variable topics in culture, literature, and film. May be retaken for credit. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Study",
      "classCode": "FREN 198",
      "description": "Individually designed programs of advanced study. Normally restricted to seniors who are declared French and Francophone studies majors or minors and who find themselves in special circumstances. May be taken only once. Courses exempted from challenge may not be taken as directed study. Prerequisite: Written course outline must be approved by instructor and department chair in advance of registration. (1–3 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Reading",
      "classCode": "FREN 199",
      "description": "Individually designed programs of advanced readings. Prerequisite: Written permission of the instructor and department chair is required in advance of registration. (1–5 units) Note: The following courses are literature and culture in translation courses taught in English and cannot be used to fulfill the undergraduate Core Curriculum second language requirement. One course may be counted toward the French and Francophone studies major. (Minors should plan to take courses taught in French.)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Human Rights in France, Sub-Saharan Africa, and the Caribbean",
      "classCode": "FREN 112",
      "description": "Provides a framework on France and its colonial empire, presents important male writings during the colonial period, and deals with texts written by women writers in a recent past. Focuses on cultural identity and human rights, yet special attention will be given to the ways in which self-representation is achieved by the female writing subject. Conducted in English.(5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "20th-Century French Women Writers in Translation",
      "classCode": "FREN 184",
      "description": "Critical analysis of major works by leading women writers in France and the Francophone world such as Charlotte Delbo, Pierrette Fleutiaux, Annie Ernaux, Linda Lê, Anna Moï, Calixte Beyala, Marie Darrieussecq, Eliette Abecassis, Amélie Nothomb, Paula Dumont and Kim Thuy. Study of themes related to the 20th-century and contemporary French experience (the Shoah, World Wars, migrant experience, the Bosnian war, terrorism) in short stories, autobiographies, BD, migrant tales, and paintings. Conducted in English. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Elementary German I",
      "classCode": "GERM 1",
      "description": "Designed for those having no previous study of German. A proficiency-based course emphasizing communicative language skills (understanding, speaking, reading, and writing). Introduces students to the language and culture of German-speaking countries. Offered only in fall. Prerequisite: None. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Elementary German II",
      "classCode": "GERM 2",
      "description": "The second in a series of three courses, GERM 2 emphasizes the development of communicative language skills (understanding, speaking, reading, and writing). Expands student exposure to language and culture of the cultures of German-speaking countries. Offered only in winter Prerequisite: GERM 1 or equivalent. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Elementary German III",
      "classCode": "GERM 3",
      "description": "GERM 3 completes first-year German. This course emphasizes the development of communicative language skills (understanding, speaking, reading, and writing). Further increases student exposure to language and culture of German-speaking countries. Offered only in spring. Prerequisite: GERM 2 or equivalent. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "German Cities: From Berliners to Frankfurters to Leipzigers",
      "classCode": "GERM 21",
      "description": "With a focus on selected cities and regions from Germany, GERM 21 invites students to experience the culinary highlights of Germany’s capital, the financial appeal of Germany’s Mainhattan as well as Leipzig’s role in Germany’s reunification.  In doing so, GERM 21 offers a review of the essentials of German grammar, short stories, or essays on culture and civilization. Prerequisite: GERM 3 or placement test recommendation (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Intermediate German II",
      "classCode": "GERM 22",
      "description": "Continuation of GERM 21. Expanded readings, conversation, and writing. Further development of students' linguistic and cultural knowledge. Offered only in winter. Prerequisite: GERM 21, or Placement Recommendation, or equivalent. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Intermediate German Conversation",
      "classCode": "GERM 50",
      "description": "Designed for the intermediate level, the course focuses on further developing students’ conversational abilities and their cultural knowledge of German-speaking countries.  Emphasis is placed on presentations and discussions of current events, contemporary films and a timely, authentic soap opera.  It is recommended for students preparing for advanced course work or those pursuing stays or studies abroad.  Prerequisites: GERM 22 or Placement Recommendation, or equivalent (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced German I",
      "classCode": "GERM 100",
      "description": "A language course aimed at expanding students’ abilities in reading, listening, writing, and conversation, with a focus on written and oral expression. Required of all majors and minors. Offered every two years alternating with GERM 106. Prerequisite: GERM 22 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced German II",
      "classCode": "GERM 101",
      "description": "Deepening of students’ abilities in all four language skills. Required of all majors and minors. Completion or equivalent knowledge admits students to higher-numbered courses. Offered every two years alternating with GERM 140. Prerequisite: GERM 100 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced German Conversation",
      "classCode": "GERM 106",
      "description": "This course promotes conversational practice in German. Focus will be on topics from contemporary German films and print media. Offered every two years alternating with GERM 100. Prerequisite: GERM 22 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "German Business Culture and Institutions",
      "classCode": "GERM 108",
      "description": "Introduction to the language of business German. Insights into Germany’s place in the global economy. The topics, language, and skill-building exercises offer an excellent preparation for students who, after two years of college-level German, plan to pursue careers in international companies and institutions. At the same time, the materials are appropriate for German majors or minors who want to gain insight into contemporary German culture and civilization. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "History of German Civilization",
      "classCode": "GERM 110",
      "description": "Cultural history of the German-speaking countries from earliest times to 1945. Prerequisite: GERM 100 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Contemporary German Civilization",
      "classCode": "GERM 111",
      "description": "Geography, culture, education, politics, and the economy in the German-speaking countries since 1945. Prerequisite: GERM 100 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Germany in the Media",
      "classCode": "GERM 112",
      "description": "How do Germans and Americans view Germany? This course highlights the role of the media in portraying Germany’s image inside and outside of Germany. It examines how print and electronic media in both countries present selected themes and topics in the following categories: arts, economy, education, politics, and the sciences; and how the media shape public opinion about Germany. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "German Film: From Fassbinder to Fatih Akin",
      "classCode": "GERM 113",
      "description": "This course introduces students to German cinema from the 1970s to the present. Through films such as The Marriage of Maria Braun, Run Lola Run, Nowhere in Africa, Good Bye, Lenin!, and Gegen die Wand, students gain insights into the cultural, social, and political history of modern Germany. Prerequisite: GERM 22 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "German Fairy Tales",
      "classCode": "GERM 140",
      "description": "German fairy tales and their origins across Europe. Selected works by the Grimm Brothers and their predecessors. Offered every two years alternating with GERM 101. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "20th-Century Novel",
      "classCode": "GERM 150",
      "description": "Works by Kafka, Hesse, Thomas Mann, Christa Wolf, Böll, and others. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The German Novelle",
      "classCode": "GERM 160",
      "description": "Characteristic features of the Novelle as opposed to Roman and Erzählung. Examples from Theodor Storm to Thomas Mann. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "German Novels and Films",
      "classCode": "GERM 174",
      "description": "Various topics will be covered. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Women in German Literature: Authors and Characters",
      "classCode": "GERM 182",
      "description": "Works by and about German women. Authors studied include Droste-Hulshof, Böll, Wolf, Handke, Kaschnitz, Wander, and others. Also listed as WGST 179. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Peer Educator in German",
      "classCode": "GERM 194",
      "description": "Peer educators are invited by faculty to work closely with them, facilitating learning in a lower-division course. May be repeated for credit by permission of the instructor. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics",
      "classCode": "GERM 197",
      "description": "Variable topics in culture and literature. May be retaken for credit. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Study",
      "classCode": "GERM 198",
      "description": "Individually designed programs of advanced study. Normally restricted to seniors who are declared German studies majors or minors and who find themselves in special circumstances. May be taken only once. Courses exempted from challenge may not be taken as directed study. Written course outline must be approved by instructor and department chair in advance of registration. (1–3 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Reading",
      "classCode": "GERM 199",
      "description": "Individually designed programs of advanced readings. Written permission of the instructor and department chair is required in advance of registration. (1–5 units) Note: The following course is a literature in translation course taught in English and cannot be used to fulfill the second language requirement. One course may be counted toward the German studies minor.",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "German Literature in English Translation",
      "classCode": "GERM 115",
      "description": "Reading and analysis of masterpieces of German literature written between 1750 and 1970. Selection dependent upon available translations. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to  Italian Language and Culture I",
      "classCode": "ITAL 1",
      "description": "This is the first in a series of three elementary-level courses that should be taken in sequence. ITAL 1 is designed for students with no prior experience with Italian. It emphasizes the development of communicative language skills and cultural competence. This proficiency-based course requires active participation in class. Offered only in Fall. The elementary sequence is highly recommended for students who intend to apply for a study abroad program in Italy. Prerequisite: none. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to  Italian Language and Culture II",
      "classCode": "ITAL 2",
      "description": "This is the second in a series of three elementary-level courses. It emphasizes the development of communicative language skills and cultural competence. This proficiency-based course requires active participation in class. Offered only in Winter. The elementary sequence is highly recommended for students who intend to apply for a study abroad program in Italy. Prerequisite: ITAL 1 or equivalent course abroad or scoring at level 2 in the SCU placement exam. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Italian for Spanish Speakers II",
      "classCode": "ITAL 2A",
      "description": "This accelerated beginning Italian course, designed for students who are proficient speakers of Spanish, covers in one quarter materials usually taught in Elementary Italian 1 and Elementary Italian 2. A proficiency-based course, emphasizing the development of communicative language skills (understanding, speaking, reading and writing) and understanding of Italian culture. Prerequisites: either one year of college Spanish, or three years of high school Spanish; or be a native or heritage speaker of Spanish; or scoring at level 21 in the SCU Spanish placement exam. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to  Italian Language and Culture III",
      "classCode": "ITAL 3",
      "description": "This course completes the first-year elementary Italian sequence. It emphasizes the development of communicative language skills and cultural competence. This proficiency-based course requires active participation in class. Offered only in Spring. The elementary sequence is highly recommended for students who intend to apply for a study abroad program in Italy. Prerequisite: ITAL 2 or equivalent course abroad or scoring at level 3 in the SCU placement exam. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Italian for Spanish Speakers III",
      "classCode": "ITAL 3A",
      "description": "Continuation of Italian 2A. Designed for students who are already proficient speakers of Spanish, it emphasizes the development of communicative language skills in Italian (understanding, speaking, reading and writing) and understanding of Italian culture. Prerequisites: ITAL 2A; or ITAL 2 paired with proficiency in Spanish: either three years of high school Spanish or one year of college Spanish, or be native or heritage speaker of Spanish. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Italian Language for Engineers",
      "classCode": "ITAL 10EL",
      "description": "This course is designed for Engineering students with no prior experience with Italian, but it is open to all students. It emphasizes the development of communicative language skills, critical and cultural awareness, and commitment to engaged global citizenship through the exploration and discussion of three global issues: gender inequality, immigration and diversity, and sustainability and environmental justice. This course does not satisfy the CORE Second Language Requirement. This course satisfies the Core ELSJ Requirement and it requires participation in community-based learning (CBL) experiences. (4 units).",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Cultures and Ideas: Italy, Gateway of Cultures",
      "classCode": "ITAL 11A",
      "description": "Italy, geographically situated at the crossroads between Europe, Asia, and Africa, has long been considered foundational for an understanding of Western culture. In this course, we will investigate Italy as a syncretic melting pot for modern and contemporary ideas and practices.  In the first of this two-course sequence, we will focus on: the formation of Italy as a nation, ideas of modernity, colonialism, emigration and Fascism.  Course is taught in English and therefore does not satisfy the Core second language requirement. (4 units each quarter)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Cultures and Ideas: Italy, Gateway of Cultures",
      "classCode": "ITAL 12A",
      "description": "Italy, geographically situated at the crossroads between Europe, Asia and Africa, has long been considered foundational for an understanding of Western culture. In this second course we will extend our examination of Italy as a syncretic melting pot for ideas and practices to the present day.  We will explore how late 20th- and 21st-century Italy, though its changing political role and waves of migrations,  has returned to question its relationship to global culture. Course is taught in English and therefore does not satisfy the Core second language requirement.  (4 units each quarter).",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Work-Life Balance in Italy",
      "classCode": "ITAL 21",
      "description": "Italian 21 is an intermediate-level course that focuses on real-life language use, contemporary life in Italy, and the continued development of students’ communicative skills and intercultural competence through authentic multimedia materials. Students will review and expand first-year grammar structures and vocabulary while exploring themes and issues related to emotional, physical, social and career well-being. Offered only in Fall. Course conducted in Italian. Prerequisite: ITAL 3 or the equivalent course abroad, or scoring at level 21 in the SCU placement exam. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Italian Media, Language and Communication",
      "classCode": "ITAL 22",
      "description": "Italian 22 is an intermediate-level course that focuses on real-life language use, contemporary life in Italy, and the continued development of students’ communicative skills and intercultural competence through authentic multimedia materials. Students will review and expand first-year grammar structures and vocabulary while exploring the process and goals of language learning and the role of the media in changing language expression and intercultural communication. Offered only in Winter. Course conducted in Italian. Prerequisite: ITAL 21 or the equivalent course abroad, or scoring at level 22 in the SCU placement exam. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Intermediate Italian Language & Culture",
      "classCode": "ITAL 50",
      "description": "The course reviews first-year grammar while introducing new vocabulary and structures; it emphasizes engagement with authentic materials such as articles, websites, news reports and film excerpts in order to deepen students' communicative skills  and cultural awareness. Prerequisite: Italian 3 or a Placement Test score and recommendation is required. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Italian Studies",
      "classCode": "ITAL 100",
      "description": "This foundational course emphasizes the development of oral communication, cultural literacy, and analytic skills through different genres of cultural expressions, including literary texts. In this course students will gain a deeper insight into Italian language, history, geography, and cultural practices and perspectives. Course conducted in Italian. Required of all majors and minors. Prerequisite: ITAL 22 or equivalent course abroad or scoring at level 100 in the SCU placement exam. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Cultural Analysis",
      "classCode": "ITAL 101",
      "description": "This foundational course is designed to help students prepare for more advanced upper-division courses in Italian Studies. Students will develop cultural literacy, analytic skills, and critical thinking, through the practice of oral and written analysis of literary texts and other cultural expressions. Students will hone their language skills, and learn critical vocabulary and skills that they will primarily apply to close readings of literary texts. Course conducted in Italian. Required of all majors and minors. Prerequisite: ITAL 100 or equivalent course abroad or Placement Test recommendation. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Made in Italy and Italian Entrepreneurship",
      "classCode": "ITAL 102",
      "description": "In this course, students will examine Italian business language, culture, and practices. The course will address topics such as professional communication, branding, localization, entrepreneurship, international migration and labor mobility, and design through the lenses of Made in Italy.Students will develop awareness of the significance, value, and importance of linguistic proficiency and cross-cultural competence in Italian in today’s job market. Classroom work will be complemented with guest speakers, panels, and interaction with Italian businesses and nonprofit organizations. Prerequisite: ITAL 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Italian Food Culture",
      "classCode": "ITAL 103",
      "description": "This course examines the relationship between food and Italian culture. Students will look at food in its social, cultural, and linguistic context from a broad interdisciplinary perspective (history, geography, literature, music, art, cinema, and ethics). This is a foundational course designed to develop students' analytical and critical thinking skills, in addition to language proficiency and intercultural competence.  Active participation in class discussions is expected.  Prerequisite: ITAL 100 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Italian Conversation",
      "classCode": "ITAL 106",
      "description": "Advanced work stressing the development of self-expression in Italian. Prerequisites: ITAL 101 or equivalent, and permission of the instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Translation Workshop",
      "classCode": "ITAL 108",
      "description": "This workshop introduces students to the practice and theory of translation. Students will learn strategies for translating from Italian into English and from English into Italian, understand structural and stylistic differences between the two languages, and explore how translation facilitates cross-cultural communication. Course conducted in Italian. Prerequisite: ITAL 100 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Italian Cinema",
      "classCode": "ITAL 113",
      "description": "This course introduces students to Italian cinema in connection with social and cultural change. It is designed to prepare students to subsequent upper-division courses in Italian Studies. Students will acquire key vocabulary, and develop analytical and critical skills with regard to different film genres including commedia allitaliana, historical productions, and more recent reinterpretations of classic genres by a new generation of Italian filmmakers. Prerequisite: ITAL 101 or equivalent.(5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Contemporary Italian Culture",
      "classCode": "ITAL 114",
      "description": "This foundation course explores cultural issues in contemporary Italy: national identity, economy, family, immigration, and pop culture as reflected in literature, film, music, and media. Class discussions will be conducted in Italian and students will develop language competence and understanding of different language registers. Presentation skills will be practiced through written assignments and oral reports. Prerequisite: ITAL 100 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Italian Literature and Culture I",
      "classCode": "ITAL 120",
      "description": "From its origin to the Seicento. Prerequisite: ITAL 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Italian Literature and Culture II",
      "classCode": "ITAL 121",
      "description": "From the Settecento to the present. Prerequisite: ITAL 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Colloquium: Italian Literature and Culture",
      "classCode": "ITAL 125",
      "description": "Topics vary. Study and discussion of selected themes in Italian literature and culture. May be retaken for credit. Prerequisite: ITAL 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Nature and the Italian Literary Imagination",
      "classCode": "ITAL 154",
      "description": "This course examines ideas and representations of nature in the Italian literary and cultural tradition. It explores the ways in which we imagine human relationship to natural and built environments, and how they shape each other. Interdisciplinary theoretical readings will guide our analysis of Italian representations of nature and spur critical reflections on global issues and Italian specificities. Class discussions will be in Italian. Presentation skills will be practiced through written assignments and oral reports. Prerequisite: ITAL 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Novecento Italian Literature of the 20th Century",
      "classCode": "ITAL 180",
      "description": "Main trends in poetry, drama, and the novel from Pirandello to the present. Prerequisite: ITAL 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "20th-Century Italian Women Writers",
      "classCode": "ITAL 182",
      "description": "Critical analysis of major works by leading women writers and the changing role of women in 20th-century Italian society: Grazia Deledda, Sibilla Aleramo, Elsa Morante, Natalia Ginzburg, Maria Bellonci, Laudomia Bonanni, Lalla Romano, Milena Milani, Francesca Sanvitale, Romana Petri, Isabella Bossi Fedrigotti, and Gina Lagorio. Prerequisite: ITAL 101 or equivalent. Also listed as WGST 185. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Women in Italian Cinema: The Impact of Globalization",
      "classCode": "ITAL 183",
      "description": "Focus is on the films with a global viewpoint of numerous Italian film directors. Examination of Italian masterpieces (including black-and-white films of the 1940s and 1950s) with special focus on the changing aspects of global society and their impact on individuals, especially women. Films by women directors whose work may give a contrasting vision of globalization and its enabling and challenging aspects. Prerequisite: ITAL 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Destination Italy: Immigration in Film and Literature",
      "classCode": "ITAL 187I",
      "description": "A country with a long history of emigration, Italy has, since the 1980s, become a destination for immigrants from all over the world. The Italian cultural landscape is being reshaped by a growing number of engaging literary, filmic, and other cultural works by and about immigrants. We will analyze how writers and filmmakers create new modes of representation that actively engage with issues of marginalization, race, citizenship, labor, gender, and national identity. Course taught in Italian. Prerequisite: ITAL 101 or equivalent. Course fulfills the Civic Engagement Core Curriculum requirement. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Peer Educator in Italian",
      "classCode": "ITAL 194",
      "description": "Peer educators are invited by faculty to work closely with them, facilitating learning in a lower-division course. May be repeated for credit by permission of the instructor. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics",
      "classCode": "ITAL 197",
      "description": "Variable topics in culture, literature, and film. May be retaken for credit. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Study",
      "classCode": "ITAL 198",
      "description": "Individually designed programs of advanced study. Normally restricted to seniors who are declared Italian studies majors or minors and who find themselves in special circumstances. May be taken only once. Courses exempted from challenge may not be taken as directed study. Written course outline must be approved by instructor and department chair in advance of registration. Prerequisite: ITAL 101 or equivalent. (1–3 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Reading",
      "classCode": "ITAL 199",
      "description": "Individually designed programs of advanced readings. For seniors only. Written permission of the instructor and department chair is required in advance of registration. Prerequisite: ITAL 101 or equivalent. (1–5 units) Note: The following courses are literature, film, and culture courses taught in English and cannot be used to fulfill the undergraduate Core Curriculum second language requirement. Only one course may be counted toward the Italian studies minor. Two courses may be counted toward the Italian studies major with permission of advisor.",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Italian American Experience",
      "classCode": "ITAL 185",
      "description": "This course studies the presence of Italian Americans in the United States from their first massive immigration at the end of the 19th century to the present. We will explore how Italians gradually transformed themselves from cultural and political outsiders into integral performers for the development of the United States as a nation. Additionally, by studying how Americans and Italians negotiated different ideas concerning identity, tradition, and community, we will draw attention to contemporary parallels pertaining to the immigration of groups that have threatened or threaten ideas of what it means to be an American citizen in the 21st century. Course counts for Diversity Core and American Studies Pathway. Conducted in English, but contains an Italian component for Italian Studies majors and minors. Prerequisite: None. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Destination Italy: Immigration in Film and Literature",
      "classCode": "ITAL 187",
      "description": "This course explores contemporary immigration to Italy through the lens of film and literature. It analyzes how filmmakers and writers from different backgrounds are creating new modes of representation that actively engage with issues of marginalization, race, citizenship, cultural hybridity, gender and national identity. We will also reflect on Italy's colonial past in Africa, the connections between emigration and immigration, and the effects of Mediterranean crossings and global migrations on the Italian nation today. Prerequisites: NONE. Course is taught in English and DOES NOT satisfy the Second Language requirement. Credit for Italian Major/Minor possible with permission of instructor and Dept. Chair. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Japanese Language and Culture I",
      "classCode": "JAPN 1",
      "description": "This is the first in a series of six basic courses in Japanese language and culture. JAPN 1 is designed for students with no prior experience with Japanese. It aims to develop students’ communicative language skills and intercultural competence through active in-class conversation activities as well as engagement with Japanese culture and perspectives. Offered only in fall. Prerequisite: None. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Japanese Language and Culture II",
      "classCode": "JAPN 2",
      "description": "This is the second in a series of six basic courses in Japanese language and culture. This proficiency-based course aims to develop students’ communicative language skills and intercultural competence further through active in-class conversation activities and engagement with cultural topics. Offered only in winter. Prerequisite: JAPN 1 or placement test recommendation. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Japanese Language and Culture III",
      "classCode": "JAPN 3",
      "description": "This is the third in a series of six basic courses in Japanese language and culture.  This proficiency-based course aims to expand students’ communicative language skills in more varieties of situations and contexts, while developing intercultural competence further. Offered only in spring. Prerequisite: JAPN 2 or placement test recommendation. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Japanese Language and Culture IV",
      "classCode": "JAPN 21",
      "description": "This is the fourth in a series of six basic courses in Japanese language and culture. This proficiency-based course is designed to further develop effective communication skills, both spoken and written, focusing on familiar, everyday topics (e.g., making an appointment by phone, planning a trip, giving and asking for advice), while also improving presentation skills. Students will also cultivate a greater awareness and understanding of Japanese culture to foster interaction at a more functional level. Course conducted predominantly in Japanese in a highly interactive environment. Offered only in fall. Prerequisite: JAPN 3 or placement test recommendation. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Japanese Language and Culture V",
      "classCode": "JAPN 22",
      "description": "This is the fifth in a series of six basic courses in Japanese language and culture. This proficiency-based course is designed to further develop effective communication skills, both spoken and written, focusing on familiar, everyday topics (e.g., communicating in restaurants and stores), while being exposed to some formal language usage. Offered only in winter. Prerequisite: JAPN 21 or placement test recommendation. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Japanese Language and Culture VI",
      "classCode": "JAPN 23",
      "description": "This course completes the two-year basic Japanese language and culture series. It emphasizes socio-culturally appropriate interactions in Japanese, while fostering communication skills in everyday interactions and intercultural competence. Offered only in spring. Prerequisite: JAPN 22 or placement test recommendation. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Oral Communication in Japanese",
      "classCode": "JAPN 100",
      "description": "This course aims to develop proficiency in Japanese language skills (speaking, listening, reading, and writing), and to foster cultural competence and critical thinking skills. Students will learn the oral communication skills necessary to participate in Japanese-speaking communities. Students will also explore a variety of cultural artifacts and media to understand and critically analyze the values, customs, beliefs, and perspectives embedded in Japanese interactions. This course is taught entirely in Japanese. Prerequisite: JAPN 23 or a placement test recommendation for 100-level Japanese UD courses. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Japanese Popular Culture",
      "classCode": "JAPN 101",
      "description": "This course aims to develop proficiency in Japanese language skills (speaking, listening, reading, and writing), and to foster cultural competence and critical thinking skills through the exploration of Japanese popular culture (e.g., manga, anime, songs). Students will explore a variety of cultural artifacts and multi-media to understand and critically analyze the values, customs, beliefs, and perspectives that popular culture brings to Japanese-speaking communities. This course is taught entirely in Japanese. Prerequisite: JAPN 23 or a placement test recommendation for 100-level Japanese UD courses. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Contemporary Japanese Society through Media",
      "classCode": "JAPN 102",
      "description": "This course aims to develop proficiency in Japanese language and students’ understanding of Japanese society through examination of Japanese TV dramas and films that handle contemporary issues in Japan. Students will examine language usage in the media and discuss the societal issues at hand, compare and contrast with the situations in the U.S. and other cultures. This course is taught entirely in Japanese. Prerequisite: JAPN 23 or a placement test recommendation for 100-level Japanese UD courses. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Japanese Culinary Culture",
      "classCode": "JAPN 103",
      "description": "Students will examine Japanese food cultures, and the relationship between food and history, geography, sociology, religion, and globalization. This course aims to develop students’ critical thinking skills and global competence. Through analyzing different media and texts, students will deepen their understanding of contemporary Japanese society through its food cultures, and reflect on their own food cultures. Course conducted in Japanese. Prerequisite: JAPN 100 (or equivalent), or a placement test recommendation for 100-level Japanese UD courses. Course fulfills the C&I 3 Core Curriculum requirement. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Readings in Japanese I",
      "classCode": "JAPN 113",
      "description": "Readings and discussions in Japanese of selected sociological, literary, and journalistic texts. Prerequisite: JAPN 102 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Readings in Japanese II",
      "classCode": "JAPN 114",
      "description": "Continuation of JAPN 113. Prerequisite: JAPN 113 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Readings in Japanese III",
      "classCode": "JAPN 115",
      "description": "Completion of readings in Japanese. Prerequisite: JAPN 114 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Peer Educator in Japanese",
      "classCode": "JAPN 194",
      "description": "Peer educators are invited by faculty to work closely with them, facilitating learning in a lower-division course. May be repeated for credit by permission of the instructor. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Study",
      "classCode": "JAPN 198",
      "description": "Individually designed programs of advanced study. Normally restricted to seniors who are declared Japanese studies minors and who find themselves in special circumstances. May be taken only once. Courses exempted from challenge may not be taken as directed study. Written course outline must be approved by instructor and department chair in advance of registration. (1–3 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Reading",
      "classCode": "JAPN 199",
      "description": "Individually designed programs of advanced readings. Written permission of instructor and department chair required in advance of registration. (1–5 units) Note: The following course is a literature and culture course taught in English and cannot be used to fulfill the undergraduate Core Curriculum second language requirement. One course (5 units) may be counted toward the Japanese studies minor.",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Japanese Culture",
      "classCode": "JAPN 137",
      "description": "This course explores the interaction between Japanese culture and communication in contemporary Japan. Key sociocultural concepts/topics to be examined include: group consciousness, meaning of inner and outer groups, private vs. public stance, politeness, gender, social minorities in Japan, and intercultural communication. Note: Course taught in English and cannot be used to fulfill the University Core Curriculum second language requirement. Course counts toward the Japanese minor. Prerequisite: None. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Elementary Spanish",
      "classCode": "SPAN 1N",
      "description": "Designed for those who have not previously studied Spanish. A proficiency-based course dedicated to developing basic communicative and intercultural skills in preparation for Spanish 1. Emphasis is on: 1) functional language use (speaking, viewing/listening, reading, writing) in simple activities of daily life, and 2) engagement with Hispanic cultures and perspectives. Conducted in level-appropriate Spanish. Prerequisite: Placement survey recommendation to take Spanish 1N required  (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Spanish and Spanish-Speaking Cultures 1",
      "classCode": "SPAN 1",
      "description": "An elementary course designed for those who have had some exposure to Spanish studies in high school. A proficiency-based course dedicated to expanding students’ communicative and intercultural competence. Emphasis is on interaction (speaking, viewing/listening, reading, writing) in authentic contexts related to daily routines, family and social life, and 2) engagement with Hispanic cultures and perspectives. Conducted in level-appropriate Spanish. Prerequisite: placement survey and test recommendation to take Spanish 1, or completion of Spanish 1N at SCU. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Spanish and Spanish-Speaking Cultures 2",
      "classCode": "SPAN 2",
      "description": "An elementary course designed for those who have had some exposure to Spanish studies in high school, and/or SPAN 1. A proficiency-based course dedicated to expanding students’ communicative and intercultural competence. Emphasis is on interaction (speaking, viewing/listening, reading, writing) in authentic contexts related to tasks of daily life, entertainment, customs and traditions, and 2) engagement with Hispanic cultures and perspectives. Conducted in level-appropriate Spanish. Prerequisite: placement survey and test recommendation to take Spanish 2, or completion of Spanish 1 or 1N at SCU. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Spanish and Spanish-Speaking Cultures 3",
      "classCode": "SPAN 3",
      "description": "An elementary course designed for those who have had some exposure to Spanish studies in high school, and/or SPAN 2. A proficiency-based course dedicated to expanding students’ communicative and intercultural competence. Emphasis is on interaction (speaking, viewing/listening, reading, writing) in authentic contexts to complete tasks across a range of topics of social and global importance, and 2) engagement with Hispanic cultures and perspectives. Conducted in level-appropriate Spanish. Prerequisite: Placement survey and test recommendation to take Spanish 3, or completion of Spanish 2 at SCU. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Crossing Boundaries (Intermediate)",
      "classCode": "SPAN 21",
      "description": "This course explores themes and topics related to childhood, family, education and travel both within and between Spanish speaking countries. Through comparison, summarization, and story-telling, students will develop a greater intercultural awareness of the diverse experiences and social classes in different Spanish speaking countries, including the US. This intermediate-level course develops speaking, reading, and writing comprehension and production skills through multimedia and a novel. Course is conducted in Spanish. Prerequisite: Completion of SPAN 3 or Placement recommendation for Intermediate Spanish. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "News and Culture in the Hispanic World (Intermediate)",
      "classCode": "SPAN 21A",
      "description": "What is new and newsworthy in the Spanish-speaking world? Who decides this, and does that process differ between U.S. and Spanish-speaking cultures and societies? In this intermediate-level course with its emphasis on oral interaction and comprehension, students will deepen their knowledge of Hispanic cultures and societies within a project-based framework that focuses on analysis of news media in its many forms. Prerequisite: Completion of SPAN 3 or Placement recommendation for Intermediate Spanish.(4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Intermediate Spanish I. Experiential Learning",
      "classCode": "SPAN 21EL",
      "description": "Progressive readings and exercises in conversation and composition. Development of an understanding of Hispanic culture. All sections of SPAN 21EL contain an integrated Experiential Learning component, using a reflective community-based learning placement. All students enrolled in SPAN 21EL will be automatically enrolled in SPAN 97 (Community-Based Learning Practicum) at the end of the first week of class. Course conducted in Spanish. Prerequisite: Completion of SPAN 3 or placement recommendation for Intermediate Spanish.(4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Latino Cultures and Identities in Contemporary Film (Intermediate)",
      "classCode": "SPAN 22",
      "description": "The course will explore identity in contemporary film from Spanish-speaking countries, looking at immigration, social class, and national identity. What are some of the parallels and contrasts that can be seen across cultures and nations? This intermediate level course will focus on developing oral speaking and comprehension skills as well as academic reading and writing skills. Students will work in all major tenses to discuss and analyze linguistic and cultural nuances using a communicative approach. Course conducted in Spanish. Prerequisite: Completion of SPAN 3 or Placement recommendation for Intermediate Spanish. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Gender, Identity, and Food Cultures in Latin America",
      "classCode": "SPAN 22A",
      "description": "This intermediate-level course is designed to improve students’ conversational and writing abilities in Spanish through a content-based approach focused on the study of food cultures as represented in the documentary series Street Food: Latin America, and other excerpts of novels and articles. We will explore multiple stories of both “fitting the mold” and “breaking the mold” of gender and cultural norms and finding passion in food production,preparation and consumption. The course also aims to equip students with critical tools to understand and evaluate the relationship between food and culture in Latin America at local levels. Students will work in all major tenses to discuss, analyze, express opinions on linguistic and cultural commonality and diversity. Prerequisite: Completion of SPAN 3 or Placement Recommendation for Intermediate Spanish. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Spanish, Technology, & Culture",
      "classCode": "SPAN 22B",
      "description": "New technologies have sparked massive changes all across the globe, transforming the way we live in the present and raising previously unimaginable hopes – and fears – about the future. This course will examine the role that these technologies are playing in shaping the Spanish-speaking world, with particular emphasis on the impact of social media on personal relationships and mental health; the influence of artificial intelligence (AI) on standard of living, and the “digital divide” that limits access to technological developments; and the role of technology in the economic development and exploitation of natural resources in Latin America. This course is conducted in Spanish, and employs a communicative approach with a heavy emphasis on in-class interaction and collaboration among students in order to critically engage with language and culture. Prerequisite: Completion of SCU Spanish 3 or MODLL Placement Test Recommendation for Intermediate Spanish. (4 Units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Immigration Stories: Cultural, Political, and Personal Narratives (Intermediate)",
      "classCode": "SPAN 22EL",
      "description": "This course includes a minimum of 16 hours working with and learning from community partners. All students enrolled in SPAN 22EL will be automatically enrolled in SPAN 97 (Community-Based Learning Practicum) at the end of the first week of class. The course will explore stories of immigration to the U.S. from Mexico and Central America from past and present, using film, literature, and other media. Students will integrate contemplation of cultural, political, and personal factors into written and oral reflections on their community-based learning experiences, and will likewise integrate what they learn from community partners into their contemplation of these issues. This course will also focus on developing speaking and listening comprehension skills as well as academic reading and writing skills. Course conducted in Spanish. Note: This course requires participation in community-based learning (CBL) experiences off campus.  Prerequisite: completion of SPAN 3 at SCU (or equivalent) or SCU Modern Languages & Literatures Department placement recommendation for Intermediate Spanish. NOT open to students who have received a placement recommendation for 100 level Spanish courses, or who have already completed or are currently enrolled in a 100-level Spanish course. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Activism and Social Justice in the Spanish-speaking World (Intermediate)",
      "classCode": "SPAN 23",
      "description": "This course introduces different aspects of the intersection of the arts, activism and social justice in the Spanish-speaking world. Students will explore said topics in numerous Spanish-speaking countries, including the US, to gain a deeper intercultural comprehension of inequality in their own communities and abroad, through communicative and project-based projects, class discussions, and reading and writing assignments. Course is conducted in Spanish. Prerequisite: Completion of SPAN 3 or Placement recommendation for Intermediate Spanish.(4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Experiential Learning (Intermediate)",
      "classCode": "SPAN 23EL",
      "description": "Progressive readings and exercises in conversation and composition. Development of an understanding of Hispanic culture. All sections of SPAN 23EL contain an integrated Experiential Learning component, using a reflective community-based learning placement. All students enrolled in SPAN 23EL will be automatically enrolled in SPAN 97 (Community-Based Learning Practicum) at the end of the first week of class. Course conducted in Spanish. Prerequisite: Completion of SPAN 3 or Placement recommendation for Intermediate Spanish.(4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Community-Based Learning Practicum",
      "classCode": "SPAN 97",
      "description": "For students concurrently enrolled in SPAN 21EL, 22EL, or 23EL, an Experiential Learning for Social Justice component, an integrated, reflective, community-based learning placement. Includes eight weeks of participatory work in a community agency. Requirements: Two hours per week at agency site over course of the placement. (1 unit)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Cultural Analysis in Spanish",
      "classCode": "SPAN 100",
      "description": "Advancement of Spanish-language skills through an introduction to basic conceptual tools to analyze narrative or visual works of art, or other forms of non-fictional discourse in the Spanish language. Practical approach to these works through class discussion, oral presentation, and written essay. Prerequisites: completion of SPAN 23 or the equivalent; or placement recommendation for Spanish 100-110.  (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Discourse and Interpretation: Introduction to Literature and Film Analysis in Spanish",
      "classCode": "SPAN 101",
      "description": "Foundation for more thorough study of works in the Spanish language through the practice of oral and written analysis of literary and filmic works tied together by a common theme.   Prerequisites: Completion of SPAN 23 or the equivalent; or placement recommendation for Spanish 100-110. NOTE: Students who have scored a 5 on the Spanish Advanced Placement Literature test are encouraged to take Spanish 101 instead of Spanish 100. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Discourse and Interpretation: Narratives of Migration",
      "classCode": "SPAN 101M",
      "description": "Foundation for more thorough study of works in the Spanish language through analysis of literary and filmic works tied together by themes of migration and displacement.  Prerequisites: SPAN 23 or the equivalent; or placement recommendation for Spanish 100-110. NOTE: Students who have scored a 5 on the Spanish Advanced Placement Literature test are encouraged to take Spanish 101 instead of Spanish 100.  (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Sounds & Words of Spanish",
      "classCode": "SPAN 102",
      "description": "What is an accent and who has one? Can a second language learner ever sound just like a native speaker? Can you teach someone to roll their R’s? This course offers an introduction to the sound system of Spanish from the perspective of linguistic science, which will help you answer these questions and more. We will explore how Spanish sounds are produced and perceived by native speakers, how Spanish learners can improve their pronunciation of the language, how the pronunciation of Spanish varies across different geographic and social varieties, and how these sounds combine with others in systematic ways to form Spanish words. By studying the relationship between sounds and words, students can also improve their comprehension of written and spoken Spanish. This course is conducted in Spanish. Prerequisites: completion of Spanish 23 (or equivalent) OR SCU Modern Languages & Literatures Department placement recommendation for Spanish 100-110.  (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Structure of Spanish Words and Phrases",
      "classCode": "SPAN 103",
      "description": "What’s the difference between a phrase and a sentence?  Why don't native speakers always use the imperfect or the subjunctive or ser and estar according to the same rules you learned in Spanish classes? This linguistics course will help you answer these questions and more. We will explore how Spanish speakers create and manipulate meaning through word and sentence structures, and how these structures vary across different geographic and social varieties. By studying Spanish from this linguistic perspective, students will improve their grammatical acumen, their comprehension of both spoken and written Spanish, and their writing abilities. Prerequisites: completion of at least one course in Spanish 21 - 23 at  SCU (or equivalent) OR SCU Modern Languages & Literatures Department placement recommendation for Spanish 100-110. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Spanish for Business",
      "classCode": "SPAN 106B",
      "description": "What are the various political, social, and economic contexts of business practices in the Spanish-speaking world? How do issues around identity, race, and socioeconomic status influence these practices? What does it mean to engage in “intercultural communication” and what effect does this dynamic have on international business? Students will collaborate to critically engage with these issues, and to advance their own linguistic and intercultural development in Spanish. In addition to analyzing current issues relating to business practice in the Spanish-speaking world, students will prepare their own professional materials in Spanish, including a mock business plan proposal.  Prerequisites: completion of Spanish 23 (or equivalent) OR SCU Modern Languages & Literatures Department placement recommendation for Spanish 100-110. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Spanish for International Relations",
      "classCode": "SPAN 106I",
      "description": "This is a learner-centered course in which students have the opportunity to build the cultural, political, and linguistic competence required to communicate appropriately and effectively in Spanish in the context of international relations. The content of the course comprises three main areas of study: Latin America’s process of democratization, dictatorships in the Southern Cone of Latin America, and the negotiation of the peace agreement in Colombia signed in 2016, among other “dis/agreements” that involve international dialogue. The course includes written and oral pedagogical materials including reports from international organizations, news articles, and films. Assessment includes debates, presentations, written reflections, exams, and a learner’s portfolio.Prerequisites: completion of Spanish 23 (or equivalent) OR SCU Modern Languages & Literatures Department placement recommendation for Spanish 100-110. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Writing Workshop",
      "classCode": "SPAN 107",
      "description": "Development of proficiency in written Spanish through a collaborative workshop.  Focus on close reading, complex sentence construction, structure and disposition of arguments through practical exercises and peer review. Prerequisites: completion of Spanish 23 (or equivalent) OR SCU Modern Languages & Literatures Department placement recommendation for Spanish 100-110. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Art of Narrative Nonfiction: Creative Writing Workshop",
      "classCode": "SPAN 108",
      "description": "This is a foundational course focusing on creative writing in Spanish narrative nonfiction, especially journalism and memoir. We will learn through readings and creative writing assignments about all aspects of nonfiction narrative writing, including structure, language, character development, scene development, storyline, plot, rhythm, description, and, ultimately, how to develop a sophisticated argument in narrative form. Readings will be in Spanish, focusing on the best narrative journalism from and about the Spanish-speaking world. The course will build toward a final project in which students will write their own work of narrative journalism or memoir. Prerequisite: completion of Spanish 23 (or equivalent) OR SCU Modern Languages & Literatures Department placement recommendation for Spanish 100-110. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Oral Communication in Spanish",
      "classCode": "SPAN 110",
      "description": "This course introduces students to various forms of oral interaction in their cultural contexts. Emphasis is placed on learning to employ the linguistic features (words, phrases, intonation, gestures) of Spanish necessary to function and actively participate in Spanish-speaking communities. Through analysis of native-speaker interactions and active practice, students will learn how to initiate, manage and close conversations, negotiate (e.g. with a landlord), tell a joke, give a compelling speech, etc. Students will also engage with cultural topics through readings, film, videos, other media, and discussion. Course activities include pair and group conversations, role-plays, vlogs and podcasts, etc. All students will be required to carry-out conversation activities with native Spanish-speakers outside of class hours. This course is conducted in Spanish. Prerequisites: completion of Spanish 23 (or equivalent) OR SCU Modern Languages & Literatures Department placement recommendation for Spanish 100-110.  (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Mexican Culture",
      "classCode": "SPAN 112",
      "description": "Although Mexico is a neighboring country, bordering California itself, its image in America is profoundly deformed and simplified. Through a selection of readings and films, the course offers an introductory review of Mexican history, contemporary social and political developments, and fine arts and music, with particular attention to cultural values. Most readings in Spanish, films in Spanish with English subtitles. Prerequisite: SPAN 100 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Revolution in Mexican Culture",
      "classCode": "SPAN 113",
      "description": "The Mexican Revolution (1910-1940) was a foundational event in that nation’s history. Both a political and social revolution, it sought to fundamentally reshape the Mexican social order through land and education reform, the protection of workers’ rights, the nationalization of resources, and the championing of peasant and indigenous communities. Though the Constitution of 1917, one of its most important legacies, was one of the first national documents in the world to enshrine both political and socio-economic rights, the Revolution only partially achieved its lofty goals. In this course, we will examine the works of Mexican authors, artists, and filmmakers who reflect on the Revolution’s triumphs and its failings, as well as its lasting repercussions in contemporary Mexican society. Prerequisite: Spanish 101, or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Culture and Society of the U.S-Mexico Border",
      "classCode": "SPAN 114",
      "description": "A study of social and cultural aspects of the U.S.-Mexico border. This course discusses topics such as labor, environmental, immigration, and women’s issues, but with attention also to current discourse on the border in cultural critique and the arts. By the end of the course, students will be expected to have developed a more coherent and sophisticated view of the border region than that generally purported by commercial media outlets. Prerequisite: SPAN 100 or equivalent. Recommended prerequisite: SPAN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Contemporary Spanish Culture",
      "classCode": "SPAN 123",
      "description": "In this course we will utilize a multi-disciplinary approach grounded in cultural studies to consider the evolving expression of overarching themes such as migration, gender, and class in an effort to better understand modern Spanish society. We will focus initially on the sociopolitical context of the Spanish Civil War (1936-39), the subsequent Franco dictatorship, and the Transition to democracy that began upon Franco’s death in 1975. We will then consider questions of gender, migration, and nationalisms in recent decades. We will analyze a variety of texts, including short stories, poetry, architecture, visual art, and contemporary films.   Prerequisite: Completion of at least one upper-division course in Spanish, level 100-110 (SPAN 100, 101, 101C, or 101M recommended) or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Colloquium: Spanish Literature and Culture",
      "classCode": "SPAN 125",
      "description": "Topics vary. Study and discussion of selected themes in Spanish Peninsular literature and culture. May be retaken for credit. Prerequisite: SPAN 101 or equivalent.  (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Survey of Latin American Literature I",
      "classCode": "SPAN 130",
      "description": "Latin American literature from the pre-Columbian period to 1888. Prerequisite: SPAN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Survey of Latin American Literature II",
      "classCode": "SPAN 131",
      "description": "This course is an upper-division level survey of major works of contemporary Latin American poetry and narratives, including figures such as Roberto Bolaño, Rigoberta Menchú, Gabriel García Márquez, Mario Vargas Llosa, Jorge Luis Borges, Gabriela Mistral, Alfonsina Storni, among others. The class will be conducted in Spanish. Prerequisite: SPAN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Hispanic Voices for Social Change",
      "classCode": "SPAN 132",
      "description": "This course examines coherent strategies of resistance and adaptation that respond to experiences of social injustice, inequality, and geographic displacement throughout the 20th- and 21st-centuries in the Spanish-speaking world. Through the analysis of short fiction, poetry, film, testimonio, and critical texts, the course explores four principal historical events: the Spanish Civil War, the Guatemalan indigenous genocide, the effects of neoliberal capitalism on U.S.-Mexico relations, and Argentina’s Dirty War.   Prerequisite: Completion of at least one upper-division course in Spanish, level 100-110 (SPAN 100, 101, 101C, or 101M recommended) or permission of instructor.  (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Mexican American Literature",
      "classCode": "SPAN 133",
      "description": "Reading, analysis, and discussion of Mexican American literature in its historical context. Emphasis on the novel and short story. Also listed as ETHN 128. Prerequisite: SPAN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Colloquium: Latin American Literature and Culture",
      "classCode": "SPAN 135",
      "description": "Topics vary. Reading and discussion of selected themes in Latin American literature and culture. May be retaken for credit. Prerequisite: SPAN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Contemporary Latin American Short Story",
      "classCode": "SPAN 136",
      "description": "Examination of the Latin American short story from Quiroga to the present. Representative works reflecting the diverse cultural backgrounds and ideologies of the authors. Prerequisite: SPAN 100 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Latin American Cultures and Civilizations",
      "classCode": "SPAN 137",
      "description": "Exploration of factors and conditions that have molded and continue to shape the diverse lives and institutions of contemporary Spanish-speaking peoples of the Americas. Prerequisite: SPAN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Hispanic Poetry",
      "classCode": "SPAN 138",
      "description": "An introduction to poetic expression in the Spanish language. The course will involve an overview of Spanish meter and rhyme followed by the study of classical forms (love, mystical, and satirical poetry), as well as contemporary periods and forms (Romanticism, modernismo, the Vanguards, revolutionary, and experiential poetry). Prerequisite: SPAN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Haunted Literature: Ghosts and the Talking Dead in Latin American Narrative",
      "classCode": "SPAN 139",
      "description": "Ghosts hauntings and the talking dead are recurrent tropes in the Latin American cultural imagination. Through a selection of fiction and critical writings, this course will examine the recurrence and significance of this imagery in contemporary narrative genres. Discussions may include the following writers and directors: María Luisa Bombal, Juan Rulfo, Julio Cortázar, Gioconda Belli, Tomás Eloy Martínez, Guillermo del Toro, and Alejandro González Iñárritu. Prerequisites: SPAN 101 or the equivalent and at least one survey course in Latin American literature. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Narratives of Money",
      "classCode": "SPAN 140",
      "description": "Study of literature, film, and other cultural expressions in Spanish with a focus on financial issues and their impact on Latin American and Spanish societies and cultures.  The course may explore a variety of topics connected to money and material exchanges, such as debt, precarity, extractive economies, labor, or inequality. Prerequisites: SPAN 101 or any other course with a focus on literary analysis, or permission of the instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Narconarrativa",
      "classCode": "SPAN 142",
      "description": "By most estimates, the wave of violence that has assailed Mexico since then-president Felipe Calderón launched the war on drug trafficking in 2006 has claimed nearly 200,000 lives. This seemingly pervasive brutality has precipitated its aesthetic representation across a wide range of genres and discourses, including journalism, literature, music, and the visual arts. Principal among these cultural productions is a subgenre of crime novel known as the narconovela. In this course we will examine how narconarrativa presents the drug trade between the U.S. and Mexico and analyze its literary and cinematic representations, considering both their limitations and function as social critique. Course prerequisite is SPAN 101, or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Detective Short Story",
      "classCode": "SPAN 143",
      "description": "Detective fiction is considered by many as mere escapist entertainment. However, as we will discover in this course, it can contain a subtle yet mordant denunciation of social injustice. This is especially true in societal conditions that preclude an open discussion of institutional abuses, as was the case in the dictatorial and post-dictatorial states of Ibero-America in the second-half of the 20th century. In more recent decades, the detective story can be read as a commentary on the social inequality that characterizes modern society. In this class we will read a selection of short stories from various sub-genres of detective fiction and analyze how each of these texts serves as social critique.  Prerequisite: SPAN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Latin American Documentary",
      "classCode": "SPAN 146",
      "description": "Students will become aware of contemporary social and political issues in Latin America through a selection of recent and thought-provoking documentary films.  The course aims to stimulate cultural competence as well as critical thinking in Spanish by exposing students to relevant matters in the target cultures.  Prerequisite: SPAN 100 or the equivalent.  (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Cinema, Politics, and Society in Latin America",
      "classCode": "SPAN 147",
      "description": "The course aims to introduce the students to current political and social issues in Latin America through exposition to and discussion of some relevant commercial or independent films of recent decades. Textbook material and additional readings from journalistic, literary, or academic contexts will further expand on the themes exposed in each film. Prerequisite: SPAN 100 or the equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "20th-Century Latin American Women Writers",
      "classCode": "SPAN 148",
      "description": "Reading, analysis, and discussion of novels and short fiction by major Latin American women writers of the 20th century (e.g., Bombal, Garro, Poniatowska, Allende, Valenzuela, and others). Prerequisite: SPAN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Politics of Gender, Migration & Memory: Exploring Contemp Spain Through the Graphic Novel, Art & Film",
      "classCode": "SPAN 152",
      "description": "This course presents 1) why the graphic novel is such an important medium for communication in today’s world, while considering its borrowings and influences upon other genres, and 2) how Spanish art, graphic novel, and film represent trauma, gender, and migration through the 20th century to the present, including periods of political and social transition, such as the Spanish Civil War, Francisco Franco’s dictatorship, and the democratic Transition in 1975. Prerequisite: Spanish 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Representations of the Migrant Condition in Contemporary Spain",
      "classCode": "SPAN 156",
      "description": "In this course we will explore themes related to exile, immigration, racism, gender, identity, nationalism, and citizenship in 20th- and 21st-century Spain. We will analyze a variety of cultural productions (short story, testimony, novel, film, and critical texts) created about and by migrants. In these texts, we will consider guiding questions that include: Who are “we” and who are “others”? What identities are typically cast as normative and which as marginal? What dichotomies become manifest in the narrative or filmic expressions of those identities that comprise present-day Spain? Do bicultural identities exist in contemporary Spain? Prerequisite: SPAN 101 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Cervantes: Don Quijote",
      "classCode": "SPAN 165",
      "description": "Cervantes’ masterpiece, as a reflection of Spanish society during the Spanish Empire, an exemplar of Baroque art, and a synthesis and culmination of narrative prose. Prerequisite: SPAN 101 or equivalent.(5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Spanish & the Community",
      "classCode": "SPAN 170",
      "description": "Conducted in Spanish, this course fulfills the Core ELSJ requirement. It integrates classroom and community engagement to learn about the strengths of a local Hispanic community, examine issues of social justice most relevant there, and advance your language and cultural competence and analytic skills. Includes a minimum of 16 hours working with and learning from community partners. In class, we analyze academic, journalistic, and social media texts related to course topics (e.g. language and immigration, disparities in health and education, etc.), engage in structured reflection about your experiences, and build language and cultural skills to communicate appropriately and effectively in both the community and academic settings. Prerequisite:Completion of at least one Spanish course in the 100 and 110 series (102 or 103 preferrable) and who intend to pursue a Spanish major or minor. Priority is given to those who have not yet completed their ELSJ requirement. Non-Spanish majors or minors may request permission to enter the course from the professor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "History of the Spanish Language",
      "classCode": "SPAN 175",
      "description": "A study of the evolution of the Spanish language from its roots on the Iberian Peninsula to its spread throughout the world. From a linguistic perspective. Special attention will be paid to social and political factors that have helped to shape the language in its modern forms. Prerequisite: Completion of one upper-division course in Spanish. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Spanish and Latinxs in the United States",
      "classCode": "SPAN 176",
      "description": "We will examine the major topics associated with Spanish and Latinxs in the United States: regional and social variation, the linguistic and sociolinguistic consequences of contact with English, Spanish language maintenance, bilingual education, the teaching of Spanish to heritage speakers, language ideologies, and the relationship between language and identity for U.S. Latinxs. An overarching theme is linguistic discrimination as a proxy for racial discrimination. Taught in Spanish. Prerequisite: Completion of one upper-division course in Spanish (Span 102 or 103 recommended).(5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Bilingualism: Mind and Context",
      "classCode": "SPAN 177",
      "description": "Who are bilinguals, nonnative speakers, and second language users? How do bilingual children acquire the words of their two (or more!) languages? What can parents do to make it more likely that their children will grow up bilingual? In an attempt to address these questions, this course explores bilingualism as both a societal and cognitive phenomenon. It focuses on how bilinguals learn and use their languages in different situations, with particular emphasis in Spanish–English bilingual populations. The course also explores how society can contribute to, or hinder, bilingualism. This course may be of particular interest to students who plan to work with bilingual populations in their professional career (e.g., bilingual teachers, interpreters, speech pathologists, etc.) and to those who would like to pursue graduate studies in fields such as psychology, linguistics, or education. This course is taught in Spanish. Prerequisites: Completion of one upper-division course in Spanish (SPAN 102 or 103 recommended). (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Peer Educator in Spanish",
      "classCode": "SPAN 194",
      "description": "Peer educators are invited by faculty to work closely with them, facilitating learning in a lower-division course. May be repeated for credit by permission of the instructor. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Spanish Translation I",
      "classCode": "SPAN 195",
      "description": "Skills and strategies involved in the art of translation. A variety of texts (general, historical, cultural, technical, etc.) illustrate the different modes and nuances of translation. Students assigned special translation projects. May be retaken for credit but will only be accepted once toward the Spanish studies major or minor. Prerequisites: SPAN 101 and permission of the instructor.  (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics",
      "classCode": "SPAN 197",
      "description": "Variable topics in specific fields. Studies abroad. (Units vary based on program)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Study",
      "classCode": "SPAN 198",
      "description": "Individually designed programs of advanced study. Normally restricted to seniors who are declared Spanish studies majors or minors and who find themselves in special circumstances. May be taken only once. Courses exempted from challenge may not be taken as directed study. Written course outline must be approved by instructor and department chair in advance of registration. (1–3 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Reading",
      "classCode": "SPAN 199",
      "description": "Individually designed programs of advanced readings. Prerequisite: Written permission of the instructor and department chair is required in advance of registration. (1–5 units) Note: Knowledge of a foreign language is not necessary for the following courses. They cannot be used to fulfill a major or minor requirement in a foreign language or to fulfill the second language requirement.",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Mexican Culture",
      "classCode": "SPAN 112EN",
      "description": "This course will help students develop an in-depth knowledge of Mexican culture from Pre-Columbian times to the 21st century. The course will adopt an interdisciplinary approach for the examination of Mexican cultural production. We will study materials from diverse origins, including literature, history, anthropology, art, and film. The class will focus on the relationship between race, gender, and multiculturalism, and the effects that these three elements have in Mexican culture. In addition to learning specifically about Mexican culture, this course will also help students expand their global competence and critical thinking, as well as their appreciation of sociocultural diversity. Language of instruction: This course will be conducted in English. Prerequisites: None. (5 units).",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "International Cinema",
      "classCode": "MLAC 180",
      "description": "An interdisciplinary course treating film as a medium of cultural expression in China, England (or Australia or Canada), France, Germany, Italy, Japan, Latin America, Russia, and Spain. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    }
  ]