[
    {
      "courseName": "11A. and 12A. Cultures & Ideas I and II",
      "classCode": "ARTH 11A",
      "description": "A two-course sequence focusing on a major theme in human experience and culture over a significant period of time. Courses emphasize either broad global interconnections or the construction of Western culture in its global context. Courses may address China on the Silk Roads, Venice: Crossroads of the World, and other topics. Successful completion of ARTH 11A: C&I I is a prerequisite for ARTH 12A: C&I II. (4 units each quarter)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "11A. and 12A. Cultures & Ideas I and II",
      "classCode": "ARTH 12A",
      "description": "A two-course sequence focusing on a major theme in human experience and culture over a significant period of time. Courses emphasize either broad global interconnections or the construction of Western culture in its global context. Courses may address China on the Silk Roads, Venice: Crossroads of the World, and other topics. Successful completion of ARTH 11A: C&I I is a prerequisite for ARTH 12A: C&I II. (4 units each quarter)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Sport, Spectacle, and Spirituality: A Survey of Mediterranean Culture from Antiquity to the Middle Ages",
      "classCode": "ARTH 21",
      "description": "A foundation course for the art history program focusing on visual analysis and the ancient and medieval world. Topics may include the relationship between Greek art and politics, Imperial Roman art, propaganda, Pompeian wall painting, early Christian art, the origins of Islam, and the function and culture of pilgrimage in the Middle Ages. Not open to students who have taken Art, Power, and Propaganda. Also listed as CLAS 52. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Reframing the Renaissance: A Survey of Early Modern Visual Culture",
      "classCode": "ARTH 22",
      "description": "This survey course focuses on the construction and representation of identity in European visual culture from approximately 1348 to 1648. This examination of Renaissance art, especially painting, offers insights into changing ideas about the body, race, gender, and geography as manifested in the works of luminaries such as Michelangelo, Raphael, Dürer, and Caravaggio. Our inquiry into early modern European art will focus on depictions of identity and difference and will be accompanied by contemporary scholarship on race, gender, religion, and class. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Art and Revolution: Europe and the United States, 18th–20th Centuries",
      "classCode": "ARTH 23",
      "description": "Introduction to the visual culture of modern Europe and the United States from Louis XIV to the present. Explore the origins of modern art through political, technological, and artistic revolutions, from royal patronage to Pop, Neoclassicism to Neo-dada, as well as Impressionism, Surrealism, and Abstract Expressionism. Fulfills the Studio Art program modern or contemporary emphasis course requirement. Not open to students who have taken Art, Trade, and Cultural Exchange (ARTH 11A). (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "From Damascus to Dubai: A Survey of the Visual Culture of the Middle East",
      "classCode": "ARTH 24",
      "description": "From the majesty of the Dome of the Rock in Jerusalem to the awe-inspiring heights of the Abu Dubai skyline, few regions boast a history of ambitious art and architecture as long, and as impressive, as the Middle East. Yet, this region is likewise one of the most misunderstood. This survey course focuses on the rich and diverse visual culture of the region from the 7th century CE to the present day. Topics for discussion include early mosque architecture, scientific developments in medieval Baghdad, the rise of the Ottoman Empire, the garden city of Isfahan, European colonialism in North Africa, and contemporary art and architecture. Fulfills the Studio Art program global emphasis course requirement. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Indigenous Visions: Introduction to the Arts of the Americas",
      "classCode": "ARTH 25",
      "description": "Introduction to the indigenous arts and architecture of North, South, and Central America from prehistory to the present including the Olmec, Aztec, Inca, Native American Great Plains, and Southwest. Themes include indigenous concepts of time and space; the vision quest; warfare and blood sacrifice; art and the sacred. Lecture and discussion, plus a visit to a local museum. Fulfills the Studio Art program global emphasis course requirement. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Art! Making China Modern",
      "classCode": "ARTH 26",
      "description": "On the long march from dynastic regime to global power, art made China modern on its own terms. In the 19th century writers, politicians, and revolutionaries looked to Japan and Europe to learn how art could renovate the nation. After WWI, leftists weaponized woodcuts and folk arts to combat the forces of Japan and the U.S.-backed Nationalists. At the dawn of the People’s Republic, art reorganized society and fueled radical conformity. As China globalized, artists cashed in on burgeoning markets, grappled with legacies, sounded alarms about oppression, and questioned “The Chinese Dream.” Fulfills the Studio Art program global emphasis course requirement. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Modern Indian Art",
      "classCode": "ARTH 28",
      "description": "This course will take you through a survey of modern Indian art from the 19th to the 20th centuries. We will see how Indian artists engaged with and responded to modernity and the modernisms they encountered in the global art world, while working through late-colonial, post-independence and contemporary Indian contexts. Early modern artists of the Bengal School of art grappled with the question of how to be modern and Indian in their search for an Indian-ness devoid of Western elements, while post-independence artists of the Progressive Artists Group could freely work with both Western modernism and Indian idioms toward self-expression. We will see how this trajectory moves into contemporary art and contextualizes feminism by reading about the works of women artists from varied backgrounds. Fulfills the Studio Art program global emphasis course requirement. Formerly ARTH 81. Not open to students who have taken ARTH 81. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Fabricating Nature in East Asia",
      "classCode": "ARTH 66",
      "description": "Across East Asia, artists and designers have fabricated landscapes to marshal natural forces for human-centered purposes. In China, visualizing Confucian and Daoist principles through paintings and gardens ordered society and cultivated individuals. In Korea, artists interpreted imported religions and philosophies through indigenous beliefs, giving birth to True View painting and seowon rural campuses. Japan’s native Shintō steered Buddhism in new directions, culminating in Zen and roji tea gardens. Today, these religions, philosophies, aesthetics, and practices remain vigorous, exerting themselves in art and landscape design worldwide, offering solutions to environmental challenges, and alternatives to the isolation of modern life. Fulfills the Studio Art program global emphasis course requirement. Also listed as RSOC 66. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics",
      "classCode": "ARTH 97",
      "description": "Occasional courses in selected art historical topics. May be repeated for credit. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Internship/Practicum",
      "classCode": "ARTH 98",
      "description": "Individual projects in conjunction with professional visual arts agencies. May be repeated for credit but no more than 4 units may count toward the major or minor. Prerequisite: Written proposal must be approved by on-site supervisor, art history faculty member, and department chair. (2–4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Art History Proseminar",
      "classCode": "ARTH 100",
      "description": "“What is the history of art history? What does it mean to think like an art historian?” To answer these questions, we will examine the origins of the discipline and its current methodologies. Close textual analysis with writing and discussion. Required of all art history majors, preferably at the end of sophomore year. Prerequisites: Two art history courses, one of which must be upper-division, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Greek Art and Architecture",
      "classCode": "ARTH 104",
      "description": "Examination of Greek art from the Archaic through the Hellenistic periods. Developments in architecture, sculpture, vase painting, and wall painting will be addressed in their cultural context. Cross-listed as CLAS 116. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Art and Architecture of the Roman Republic and the Early Empire",
      "classCode": "ARTH 106",
      "description": "Chronological survey of artistic development in Republican and Imperial Rome. Related issues include the influence of Greek and Etruscan art, the relationship between political ideology and public art programs, and the impact of improved materials on building design. Cross-listed as CLAS 117. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "From Catacombs to Crusade: European Visual Culture, 350-1350",
      "classCode": "ARTH 114",
      "description": "Topics discussed in their respective political, intellectual, and cultural contexts may include Christian art and architecture from the catacombs in Rome through the early 14th century in Byzantium; art and architecture in Western Europe from the early Middle Ages to circa AD 1300; Hiberno-Saxon, Carolingian, and Ottonian art; classical and religious codices; manuscript illumination from the Anglo-Saxon, Carolingian, Ottonian, Romanesque, Gothic, or Byzantine eras. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Keeping up with the Medici: Fame and Family in Renaissance Florence",
      "classCode": "ARTH 120",
      "description": "What makes someone a “household name”? Is it talent, beauty, connections, or simply shrewd marketing? While fame, fortune, and celebrity may seem like modern phenomena, the cult of personality was equally prominent in Renaissance Florence. As is the case today, money played a key role in the arts. This course focuses on the ways in which the Medici family, through their social, financial, and spiritual support, transformed the city of Florence from an Italian commune with limited natural resources into the center of European culture. And in doing so, transformed the notion of the artist from that of mere craftsman to superstar. Additional topics of discussion include the influence of the capitalist economies on artistic production, domestic art, perceptions of the nude figure in religious paintings, the relationship between art and science, and the writings of Machiavelli. Fulfills the departmental Advanced Writing requirement. Cross-listed as HIST 125. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Venice: The Sinking City",
      "classCode": "ARTH 121",
      "description": "This course focuses on the art and culture of the city of Venice from the 18th century through the Jazz Age, the period in which the city transformed from a mighty maritime power to a tourist mecca. Identified by visitors as libertine, luxury loving, and ultimately indulgent, the city's cafes and casinos attracted a \"who's who\" of writers, artists, and musicians. Inquiry into the city will be considered within the context of ongoing efforts to preserve one of the world’s most unique built environments. Fulfills the departmental Advanced Writing requirement. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Global Renaissance",
      "classCode": "ARTH 123",
      "description": "The “Renaissance” has traditionally been viewed as a period of artistic and cultural development associated almost exclusively with the Italian peninsula in the 15th and 16th century. This same tradition privileges “high art”—that is, painting, sculpture, and architecture over other forms of visual culture. This course seeks to reassess these notions by considering Italian Renaissance art within the context of early modern globalism. This reexamination likewise mandates a consideration of a broader spectrum of objects, including gemstones, glassware, and textiles. Topics such as the relationship between Michelangelo, Leonardo, and the Ottoman architect Sinan, the collection of Aztec feather paintings by the Medici family, and the influence of Egyptian mosque architecture on Venetian palace design will be examined from an interdisciplinary perspective. Fulfills the departmental Advanced Writing requirement. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "European Art: 1780–1940",
      "classCode": "ARTH 135",
      "description": "Analysis of the culture and art of Europe from the era of the French Revolution to World War II. This course will address the relationship between politics and art, shifting class structures, and the increasing importance of the industrial revolution. Painting, sculpture, architecture, photography, and other media will be covered. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Photography in the United States",
      "classCode": "ARTH 140",
      "description": "We live in a world densely populated by photographs; how did that come about and what purposes has photography served in the U.S.? We will examine the social, political, and aesthetic aspects of American photography from its inception in the 1830s to the present. Close readings of objects yield insights into the creation and growth of popular and elite audiences for photography; journalistic, ethnographic, and documentary photography; photography as an artistic medium; the role of photography in discourses of race, gender, class and nationalism; and photography in relation to modernism, postmodernism, and consumer culture. Fulfills the Studio Art program modern or contemporary emphasis course requirement. Prerequisite: one ARTH course or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Women’s Work: American Women in the Visual Arts",
      "classCode": "ARTH 143",
      "description": "From colonial times to the ongoing feminist revolution of the present, American women made, sold, collected, and supported visual art, and in so doing profoundly influenced the development of the nation’s culture, art, and art institutions. Students will learn about the roles of American women in the visual arts and the active interplay between issues embedded in art and in “craft”; women’s self-fashioning and the art market; images of women; and the impact of women’s studies and feminism on the study of the visual arts. Close readings of images and objects spanning traditional and nontraditional media such as painting, sculpture, photography, embroidery, and quilting produce insights into the dynamic relationships between gender and art, culture, and commerce in American history. Fulfills the Studio Art program modern or contemporary emphasis course requirement. Also listed as WGST 156. Prerequisite: one ARTH course or one WGST course or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Race, Gender, and Nation in 18th- and 19th-Century American Art and Visual Culture",
      "classCode": "ARTH 144",
      "description": "What did visual and material arts from the Colonial period to the Gilded Age (1880s) look like and how did they function in colonial society and help to shape a new, fast-growing nation? Close readings of objects illuminate the relationships between art, gender, and race; self-fashioning and social identity in portraiture; the “West as America”; American national identity at home and abroad; landscape painting; photography; representations of democracy, politics, and citizenship; representations of the Revolutionary and Civil Wars; collectors and the creation of art institutions; and an audience and market for art in the United States. Fulfills the Studio Art program modern or contemporary emphasis course requirement. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Perpetual Revolution: American Art in the 20th Century",
      "classCode": "ARTH 145",
      "description": "The 20th century was a period of turmoil and growing international stature for the United States and its art. How did artists deal with these events including two World Wars; the Great Depression, the growth of labor unions, the Civil Rights Movement, feminist reforms, etc.; and the encounter with European modernist art? How were these events in turn shaped by art and visual culture? Close readings of objects illuminate the relationship of American modern art to European modernism; race and gender in American society, politics, and American national identity; patrons and dealers, including those of the Harlem Renaissance; the government as a patron for the visual arts; and the founding of major visual arts institutions and the solidifying of an art audience in the United States. Fulfills the Studio Art program modern or contemporary emphasis course requirement. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "African American Art",
      "classCode": "ARTH 146",
      "description": "A survey of African-American art from the 18th to the 21st century. With an emphasis on case studies and movements throughout this history, this course explores how Black artists in the United States have engaged with key issues such as race, gender, sexuality, class, and ethnicity. The course is designed to expose students to complex debates about representation and the role of race and identity in American art. Fulfills the Studio Art program modern or contemporary emphasis course requirement. Also listed as ETHN 132A. (5 units).",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "American Art: Special Topics",
      "classCode": "ARTH 147",
      "description": "Sustained analysis of a particular period, genre, or issue in American Art: e.g., landscape painting, Harlem Renaissance, art market and art dealers, social realism, material culture, etc. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Arts of Ancient Mexico: From Olmec to Aztec",
      "classCode": "ARTH 152",
      "description": "Survey of the arts of the Mesoamerican region, from 1500 BCE to the conquest of 1521 CE. Focus on Mesoamerican concepts of time and space, the ritual calendar, warfare, blood sacrifice, shamanism, and the ballgame. Fulfills the Studio Art program global emphasis course requirement. Formerly ARTH 151. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Tradition and Change in Native American Art: California and the Pacific Northwest",
      "classCode": "ARTH 153",
      "description": "Visual culture of the native peoples of California and the Pacific Northwest, from prehistory to the present. Emphasis on the role of the artist in society and on artistic responses to political and cultural change. Topics include arts of status, shamanism, World Renewal, missions, tourism, and the rise of the art market. Formerly ARTH 141. Not open to students who have taken ARTH 141. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Native American Art: Special Topics",
      "classCode": "ARTH 154",
      "description": "Sustained analysis of a specific time period or genre of Native American art. Emphasis on 20th-century/contemporary art. Topics may include tourism/market forces, land and cultural preservation, postcolonialism, and gender identity. Research paper will be required. Formerly ARTH 142. Not open to students who have taken ARTH 142. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Islamic Art in the Age of Empire",
      "classCode": "ARTH 165",
      "description": "This course focuses on the visual culture created in the so-called \"Gunpowder Empires,\" that is, the Ottoman, Mughal, and Safavid empires from approximately 1450-1700 CE.  At times interdependent, at times adversarial, but always in direct exchange with one another, these Islamic states controlled over one-third of the early modern globe.  Yet, with the notable exception of the Taj Mahal, the visual culture associated with these empires remains marginalized.  This course seeks to re-center the vast artistic and cultural production of the region. Thematically organized, the course will investigate the function of the urban centers of Istanbul (Turkey), Isfahan (Iran), and Fatehpur Sikri (India), the development of the global trade of luxury objects - including gemstones, ivory, and manuscripts; the development of leisure spaces, such as coffee houses and public gardens, as well a consideration of decorative arts including intarsia, tilework, and textiles. Fulfills the departmental Advanced Writing requirement.  (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "From Emaki to Manga",
      "classCode": "ARTH 166",
      "description": "For over a millennium, Japanese artists used pictorial narratives to circulate ideas and explore emotions. Buddhist biographies inspired devotion, while emaki handscrolls explored romantic longings hidden beneath courtly protocols. Explicit and grotesque visions of hell admonished men and women for separate sins. As Japan modernized, prints and manga celebrated urbanism and imperialism, and bore witness to atrocities. Inherent in these ancient and contemporary narratives are changing concepts of gender as artists have negotiated and challenged the dynamics between male and female authors and subjects, as well as universal themes and indigenous aesthetics. Fulfills the Studio Art program global emphasis course requirement. Prerequisite: Completion of CTW2 or permission of instructor.  (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Cityscapes, Past and Present",
      "classCode": "ARTH 167",
      "description": "Investigate the life cycles of cities in East Asia. Ancient capitals centralized realms, and later metropolises celebrated internationalism and stimulated the senses. Coastal cities sprang up under European colonialism, while 20th century capitals of Beijing and Tokyo modernized their respective nations and ascended the global stage by hosting the Olympics. Today's emergence of the \"megapolis\" calls into question the viability of cities even as \"green cities\" promise a sustainable future. From choosing a site to planning, from architecture to sensory experience, cities are where past and present co-exist and collide. Fulfills the Studio Art Program global emphasis course requirement. Prerequisite: Completion of CTW2 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Animated Spaces: The Hindu Temple and its Global Forms",
      "classCode": "ARTH 181",
      "description": "This course will introduce prominent examples of Hindu temples built in the Indian subcontinent as well as few contemporary temples built outside India, specifically in the United States. You will study individual examples (from around 6th century CE until the present) in terms of their art, architecture, political patronage, and time period, and learn to think critically about the dominant frameworks that represent Hindu temples. This course will teach you to identify key components of a Hindu temple across regions and over time. However, a significant focus will be on the meanings sustained by temple images, structures, and spatial layouts; their changing uses in varied contexts, and by multiple communities of response. Fulfills the Studio Art program global emphasis course requirement. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Post-Modern and Contemporary Art",
      "classCode": "ARTH 185",
      "description": "An overview of significant issues and movements in art since the 1960s. Primary focus on art in the United States. Themes to be addressed: artist in nature, body in performance, new media, feminism, gender and sexuality, art in public places, censorship, art and public activism, emergence of a global arts community. Fulfills the Studio Art program modern or contemporary emphasis course requirement. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Peer Educator in Art History",
      "classCode": "ARTH 194",
      "description": "Peer educators in art history work closely with a faculty member to help individual students prepare for exams, conduct research, and master course content. Prerequisite: permission of instructor. (1–2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Art History Thesis",
      "classCode": "ARTH 195",
      "description": "Students with a GPA of 3.5 or better in their major may petition to write a thesis, typically in their senior year. The thesis will be based on a research paper written for a previous upper-division course with the same instructor. Prerequisites: senior standing, demonstrated excellence in the major field, and permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Senior Art History Capstone Seminar",
      "classCode": "ARTH 196",
      "description": "Advanced research in art history. Research theme of the seminar will vary with instructor. Requirements may include a museum project or lengthy research paper and public presentation of that research. Course should be taken in the senior year. Course restricted to Art History majors. Prerequisite: Senior standing or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics",
      "classCode": "ARTH 197",
      "description": "Occasional courses in selected art historical topics. May be repeated for credit. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Internship/Practicum",
      "classCode": "ARTH 198",
      "description": "Individual projects in conjunction with professional visual arts agencies. May be repeated for credit but no more than 4 units may count toward the major or minor. Prerequisite: Written proposal must be approved by on-site supervisor, art history faculty member, and department chair. (2–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Reading/Directed Research",
      "classCode": "ARTH 199",
      "description": "Individual guided reading, research, and/or writing on selected art historical topics. May be repeated for credit but no more than 5 units may count toward the major or minor. Prerequisites: Course outline, reading list, and schedule of instructor/student meetings must be approved by an art history faculty member and department chair 10 days prior to registration. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Basic Drawing",
      "classCode": "ARTS 30",
      "description": "Using traditional drawing techniques, this course covers the use of line and contour, light and shadow, three-dimensional perspective, and composition. Includes the concept of self-expression in traditional and contemporary drawing practices. Recommended as a foundation course to be taken prior to other studio art courses. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Two-Dimensional Design",
      "classCode": "ARTS 32",
      "description": "This hands-on course introduces the fundamental theories and applications of two-dimensional design, essential to a wide range of art forms. The focus is on experimentation with compositional dynamics and elements of design including line, shape, value, color, texture, direction; and principles of design such as balance, proportion, unity, rhythm, and emphasis. Conceptual strategies, techniques, and a variety of materials are explored through lectures, demonstrations, studio assignments, and critiques. Recommended as a foundation course to be taken prior to other studio art courses. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Sculpture Fundamentals",
      "classCode": "ARTS 33",
      "description": "This is a foundation course in sculpture. Creating various hands-on projects, students will explore the elements of three-dimensional design: space, line, plane, mass/volume, value, texture, and color. They will also explore the principles of three-dimensional design: harmony, contrast/variety, rhythm/repetition, emphasis, continuity, balance, and proportion.  Conceptual strategies, techniques, and a variety of materials are explored through lectures, demonstrations, studio assignments, and critiques. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Graphic Arts: Printmaking",
      "classCode": "ARTS 35",
      "description": "Fundamentals of printmaking as an art form, with an emphasis on graphic processes including photo-based imagery, carved and drawn designs, and stencil. Using a range of technologies, from hand cranked presses to the computer, students will create a portfolio of original works of art. Previous experience in drawing or photography recommended. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ditto! The Technology of Print",
      "classCode": "ARTS 36",
      "description": "From pre-Gutenberg to 3D printing, this course traces the impact of printing technologies in art and industry. Taught using a combination of lecture, discussion, field trips, and hands-on art practices, students will create portfolio projects using printing methods studied in class. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Painterly Printmaking",
      "classCode": "ARTS 37",
      "description": "Fundamentals of printmaking as an art form with an emphasis on the painterly processes, including lithography, monotype, and silk collagraph “mezzotint.” Using a range of painterly mark-making techniques, students will create a portfolio of original works of art. Previous experience in drawing or painting recommended. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Basic Painting",
      "classCode": "ARTS 43",
      "description": "Introduction to painting, primarily with water-based acrylic paints. Through guided projects, students will develop a language of lines, shapes, colors, and composition to express their ideas visually. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Basic Outdoor Painting—Landscapes I",
      "classCode": "ARTS 45",
      "description": "Be creative outdoors, in a classroom without walls. Expand your creativity by learning essential techniques and theories of painting the landscape en plein air (in open air), from detailed observation to intuitive abstraction. Course accommodates both beginning and intermediate levels. ARTS 30 recommended. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Basic Watercolor",
      "classCode": "ARTS 46",
      "description": "Introduction to visual expression in the classic medium of transparent watercolor. Assignments will emphasize basic elements of shape, color, light, shadow, composition, and developing command of the medium. Previous experience in drawing recommended. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Basic Mixed Media",
      "classCode": "ARTS 48",
      "description": "Mixed media is an exploration into image making beyond painting. Paint may be involved but the course will cover collage, assemblage, found objects, and combining different media to create unique results. Prior experience in painting, drawing, or sculpture is highly recommended. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Film and Darkroom Photography",
      "classCode": "ARTS 50",
      "description": "This course is for beginning level photography students interested in learning the fundamentals of black-and-white photography as an art form. Students will learn basic film camera operation, film development, and darkroom printing techniques. Assignments will stimulate visual awareness and individual creativity. A 35 mm film camera with manual shutter speeds and aperture capabilities is suggested. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Digital Photography",
      "classCode": "ARTS 57",
      "description": "For beginning level photography students who want to develop creativity, composition, lighting, and other techniques with their digital cameras. Camera function and features will be discussed. Photographic projects will be edited and enhanced in Adobe Lightroom. Basic use of Adobe Photoshop will be introduced. Students must provide a digital camera with manual shutter speeds and aperture capabilities. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Basic Ceramic Sculpture",
      "classCode": "ARTS 63",
      "description": "Fundamentals of visual expression in clay, primarily through making ceramic sculpture. Especially suitable for the lower-division student. Guided exploration of various hand-building techniques and materials, including firing and glazing. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Basic Sculpture",
      "classCode": "ARTS 64",
      "description": "Fundamentals of making art in three-dimensional form, especially suitable for the beginning sculpture student. Creative exploration of selected materials and techniques. Reductive, manipulative, mold making, and additive methods will be used as needed. Media varies each quarter at instructor’s discretion. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Site-Specific Art",
      "classCode": "ARTS 66",
      "description": "An investigation into creating site-specific landscape art. Learn site analysis, material selection, and fabrication, and understand the specific issues and problems entailed in creating site-specific art. Topics/location/media vary from year to year. Course may include collaboration with one or more community sites. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Graphic Design: Typography",
      "classCode": "ARTS 70",
      "description": "As the keystone to graphic design, typography is the method and practice of arranging type for successful communication and visual impact. Explore the uniqueness and expression of typography; individual characteristics of the letterform; visual hierarchy in page layouts through ideation, selection, and application to the visual problem solving. Analyze a variety of published materials, typefaces, and complete a series of introductory graphic design projects. Prerequisite: ARTS 74 or permission of instructor. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Digital Art and Design Basics",
      "classCode": "ARTS 72",
      "description": "Taught using a combination of lecture, discussion, and hands-on digital arts practices, this course explores two-dimensional design elements (including line, shape, color, value, texture, space, etc.) and principles (such as balance, proportion, unity, rhythm, and emphasis). Projects focus on design experimentation using a broad range of digital imaging tools. Class presentations provide an overview of the computer technologies that contribute to current art and design practices. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Basic Digital Imaging",
      "classCode": "ARTS 74",
      "description": "Hands-on introduction to computer imaging for the beginning level student. Fundamental instruction in raster- and vector-based imaging software to manipulate photographs and create original imagery. Students will explore fine art and commercial uses of digital media. Recommended as a foundation course to be taken prior to other computer art courses. Access to the Adobe Creative Cloud, including Photoshop and Illustrator, will be provided by the College of Arts and Sciences. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Brand Identity: Basic Graphic Design",
      "classCode": "ARTS 75",
      "description": "Introduces the ideation tool and the process of design research. Defines the role of corporate identity in business practice and its use. Examines the fundamental theories and techniques necessary to accomplish graphic design objectives. Concepts involved in the problem-solving process draw heavily from ideas in fine arts, social sciences, and humanities. Prerequisite: ARTS 74 or permission of instructor. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics",
      "classCode": "ARTS 97",
      "description": "Occasional courses in selected Studio Art topics. May be repeated for credit. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Studio Art Seminar",
      "classCode": "ARTS 100",
      "description": "Exploration of and preparation for primarily academic postgraduate options in studio art. Includes portfolio and presentation development; artist statements and résumé writing; photographing artwork; and field trips to studios of artists, designers, and graduate schools. Required for studio art majors. Must be taken in junior year. Formerly ARTS 196A. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Life Drawing",
      "classCode": "ARTS 131",
      "description": "Theory and practice of figure drawing. Emphasis on understanding the anatomy of the human form as a resource for visual expression. May be repeated twice for credit. Prerequisite: ARTS 30 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Intermediate Drawing",
      "classCode": "ARTS 133",
      "description": "Continuation of ARTS 30. Emphasis is placed on refining drawing technique, incorporating more complex processes and materials, and developing a personal style. May be repeated twice for credit. Prerequisite: ARTS 30 or 131 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Intermediate Printmaking",
      "classCode": "ARTS 135",
      "description": "This class builds upon the printmaking skills developed in either ARTS 35 or ARTS 37. Emphasis is placed on developing a personal style and proficiency in various printmaking techniques, including relief, intaglio, and planographic methods. Conceptual content and meaning will be explored in depth, through practice and discussion. May be repeated twice for credit. Prerequisite: ARTS 35 or 37 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Slow Tech: Critical Making with the Letterpress",
      "classCode": "ARTS 138",
      "description": "Join the slow tech movement! Use your hands and eye in mindful ways to create hand-pulled editions on SCU’s 100-year-old letterpress. Gears whirl and type clicks into place as students explore concepts of close reading, critical making, and graphic design through field trips, guest speakers and hands-on activities that challenge our dependence on all things digital. This course culminates in a portfolio of hand-made student work that engages in a critical global conversation about our perceived “need for (digital) speed.” Cross-listed with ENGL 116. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Intermediate Painting",
      "classCode": "ARTS 143",
      "description": "This class builds upon the painting skills developed in Basic Painting (ARTS 43). Emphasis is placed on developing a personal style through long term projects. May be repeated twice for credit. Prerequisite: ARTS 43 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Painting",
      "classCode": "ARTS 144",
      "description": "Designed for the intermediate- to advanced-level painting student. Assignments help students develop conceptual and formal strategies to create a series of related works that revolve around each student’s individual artistic interests. Painting form and technique, as well as conceptual content and meaning, will be explored in depth, through practice and discussion. May be repeated twice for credit. Prerequisite: ARTS 43 or 143 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Outdoor Painting—Landscapes II",
      "classCode": "ARTS 145",
      "description": "Be creative outdoors, in a classroom without walls. Expand your creativity by learning essential techniques and theories of painting the landscape en plein air (in open air), from detailed observation to intuitive abstraction. Course accommodates both beginning and intermediate levels. May be repeated twice for credit. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Watercolor II",
      "classCode": "ARTS 146",
      "description": "A continuation of the skills acquired in Basic Watercolor (ARTS 46) with the emphasis on development of a personal approach to the medium. May be repeated twice for credit. Prerequisite: ARTS 43 or 46 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Mixed Media II",
      "classCode": "ARTS 148",
      "description": "A continuation of skills learned in Basic Mixed Media (ARTS 48). Mixed media is an exploration into image making beyond painting. Paint may be involved but the course will cover collage, assemblage, found objects and combining different media to create unique results. Prior experience in painting, drawing or sculpture is highly recommended. May be repeated twice for credit. Prerequisite: ARTS 48 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Intermediate Film Photography",
      "classCode": "ARTS 150",
      "description": "The art and craft of black-and-white photography beyond the basic level. Covers the use of fiber-based papers and archival print processing in the darkroom. Students will also learn basic studio lighting techniques. Includes discussion of photography as it relates to contemporary fine art theory and practice. May be repeated twice for credit. Prerequisite: ARTS 50. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Exploring Society through Photography",
      "classCode": "ARTS 151",
      "description": "This course is for the intermediate-level photography student interested in exploring social issues and ethics in photography. With an emphasis on portrait photography, students will engage and photograph individuals in our community, creating photo-based projects. It may be repeated twice for credit. Note: This course requires participation in off-campus community-based learning experience fulfilling the Experiential Learning for Social Justice Core requirement. Students should have a digital SLR camera capable of shooting in RAW format. Prerequisite: one course from ARTS 50, 57,150,157, or permission of the instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Photography in the Community",
      "classCode": "ARTS 155",
      "description": "This course is for the intermediate photography student interested in engaging with middle school-aged students, teaching the fundamentals of photography, and working with middle schoolers to produce individual self-published books that share stories about their lives. In addition, students will gain an understanding of basic ethics in photography by producing photography projects that enrich our community. This course requires participation in community-based learning experiences off campus, fulfilling the Experiential Learning for Social Justice Core requirement. Students should have a digital SLR camera capable of shooting in RAW format and access to a laptop.  May be repeated twice for credit. Prerequisites: one course from ARTS 50, 57, 150, 151, 157, or permission of the instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Photography and Alternative Processes",
      "classCode": "ARTS 156",
      "description": "the vernacular and learning historical methods of making photographs; you will learn the art of hand coloring silver prints, non-silver dry-plate processes such as Cyanotypes, Vandyke, and/or Gum Bichromate. May be repeated twice for credit. Prerequisite: one course from ARTS 50, 57, 150, 157, or permission of the instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Intermediate Digital Photography",
      "classCode": "ARTS 157",
      "description": "This course will provide all the skills necessary to develop fine art photographic inkjet prints from digital files. With an emphasis on photographic project development, students will learn intermediate techniques in digital capture and processing using Adobe Photoshop, and Adobe Lightroom CC. Students should have a digital SLR camera capable of shooting in RAW format. May be repeated twice for credit. Prerequisite: ARTS 57. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Digital Photography",
      "classCode": "ARTS 158",
      "description": "Designed for advanced-level exploration for photography students. Assignments enable students to develop conceptual and formal strategies to build a fine arts photography portfolio. Emphasis on enhancing forms and techniques attained in previous coursework. Students should have a digital camera capable of shooting in RAW format. Students must have regular access to a computer capable of running Adobe Photoshop and Adobe illustrator. Access to the Adobe software will be provided by the College of Arts and Sciences during remote learning. May be repeated twice for credit. Prerequisite: ARTS 57. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Digital Storytelling Through the Visual Arts",
      "classCode": "ARTS 159",
      "description": "This course will explore how the human experience can be communicated effectively through the use of media such as photography, video, and augmented reality. Stories will be created by collaborating with participants from a partnering Arrupe institution. Virtual Reality headsets will be utilized to enhance the viewer’s experience. Prerequisite: one course from ARTS 50, 57, 150, or 157. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Intermediate Ceramics",
      "classCode": "ARTS 163",
      "description": "Continuation and extension of ARTS 63. Intermediate-level exploration of ceramic sculpture through various hand building techniques including firing and glazing. May be repeated twice for credit. Prerequisite: ARTS 63 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Intermediate Sculpture",
      "classCode": "ARTS 164",
      "description": "Intermediate-level exploration of selected materials and techniques. Reductive, manipulative, mold making, and additive methods will be used as needed. Media varies each quarter at instructor’s discretion. May be repeated twice for credit. Prerequisite: ARTS 33 or 64 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Ceramics",
      "classCode": "ARTS 165",
      "description": "Suitable for the intermediate and advanced student. In-depth exploration of various hand-building techniques for creating ceramic sculpture and related work. Includes discussion of aesthetic issues in contemporary ceramic art. Emphasis will be on the development of each student’s artistic and technical interests and abilities toward the goal of creating a coherent body of work. May be repeated twice for credit. Prerequisite: ARTS 163 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Sculpture",
      "classCode": "ARTS 166",
      "description": "Advanced-level exploration of selected materials and techniques. Emphasis on developing individual expression in three-dimensional media, grounded in an appropriate conceptual framework. Media varies each quarter at instructor’s discretion. May be repeated twice for credit. Prerequisite: ARTS 164 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Graphic Design: Advanced Topics in Typography and Publication Design",
      "classCode": "ARTS 170",
      "description": "Designed for the intermediate-to advanced-level graphic design student. Assignments help students develop conceptual and formal strategies to create a series of related works that center around each student’s individual artistic interests. The course focuses on developing the skills and critical thinking necessary for producing digital typefaces and publication design.  Prerequisite: ARTS 70 or permission of instructor. ARTS 32 recommended. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Printmaking with a Digital Toolbox",
      "classCode": "ARTS 171",
      "description": "Advanced projects in digital printmaking. Students generate their designs using imaging software, then create hand-pulled prints using traditional printmaking methods such as stencil, intaglio, lithography, and relief. Prerequisite: one course from ARTS 35, 37, 74, 135, 174, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to 3D Animation & Modeling/Modeling & Control Rigid Body Dynamics",
      "classCode": "ARTS 173",
      "description": "Introduce experimental 3D methods with a focus on conceptual and creative processes. Mathematical and physical principles of motion of rigid bodies, including movement, acceleration, inertia, and collision. Modeling of rigid body dynamics for three-dimensional graphic simulation; controlling the motion of rigid bodies in robotic applications. May be repeated twice for credit. Open to majors or by permission of the instructor. Also listed as COEN 165. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Intermediate Digital Imaging",
      "classCode": "ARTS 174",
      "description": "Continuation and extension of ARTS 74. Students create intermediate-level, original digital artwork through comprehensive assignments using raster- and vector-based software. Projects focus on conceptual and stylistic development, as well as refinement of digital imaging techniques. Prerequisite: ARTS 74 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Information Design: Graphic Design",
      "classCode": "ARTS 175",
      "description": "This course will explore the relationship between visual design and the field of information visualization. It presents strategies for designing effective visual communications, while seeking to articulate a vocabulary of data design. Course work will provide students with an understanding of structuring and presenting information with an emphasis on meaning, clear communication, and visual aesthetics.  Prerequisite: ARTS 74 or 174 orARTS 75 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Digital Imaging",
      "classCode": "ARTS 176",
      "description": "Designed for the intermediate- to advanced-level digital imaging student. Assignments help students develop conceptual and formal strategies to create a series of related works that center around each student’s individual artistic interests. Raster- and vector-based imaging techniques, as well as conceptual content and meaning, will be explored in depth through practice and discussion. Prerequisite: ARTS 174 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Website Graphic Design",
      "classCode": "ARTS 177",
      "description": "This course takes a designer’s approach to learning front-end web design, by combining design and code. Students will learn how to create visually appealing, well-organized web pages using HTML and CSS. Familiarity with the basics of HTML and CSS is the required skill set for a graphic design student. This course will investigate visual Gestalt principles by exploring the application of typography, visual hierarchy, grids, etc., and how they affect the functionality of a website. Prerequisite: one course from ARTS 74, 75, 174, 175, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Web and UX/UI Design: Advanced Graphic Design",
      "classCode": "ARTS 178",
      "description": "In-depth exploration of graphic design through advanced projects. Examines advanced understanding of the industry standard languages of HTML and CSS as paired with a basic understanding of JavaScript and JavaScript libraries. A designer’s approach to learning front-end web development. Guides students to a place where they can comfortably create dynamic user experiences. Students will complete projects that allow them to gain hands-on experience in all phases of interface design and evaluation. May be repeated twice for credit. Prerequisite: ARTS 177 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Two-Dimensional Animation",
      "classCode": "ARTS 179",
      "description": "In-depth exploration of two-dimensional animation and digital storytelling. Student projects may include storyboards, flipbooks, and vector/raster-based animation. May be repeated twice for credit. Prerequisite: ARTS 74 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Portfolio Design: Advanced Graphic Design Production",
      "classCode": "ARTS 180",
      "description": "Students develop and refine a body of design work that constitutes a professional graphic design portfolio. The preparation of a professional portfolio is an essential part of transitioning from graphic design student to working designer. The course assignments will give students guidance in improving their current student portfolio pieces, developing new portfolio pieces, and presenting their work, and themselves, to prospective employers in a compelling way. Prerequisite: one course from ARTS 170, 175, 178, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Senior Portfolio Production",
      "classCode": "ARTS 190",
      "description": "This is a production course designed to advance students toward the senior capstone exhibition, while cultivating their ability to plan and execute a body of works that are conceptually and/or thematically interrelated. Students plan and produce a unique body of work, a portion of which will be selected to appear in the Senior Capstone Exhibition the following spring. Students meet regularly with faculty. In the process of producing finished work that synthesizes and showcases their conceptual and technical achievements as well as their unique creative vision, students participate in individual and group critiques. Must be taken in the fall of senior year. Prerequisite: studio art major, senior standing, and ARTS 100 (5 units).",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Peer Educator in Studio Art",
      "classCode": "ARTS 194",
      "description": "Peer educators in studio art work closely with a faculty member to help individual students in studio arts courses with the proper use of tools and materials, as well as mastering course content. Peer educators will encourage students in their creative work in both individual and collaborative activities. Prerequisite: permission of instructor. (1–2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Capstone Senior Exhibit",
      "classCode": "ARTS 196",
      "description": "Senior studio art majors will sign up for this course with an assigned studio faculty member. The faculty member will advise and direct the student through final stages of artwork production, presentation preparation, and the installation process for their senior exhibit. Students will work directly with the instructor to design and edit their exhibits. Grading considerations include production work, quality of the exhibited artwork, quality of the presentation (display, hanging, etc.), professional conduct, and the associated artist statement. Required for studio art majors. Must be taken during the consecutive winter and spring quarters of senior year. Prerequisite: ARTS 100 and 190. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Projects",
      "classCode": "ARTS 197",
      "description": "Occasional upper-division courses in selected studio arts topics. Open to majors or by permission of instructor. May be repeated for credit. Prerequisite will vary depending on the course topic. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Internship/Practicum",
      "classCode": "ARTS 198",
      "description": "Individual projects in conjunction with a professional visual arts organization or professional work environment with a visual arts emphasis. May be repeated twice for credit. Prerequisite: Written proposal must be approved by supervisory studio art faculty member and department chair. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Research/Creative Project",
      "classCode": "ARTS 199",
      "description": "Individual, guided, advanced-level projects in studio art. May be repeated for credit, but no more than 5 units will count toward the major. Prerequisite: Course outline and schedule of instructor/student meetings must be approved by studio art faculty member and department chair 10 days prior to registration. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    }
  ]