[
    {
      "courseName": "Transformations of Energy and Matter L&L",
      "classCode": "BIOL 1A",
      "description": "How do organisms obtain elements from their environment, change them to suit their growth needs, and acquire the energy necessary to sustain life? How do changing environments impact organisms and ecosystems? Students will explore the global cycle of critical elements and dissect the chemical reactions that incorporate these elements into biological molecules and new biological structures. They will discuss the implications of nutrient availability on growth of a variety of organisms and on interacting populations in an ecosystem. Core to this class is the exploration of the habits of mind that will form the basis of critical scientific thinking throughout the biology curriculum including collaborative learning, data interpretation, and communication. Laboratory 15 hours. Prerequisite: CHEM 11. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Information and Evolution L&L",
      "classCode": "BIOL 1B",
      "description": "This course builds an introductory understanding of how information is transmitted and utilized in biological systems. Students will investigate how the genetic transmission of information at the molecular, organismal, and population level generates biodiversity and drives evolution. In their studies, students will continue to practice the habits of mind necessary to critically evaluate data and communicate with the greater scientific community. Laboratory 15 hours. Prerequisites: completion of BIOL 1A with a C- or better, and concurrent enrollment in or completion of CHEM 31 . (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Systems L&L",
      "classCode": "BIOL 1C",
      "description": "All biological phenomena are complex networks whose components comprise molecules, cells, organs, organisms, and ecosystems. The stability of these networks is maintained by important feedback and feedforward regulations but  alterations affecting one of the components could affect the entire network. In this course, students will model biological systems (e.g., cellular signaling pathways, organismal body plans, human diseases, endangered natural habitats) in order to predict how they will respond and adapt to changes in components and environmental conditions. Students will also apply the process of science to collect, analyze, and interpret data across biological scales and communicate with the greater scientific community. Laboratory 30 hours. Prerequisites: completion of BIOL 1B with a C- or better and completion of CHEM 31. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Human Biology L&L",
      "classCode": "BIOL 2",
      "description": "This course will provide an overview of the biology of the human body. Students will explore the normal function of major organ systems at the physiological, cellular and molecular levels. We will discuss topics such as chronic and infectious diseases, immunity, nutrition, genetics, fitness, reproduction and inheritance. Laboratory 15 hours. Does not satisfy the requirements of the biology major. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Fitness Physiology L&L",
      "classCode": "BIOL 3",
      "description": "Although many people rarely engage in vigorous exercise, as a species we evolved to perform prolonged, strenuous activity. This course surveys how exercise promotes a state of wellness and explores both the immediate responses to exercise as well as how the body responds to long-term training programs. In addition to learning basic human physiology, at the end of the course students should be able to critique and design experiments, understand and interpret reports of health and exercise news in the popular press, critically evaluate fitness claims made by advertisers, and recognize quackery. Laboratory 15 hours. Does not satisfy the requirements of the biology major. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Endangered Ecosystems L&L",
      "classCode": "BIOL 5",
      "description": "An overview of earth’s ecosystems and the major factors contributing to the loss of biodiversity. Three major themes are explored: (1) general ecological principles, especially focused on the structure and function of ecosystems; (2) factors contributing to the endangerment of ecosystems; and (3) the conservation of ecosystems and biodiversity. This course discusses global environmental problems, and includes several lectures highlighting current environmental and conservation issues here in California and within the San Francisco Bay Area. Laboratory 15 hours. Saturday field trips are required. Does not satisfy the requirements of the biology major. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Oceans L&L",
      "classCode": "BIOL 6",
      "description": "This course examines major ocean ecosystems and their inhabitants, with special attention paid to issues of governmental policy, sustainability, and human impacts on marine ecosystems. Laboratory and field activities will emphasize hands-on exploration of local marine habitats. Laboratory 15 hours. Saturday field trips are required. Does not satisfy the requirements of the biology major. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Exploring Animal Behavior L&L",
      "classCode": "BIOL 7",
      "description": "A survey of modern scientific approaches that seek to understand why animals do what they do in nature, with a particular emphasis on evolutionary questions using case studies as models. Covers methods for posing and for testing hypotheses, data analysis and interpretation, and hands-on work with live animals in the laboratory and/or field settings. Laboratory: 15 hours. Does not satisfy the requirements of the biology major. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Microbes and Humanity L&L",
      "classCode": "BIOL 8",
      "description": "The microbial world constantly surrounds and permeates humanity, and affects people in far more ways than “just” a global pandemic. This course introduces basic concepts of microbiology, explores harmful and helpful interactions between people and microbes in our everyday lives, and critically examines the impact of infectious diseases in medicine and public health. Laboratory experiments will use tools from clinical and food microbiology to illustrate and encourage scientific exploration. Laboratory: 15 hours. Does not satisfy the requirements of the biology major. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Big Ideas in Biology",
      "classCode": "BIOL 10",
      "description": "Students in this course will explore foundational ideas that are at the root of many biological phenomena. In addition, students will discuss strategies for exploring their own curiosity, connect their learning in non-biology courses to their interests in biology, and discuss the vast arrays of career opportunities that individuals with a background in biology can pursue. Bring your curiosity, your lived experience, your questions and let’s explore together. Does not satisfy the requirements of the biology major. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Exploring Biotechnology L&L",
      "classCode": "BIOL 18",
      "description": "Have you ever wondered about the science behind CSI, “Frankenfoods,” human cloning, or how biofuels might help combat global warming? This course will examine the science underlying biotechnology: how DNA, genes, and cells work, and how they can be used in new technologies that affect many areas of our lives, including medical diagnosis and treatment, forensics, agriculture, and energy. We will discuss current developments in biotechnology and also examine the controversies and ethical considerations that accompany them. Laboratory experiments will focus on hypothesis testing and experimental design, and include detecting antibiotic-resistant bacteria, modeling the spread of diseases, performing human genetic testing, and testing common foods for genetic modification. Laboratory 15 hours. Does not satisfy the requirements of the biology major. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Biology Research Seminar",
      "classCode": "BIOL 101",
      "description": "A forum for the exploration of research in the life sciences. Invited scientists from a range of universities, institutes, and the private sector present their current research, and engage in discussion about this research with seminar participants. This course is intended to give students direct interactions with research academics in a range of fields to make them aware of career opportunities and to provide them with contacts in those fields. Graded P/NP only. Prerequisite: successful completion of BIOL 1C. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Human Anatomy L&L",
      "classCode": "BIOL 104",
      "description": "The human body is an incredible achievement of a multitude of different organs working together to promote life.  These organs come in many different shapes, sizes, and structures, and are composed of different tissues, which reflect their specialized roles and functions.  In this course, we will take a tour of the anatomical regions of the body, learning the names, locations, and features of the organs (bones, muscles, nervous system, blood vessels, etc.) and how they are arranged so that they may fulfill their functions.  Lab activities will include microanatomy (histology), organ dissections, and the use of models to reinforce the anatomical relationships learned in lecture. Laboratory 30 hours. Prerequisite: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Biology of Human Nutrition and Metabolism",
      "classCode": "BIOL 105",
      "description": "This course focuses both on how the body processes food and on how the resulting nutrients affect human physiology. The course will also explore such topics as the biological basis of eating disorders, ideal body weight, nutritional supplements, and the influence of nutrition on athletic performance. Prerequisite: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Health Consequences of a Western Lifestyle",
      "classCode": "BIOL 106",
      "description": "This course explores the impact of living in a developed country on human health. Topics such as diabetes, obesity, heart disease, hypertension, and cancer will be discussed at the molecular, cellular, physiological, and population levels. Also listed as PHSC 124. Prerequisite: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Genetics and Society",
      "classCode": "BIOL 109",
      "description": "Upper-division course designed for non-science majors interested in exploring the interplay between the social, scientific, and technological dimensions of human genetics. In addition to studying the nature of DNA (the genetic material), students will study the social and technological dimensions of current topics in genetics, including the Human Genome Project, paternity testing, crime scene investigation, embryo testing to select specific genotypes, personalized medicine, evolution, etc. Does not satisfy the requirements of the biology major. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Genetics L&L",
      "classCode": "BIOL 110",
      "description": "Basic principles governing inheritance and gene expression in viruses, prokaryotes, and eukaryotes. Emphasis on molecular aspects. Laboratory 30 hours. Prerequisites: BIOL 1C and CHEM 31. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Zoonoses and Emerging Infectious Diseases",
      "classCode": "BIOL 111",
      "description": "Zoonoses (diseases transmitted from animals to humans), emerging, and re-emerging infectious diseases increasingly threaten health security worldwide. This course focuses on their etiologies, epidemiology, prevention, diagnostic and treatment strategies; and how human behaviors and societal trends contribute to their rise. Prerequisite: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Immunology L&L",
      "classCode": "BIOL 112",
      "description": "Principles, mechanisms, and techniques of humoral and cellular aspects of the immune response. Immediate and delayed hypersensitivity, tissue transplantation, tumor immunology, and immunodeficient states in humans. Laboratory 30 hours. Prerequisite: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Microbiology L&L",
      "classCode": "BIOL 113",
      "description": "An introduction to the biology of microorganisms, with emphasis on the molecular and cellular biology of bacteria, the diversity of microbial life, and the roles of microorganisms in human health and disease. Laboratory 30 hours. Prerequisite: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Writing in Cell Biology L&L",
      "classCode": "BIOL 114AW",
      "description": "In this course, students integrate scientific information literacy, scientific writing, and cell biological concepts. The laboratory component of the course is designed to guide the development of narrative writing skills, critical editing, and revision skills to express complex ideas clearly and completely. Laboratory 30 hours. Prerequisites: BIOL 1C and CHEM 31. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Human Reproduction and Development L&L",
      "classCode": "BIOL 115",
      "description": "Detailed study of the development and function of the male and female reproductive systems, gametogenesis, fertilization and implantation, and the anatomy of the heart, circulatory, nervous, and skeletal systems during embryogenesis. Where appropriate, the molecular mechanisms controlling the determination of these developing systems will be examined. Laboratory 30 hours. Prerequisites: BIOL 1C and CHEM 31. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Medical Microbiology L&L",
      "classCode": "BIOL 116",
      "description": "This course focuses on the interactions of pathogenic microbes (bacteria, viruses, fungi, prions, etc.) with their hosts. The various strategies employed by the infectious agents to subvert the immune system and the various strategies used by the immune system to combat the microbial invasion will be examined, as will the co-evolution of hosts and their pathogens and the natural history of diseases. The laboratory component will expose students to clinical methodologies and scientific approaches to diagnose and differentiate pathogenic microorganisms. Laboratory 30 hours. Prerequisite: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Epidemiology L&L",
      "classCode": "BIOL 117",
      "description": "This course provides an introduction to epidemiology, including assessment of health and disease in populations, epidemiological data analysis, disease transmission, and public health interventions. The course also exposes students to the epidemiology of diseases and conditions of current public health and clinical importance in the United States and internationally. The laboratory (computer lab) will provide students with hands-on experience with epidemiologic methods, study design, and data analysis. Laboratory 30 hours. Also listed as PHSC 100. Prerequisite: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Biology of Stress",
      "classCode": "BIOL 119",
      "description": "This course explores the impact of stress on physiology, behavior, and health, using a multidisciplinary approach. Topics include defining and measuring stress, differences between acute and chronic stress exposure, effects of stress on physiological processes and on the brain, how stress affects gene expression and neurogenesis, and relationships between stress and disease. We will also discuss the social patterning of stress exposure and the effects of social policies and interventions. Prerequisite: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Animal Physiology L&L",
      "classCode": "BIOL 120",
      "description": "This course examines contrasting strategies used by different animals to deal with variations in temperature, food, oxygen, and water, and highlights the diversity of physiological adaptations in major animal groups, especially those living in “extreme” habitats. Laboratory 30 hours. Prerequisite: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Neurobiology L&L",
      "classCode": "BIOL 122",
      "description": "Study of the molecular basis of neurobiology: how the nervous system is structured, how neurons form connections and relay information between each other, and how specific components of the nervous system function together to perceive the environment around us. Laboratory 30 hours. Prerequisites: BIOL 1C and CHEM 31. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Neurodevelopment L&L",
      "classCode": "BIOL 123",
      "description": "This course explores the development of the nervous system, including the cellular and molecular mechanisms that are crucial for the formation of the brain and spinal cord, and the establishment, maintenance, and remodeling of neuronal connections. We will also examine the experimental approaches used to study neural development. Laboratory 30 hours. Prerequisite: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Human Physiology L&L",
      "classCode": "BIOL 124",
      "description": "Examining the physical and chemical basis of human life, this course focuses on the neural and endocrine control of physiologic processes to maintain homeostasis. Laboratory 30 hours. Prerequisite: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Plant Development L&L",
      "classCode": "BIOL 128",
      "description": "This course explores the processes of RNA and protein regulation, epigenetics, and “omics” based scientific approaches, phenomena that will be discussed within the context of plant development. Similarities and salient differences among and/or between plants, animals, and microbes will be described as appropriate. Laboratory 30 hours. Prerequisite: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "California Plant Diversity L&L",
      "classCode": "BIOL 134",
      "description": "Surveys the major angiosperm families in California, relies heavily on using taxonomic keys to identify California plants to species, and investigates evolutionary patterns characteristic of the California flora through a combination of lab and substantial field experiences. Laboratory and field work 30 hours. Prerequisite: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Natural History of California L&L",
      "classCode": "BIOL 142",
      "description": "An examination of the natural history, biology and ecology of coastal, desert and marine ecosystems of California. This course counts as an Advanced Writing elective. Lecture explores biological and environmental issues critical to all the denizens of California. To explore issues of development, sustainability, and human ecology in California (such as water, pollution, urban growth, and climate change) students will conduct a term-long research project on a relevant topic of their choice, culminating in a paper and a short (oral) report to their peers. Lab 30 hours.  Fieldwork will develop field observation and species identification skills and modern biodiversity indexing techniques in a variety of regional ecosystems, including rocky intertidal, tidal marsh, nearshore subtidal/kelp forest, redwood forest and oak woodlands. Prerequisites: BIOL 1C. (5 Units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Natural History of Baja L&L",
      "classCode": "BIOL 144",
      "description": "Examines the natural history of Baja California Sur, with emphasis on the taxonomy of marine and terrestrial organisms, the ecology of desert and coastal ecosystems, and the biogeography of the peninsula. Meets twice a week in winter quarter and culminates in a 10-day spring break trip to the Sierra de la Laguna region and the Isla Espiritu Santo complex. Students will become familiar with desert, riparian, beach, mangrove, and rocky intertidal habitats, develop field observation and species identification skills, and explore local conservation challenges. Laboratory 30 hours. Prerequisites: BIOL 1C or ENVS 21 or permission of instructor. Enrollment by application only. Travel fees required. (5 units) Cross listed with ENVS 144.",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Virology",
      "classCode": "BIOL 145",
      "description": "Examines the biology of viruses including their structure, evolutionary origins, classification, genetics, laboratory propagation and diagnostic methods, viral pathogenesis, response of host cells to viral infection, and salient aspects of the epidemiology of viral diseases. This course will focus on viruses that infect eukaryotic cells, emphasizing important viral groups that infect humans. Prerequisite: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Restoration Ecology L&L",
      "classCode": "BIOL 151",
      "description": "The science and practice of restoring degraded ecosystems, with an emphasis on plant ecology. Through fieldwork in restoration experiments and examination of literature case studies, students will grapple with basic questions: How do we decide what to restore? How do we restore it? And how do we know if we’re finished? There will be an emphasis on reading and writing scientific papers, working with data, and critically judging the success of restoration projects in meeting goals of biodiversity and ecosystem function. Laboratory and field work 30 hours. Also listed as ENVS 151. Prerequisite: BIOL 1C or both ENVS 21 and ENVS 23. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Conservation Science",
      "classCode": "BIOL 153",
      "description": "Conservation is a scientific enterprise and a social movement that seeks to protect nature, including Earth’s animals, plants, and ecosystems. Conservation science applies principles from ecology, population genetics, economics, political science, and other natural and social sciences to manage and protect the natural world. Conservation is all too often seen as being at odds with human well-being and economic development. This course explores the scientific foundations of conservation while highlighting strategies to better connect conservation with the needs of a growing human population. We will examine whether conservation can protect nature, not from people, but for people. Also listed as ENVS 153. Prerequisite: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "General Ecology L&L",
      "classCode": "BIOL 156",
      "description": "Quantitative study of the interrelationships of organisms with their biotic and abiotic environments. Emphasis on population dynamics, interspecific relationships, community structure, and ecosystem processes. Laboratory and field work 30 hours, including one weekend field trip. Also listed as ENVS 156. Prerequisites: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Biology of Insects L&L",
      "classCode": "BIOL 158",
      "description": "An introduction to basic and applied aspects of insect biology with emphasis on evolution, morphology, physiology, and behavior of insects and related arthropods. Also includes a review of important agricultural, medical, forestry, and veterinary pests. Laboratory and field work 30 hours, including an overnight field trip and optional trips to nearby ecosystems. Prerequisite: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Biostatistics L&L",
      "classCode": "BIOL 160",
      "description": "A course in applied statistics for biologists and environmental scientists planning to conduct manipulative experiments. Students gain training in experimental design, quantitative analysis, and hypothesis testing. Theory and concepts are covered in lectures and readings. Laboratory sessions provide practical experience in computing statistical procedures by hand and with statistical software. Examples used in lectures and lab assignments are derived from medical research, physiology, genetics, ecology, and environmental risk assessment. Laboratory 30 hours. Also listed as ENVS 110. Prerequisite: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Animal Behavior L&L",
      "classCode": "BIOL 165",
      "description": "Examination of the behavior of animals in nature using an organizational scheme that recognizes proximate, or immediate, causes of behavior and evolutionary bases for behavior. Topics include physiological correlates of behavior, perception of natural stimuli (light, sound, chemicals), and behavioral ecology of foraging, mating systems, parent-offspring relationships, and social behavior. Laboratory 30 hours. Prerequisite: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Analysis of Biological Data L&L",
      "classCode": "BIOL 170",
      "description": "This course covers the big data revolution that is transforming biology. We explore a variety of advanced data analysis tools suitable for large datasets. Students gain skills in understanding complex data and verbally and graphically communicating their insights. Prerequisite: BIOL 1C; BIOL 160/ENVS 110 or a similar background in statistics is recommended. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ethical Issues in Biotechnology and Genetics",
      "classCode": "BIOL 171",
      "description": "An interdisciplinary consideration of contemporary biotechnology, and the ethical implications inherent in the development and use of such technology. Topics include human cloning, stem cell research, human genome project, genetic testing, gene therapy, genetically modified organisms, personalized medicine, clinical trials, and public policy. Prerequisite: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Molecular Modeling L&L",
      "classCode": "BIOL 172",
      "description": "Molecular modeling is a powerful tool that allows scientists to explain and make predictions about molecular structures, dynamics, and interactions. In this course, students will use state-of-the-art software for molecular dynamics and drug design and computational tools such as Python, PyMOL, and high-performance computing. Laboratory 30 hours. Prerequisites: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Evolution L&L",
      "classCode": "BIOL 173",
      "description": "Examination of advanced concepts of modern evolutionary biology. Topics include the evolutionary forces of microevolution, the evolution of sex, adaptation, speciation, human evolution, molecular evolution, and macroevolutionary phenomena deciphered from phylogenetic trees. Laboratory (30 hours) includes bench experiments, field study, and computational activities. Prerequisite: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Cell Biology L&L",
      "classCode": "BIOL 174",
      "description": "Study of the function of cellular organelles and the signaling pathways that control cell reproduction. Topics include a detailed discussion of the structure of cell membranes, nuclear and chromosome structure, DNA replication, the microtubule and microfilament cytoskeleton, mitosis, mechanisms of cell motility, cell cycle regulation, and apoptosis. Laboratory experiments focus on cell cycle regulation and cell differentiation. Laboratory 30 hours. Prerequisites: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Molecular Biology L&L",
      "classCode": "BIOL 175",
      "description": "An introduction to the maintenance and flow of genetic information at the level of protein-nucleic acid interactions. Lectures focus on basic molecular biology concepts and recombinant DNA technology. Laboratory 30 hours. Prerequisites: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Biotechnology Laboratory—Recombinant DNA Technology or Systems Biology L&L",
      "classCode": "BIOL 176",
      "description": "Research topics vary from year to year. Laboratory meets twice each week. Lectures discuss the scientific basis for the lab methods, and their application in biomedical research and the biotechnology industry. Laboratory 60 hours. Prerequisites: BIOL 1C, and at least one upper-division cell and molecular biology laboratory class. BIOL 175 recommended. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Biotechnology Laboratory—Gene Expression and Protein Purification L&L",
      "classCode": "BIOL 177",
      "description": "Explores principles and techniques for expression and purification of recombinant proteins. Laboratory meets twice each week and will use techniques such as column chromatography, mammalian tissue culture, and various gene expression systems. Lectures discuss the theory behind the methods used in the lab, as well as their application in basic and applied research. Laboratory 60 hours. Prerequisites: BIOL 1C, and at least one upper-division cell and molecular biology laboratory class. BIOL 175 recommended. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Bioinformatics L&L",
      "classCode": "BIOL 178",
      "description": "Bioinformatics tools are important for storing, searching, and analyzing macromolecular sequences and structures. This course in applied bioinformatics provides an in-depth survey of modern bioinformatics tools. Students will become proficient at searching GenBank, downloading and analyzing sequences, and working with metadata. Software tools for functional and evolutionary analysis of nucleic acids and proteins will also be examined. Laboratory 30 hours. Prerequisite: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Cancer Biology",
      "classCode": "BIOL 179",
      "description": "Introduction to the molecular and cellular basis of cancer. Introduction to the pathology of cancer. How basic processes such as cell growth, cell cycle control, and cell death are affected by molecular changes in oncogenes and tumor-suppressor genes. Prerequisites: BIOL 1C and CHEM 33. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Marine Ecology L&L",
      "classCode": "BIOL 180",
      "description": "Quantitative study of the ecology of marine organisms, with an emphasis on population dynamics, interspecific relationships, community structure, and ecosystem processes. Also examines principles of oceanography, biology, and ocean ecology, focusing on organisms and ecosystems of coastal California. Laboratory and field work 30 hours. Prerequisite: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "STEM Education & Social Justice",
      "classCode": "BIOL 188",
      "description": "Students will examine the issues and challenges surrounding Science, Technology, Engineering, and Math education in U.S. high schools. Topics may include funding, learning obstacles, diversity, accessibility, national standards, AP/IB, and creation/evolution controversies. Students explore topics while interacting with local schools, some of which are identified as low performing. We provide support and guidance to help improve science education, serve as higher education role models, and stimulate interest in STEM, while gaining insight into public science education issues. Students will learn, reflect, analyze, and integrate course material through personal interactions, structured written critical reflections, in-class discussions, outreach events, and a final research project, while receiving instruction from a diverse range of local experts on science education. Does not satisfy the requirements of the biology major. (3 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Topics in Cell and Molecular Biology",
      "classCode": "BIOL 189",
      "description": "Seminar dealing with contemporary research in cellular and molecular biology and biotechnology. Students are required to lead discussions and participate in critical analyses of recently published research articles. May be taken up to two times for credit. Does not count as an upper-division course toward a major or minor in biology, but allows BIOL 171 to count as an upper-division biology course for the biology major or minor when BIOL 189 and 171 are taken during the same quarter. Prerequisites: BIOL 1C and concurrent enrollment in BIOL 110, 113, 171, 174, or 175. Does not count as an upper-division Biology course on its own. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Project Lab",
      "classCode": "BIOL 191",
      "description": "Project lab is an intensive, research-oriented course where students conduct projects directly related to ongoing studies in the professor’s laboratory. The class will use modern, cutting-edge research approaches and will emphasize critical thinking, experimental design, and scientific communication. Research topics vary from year to year. Laboratory 60 hours. Prerequisites: BIOL 1C and at least one upper-division laboratory course. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Undergraduate Research",
      "classCode": "BIOL 195",
      "description": "Experimental research project supervised by Biology Department faculty. Three hours of research per week is expected per unit. Maximum of 3 units per quarter. Can be repeated for credit, with a maximum of 5 units per academic year. Must be taken P/NP. Prerequisite: consent of instructor. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Internship and Undergraduate Research",
      "classCode": "BIOL 198",
      "description": "Students wishing to take either 198A or 198B should have a GPA of 3.0 or better in biology and must present an outline of their projected research to the chair no later than the fifth week of the term preceding the start of the project. Prerequisite: departmental and University permission. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Internship",
      "classCode": "BIOL 198A",
      "description": "Research in off-campus programs under the direct guidance of cooperating research scientists and faculty advisors. Students must coordinate with an on-campus advisor and produce a final research project if they wish to fulfill an upper-division requirement for the biology major. Laboratory credit may be awarded based on nature of the internship. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Research",
      "classCode": "BIOL 198B",
      "description": "Supervised laboratory research culminating in a written report suitable for publication or in a presentation at a regional or national scientific meeting. Sustained for one year with credit given for one term. Fulfills one upper-division laboratory requirement toward the major. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Reading and Research",
      "classCode": "BIOL 199",
      "description": "Detailed investigation of a specific topic in biology under the close direction of a faculty member. Students wishing to take this course should have a GPA of 3.0 or better in biology and must present an outline of their projected research to the department chair no later than the fifth week of the term preceding the start of the project, which will continue for one term only. Prerequisite: departmental and University permission. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    }
  ]