[
    {
      "courseName": "Chemistry and the Environment",
      "classCode": "CHEM 1",
      "description": "A survey of the role of chemistry in major environmental issues such as global warming, acid rain, ozone depletion, photochemical smog, persistent organic pollutants, fossil fuel, nuclear and renewable energy, recycling and environmental fate of pollutants. Laboratory 3 hours every other week. Students with prior credit for CHEM 11 can enroll only on a pass/no pass (P/NP) basis. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Chemistry: An Experimental Science",
      "classCode": "CHEM 5",
      "description": "A survey of modern chemical applications, including applications to health, the environment, and consumer issues, and an introduction to the scientific method of inquiry. Laboratory 3 hours every other week. Cannot be taken by students with prior credit for CHEM 11 or 19. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "General Chemistry I: Bonding and Energy",
      "classCode": "CHEM 11",
      "description": "Topics include chemical properties and structure, quantitative problem-solving, chemical bonding, ions, stoichiometry, and an introduction to thermodynamics. Recitation is offered by placement based on a readiness exam. Laboratory 3 hours per week. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "General Chemistry I Recitation",
      "classCode": "CHEM 11R",
      "description": "Collaborative problem solving session to deepen student understanding of CHEM 11 lecture topics and to build skills to support success in conceptual and quantitative aspects. Attendance is encouraged for all students, and recommended for all students who want added accountability or assistance in chemistry problem solving. Graded P/NP only. Co-requisite CHEM 11. (0.25 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "General Chemistry Equivalency Credit",
      "classCode": "CHEM 11T",
      "description": "General Chemistry equivalency credit primarily given to students who apply Chemistry AP scores of 3, 4, or 5 to their coursework. This credit allows students to take Chem 14 instead of Chemistry 11 and 12. Students with AP score of 3 may elect to take either Chem 14 or both Chem 11 and Chem 12. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "General Chemistry II: Molecules in Motion",
      "classCode": "CHEM 12",
      "description": "Topics include gasses, intermolecular forces, kinetics, chemical equilibria, electrochemistry, and acid-base chemistry. Laboratory 3 hours per week. Prerequisite: CHEM 11. Students who received a passing grade of a D+ or below in CHEM 11 are required to enroll in the CHEM 12 Recitation section and encouraged to meet with their instructor. Students who received a C- or lower in CHEM 11 are encouraged to enroll in the CHEM 12 Recitation section and meet with their instructor during the first week of class. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "General Chemistry II Honors",
      "classCode": "CHEM 12H",
      "description": "Accelerated treatment of CHEM 12 material and other topics not normally covered in general chemistry. Laboratory 4 hours per week. Prerequisites: Permission of instructor and a strong performance in CHEM 11. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "General Chemistry II Recitation",
      "classCode": "CHEM 12R",
      "description": "Collaborative problem solving session to deepen student understanding of CHEM 12 lecture topics and to build skills to support success in conceptual and quantitative aspects. Required for students who passed CHEM 11 with a D-, D, or D+, strongly encouraged for students who passed CHEM 11 with a C-, and recommended for any student interested in extra practice or learning strategies and skills for general chemistry problem solving. Graded P/NP only. Co-requisite CHEM 12. (0.25 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Chemical Principles",
      "classCode": "CHEM 14",
      "description": "Subjects include accelerated treatment of topics covered in CHEM 11 and CHEM 12. This course is open to students with AP scores in chemistry of 3, 4, or 5 who will be taking chemistry courses beyond CHEM 14. Laboratory 4 hours per week. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Research",
      "classCode": "CHEM 15",
      "description": "This course introduces students to opportunities for undergraduate research in the department, with a laboratory component focused on the instructor’s research program. Departmental faculty present their current research. Also provided is an overview of research ethics and of typical tools used in pursuing scientific research projects. Students interested in the chemistry or biochemistry major/minor should ordinarily take this course before the end of their sophomore year. Prerequisite: CHEM 11 or CHEM 14. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Organic Chemistry I",
      "classCode": "CHEM 31",
      "description": "Topics include organic structure and conformations, stereochemistry, structure-reactivity relationships, and the chemistry of alkyl halides and alkenes. Special emphasis is placed on understanding reaction mechanisms. Laboratory 3 hours per week. Prerequisite: CHEM 11 or 14. Students receiving a grade lower than C- in prior CHEM coursework  are strongly urged to meet with their instructor before continuing with CHEM 31. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Organic Chemistry I Recitation",
      "classCode": "CHEM 31R",
      "description": "Collaborative problem solving session to deepen student understanding of CHEM 31 lecture topics and to build skills to support success in organic chemistry conceptual understanding and the applications of these concepts. Recommended for all students who want added accountability or assistance in organic chemistry problem solving. Graded P/NP only. Co-requisite CHEM 31. (0.5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Organic Chemistry II",
      "classCode": "CHEM 32",
      "description": "Topics include spectroscopy and the chemistry of alkynes, ethers, alcohols, and carbonyl compounds. Laboratory 3 hours per week. Prerequisite: CHEM 31. Students receiving a grade lower than a C- in CHEM 31 are strongly urged to meet with their instructor before continuing with CHEM 32. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Organic Chemistry II Majors’ Laboratory",
      "classCode": "CHEM 32M",
      "description": "Students will carry out experimental organic chemistry research projects to prepare and characterize diverse organic molecules. New experimental techniques will be introduced, including NMR spectroscopy, mass spectrometry, multi-step synthesis, and combinatorial chemistry. This course will be taken in place of the laboratory component of CHEM 32. Pre-lab meeting 1 hour per week and laboratory 3 hours per week. Co-requisite: CHEM 32. Prerequisites:  Chem 31L and permission of instructor (1 unit)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Organic Chemistry II Recitation",
      "classCode": "CHEM 32R",
      "description": "Collaborative problem solving session to deepen student understanding of CHEM 32 lecture topics and to build skills to support success in organic chemistry conceptual understanding and the applications of these concepts. Recommended for all students who want added accountability or assistance in organic chemistry problem solving. Graded P/NP only. Co-requisite CHEM 32. (0.5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Organic Chemistry III",
      "classCode": "CHEM 33",
      "description": "Topics include carbonyl condensation reactions, aromatic substitutions, amines, carbohydrates, and peptide and protein synthesis. Other advanced topics may include pericyclic reactions and natural product synthesis. Laboratory 3 hours per week. Prerequisite: CHEM 32. Additionally, students receiving a grade lower than a C- in CHEM 32 are strongly urged to meet with their instructor before continuing with CHEM 33. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Organic Chemistry III Majors’ Laboratory",
      "classCode": "CHEM 33M",
      "description": "Students will continue their work on organic chemistry research projects begun in CHEM 32L. In this quarter, they will focus on troubleshooting experiments, analysis of results, and presentation of scientific data. This course will be taken in place of the laboratory component of CHEM 33. Pre-lab meeting 1 hour per week and laboratory 3 hours per week. Co-requisite: CHEM 33. Prerequisites:  Chem 32M and permission of instructor.  (1 unit)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Organic Chemistry III Recitation",
      "classCode": "CHEM 33R",
      "description": "Collaborative problem solving session to deepen student understanding of CHEM 33 lecture topics and to build skills to support success in organic chemistry conceptual understanding and the applications of these concepts. Recommended for all students who want added accountability or assistance in organic chemistry problem solving. Graded P/NP only. Co-requisite CHEM 33. (0.5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Quantitative Analysis",
      "classCode": "CHEM 50",
      "description": "Topics include quantitatively rigorous treatment of equilibrium, thermodynamics, and electrochemistry. Laboratory focuses on quantitative analysis via titrations, spectroscopy, and electrochemical techniques. Laboratory 4 hours per week. Prerequisite: CHEM 12 or CHEM 14, and  MATH 12 or MATH 36. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Teaching Assistant Training",
      "classCode": "CHEM 94",
      "description": "This course focuses on building teaching and learning techniques for the general chemistry laboratory including chemical concepts, use of instrumentation, and building skills to guide students in the laboratory to meet their learning goals for each experiment. Prerequisites: CHEM 12 or 14 and instructor permission. (1 unit)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Independent Laboratory",
      "classCode": "CHEM 99",
      "description": "Laboratory course, primarily for transfer students to make-up lower division laboratory as needed for equivalency with CHEM 11, 12, 50, 31, 32, and/or 33. Prerequisite: Approval of department chair. (1 unit)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Bioinorganic Chemistry",
      "classCode": "CHEM 101",
      "description": "Structure, properties, and reactivity of metal complexes and the function of metal ions in biological processes. Pre- or corequisite: CHEM 141. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Inorganic Chemistry",
      "classCode": "CHEM 102",
      "description": "Introduction to the bonding, structure, properties, and reactions of inorganic compounds, with examples drawn from main group and transition metal compounds.  Laboratory 4 hours per week. Pre- or corequisites: CHEM 50, CHEM 33, and MATH 13. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Environmental Chemistry",
      "classCode": "CHEM 103",
      "description": "Sources, reactions, and transport of contaminants in soil, water, and air. Kinetic and thermodynamic models for smog formation, ozone layer depletion, acid rain, and the transport and degradation of contaminants in natural waters and soil, plus a brief look at global climate modeling. This course satisfies the Science, Technology and Society requirement. Prerequisite: CHEM 50. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Instrumental Analysis",
      "classCode": "CHEM 111",
      "description": "Principles and use of instrumentation. Focus on electronics, spectroscopic methods, mass spectrometry, and chemical separations. Laboratory 4 hours per week. Pre- or corequisite: CHEM 32; CHEM 50 recommended. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Bioanalytical Chemistry",
      "classCode": "CHEM 112",
      "description": "A focused investigation of the application of modern methods of analytical chemistry to understanding biological systems at the molecular level. Topics depend on recent developments in bioanalytical research but may include sub-cellular analyses, proteomics, electrochemical methods, and nanoparticle-based approaches to analysis. This course stresses extensive reading of recent literature in bioanalytical chemistry, critical evaluation of published scientific papers, and development of skills in scientific writing. This course satisfies the Advanced Writing requirement. Prerequisite: CTW 1 and 2, CHEM 111, or consent of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Chemistry and Biochemistry Seminar",
      "classCode": "CHEM 115",
      "description": "Active areas of research in university, industrial, and government laboratories, presented by guest speakers. May be repeated for credit. Graded P/NP only. Pre- or corequisite: CHEM 33. (0.5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Organic Syntheses",
      "classCode": "CHEM 130",
      "description": "Modern synthetic methods applied to the preparation of structurally complex target compounds, such as bioactive natural products and pharmaceuticals. Extensive discussion of synthetic planning, known as retrosynthetic analysis, emphasizing the standard bond-forming methods learned in CHEM 31–33. Prerequisite: CHEM 33. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Bioorganic Chemistry",
      "classCode": "CHEM 131",
      "description": "Chemical synthesis of carbohydrates, nucleic acids, peptides, proteins, and reaction mechanisms of biological cofactors. Prerequisite: CHEM 33. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Polymer Chemistry",
      "classCode": "CHEM 132",
      "description": "Synthesis and characterization of polymers and complex macromolecules. Special emphasis on polymerization mechanisms, kinetic, and thermodynamic aspects of these reactions, and also applications of polymers in society. Much of the course content will come from current literature. This course satisfies the Advanced Writing requirement. Prerequisite: CTW 1 and 2, CHEM 33; or CHEM 32 with consent of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Medicinal Chemistry",
      "classCode": "CHEM 133",
      "description": "Medicinal chemistry will engage students in the study of the scientific processes and experiments involved in drug discovery.  By examining case studies, students will appreciate how drug discovery has shaped historical events, how and why drug regulation processes have evolved, and how societal forces influence which therapeutic areas are targeted for drug discovery.  Students will become familiar with experiments that clarify drug interactions with biomolecules and biological systems and drug efficacy.  In-depth study of specific drugs will analyze societal influences that contributed to their discovery, their scientific development, and their impact (or potential impact) on society.  This course satisfies the Science, Technology and Societies requirement.  Prerequisite: CHEM 33.  (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Drug Synthesis and Its Impact",
      "classCode": "CHEM 134",
      "description": "Drug Synthesis and its Impact on Society will develop student’s skills in designing viable syntheses of drug targets and understanding of how drug synthesis plays a critical role in healthcare and society.  Through examining case studies, students will study the development of new drug targets, learn how lead compounds progress towards marketable drugs and how drug synthesis has directly impacted society in constructive and destructive ways. Societal impact topics will be developed and discussed in the context of how drugs benefit human health and how these chemical compounds are both used and misused. This course satisfies the Science, Technology and Societies requirement. Prerequisite: CHEM 33 (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Chemical Catalysis",
      "classCode": "CHEM 135",
      "description": "State of the art in abiotic catalytic reactions of organic compounds used in commodity chemical and fine chemical production (including pharmaceuticals). Topics include transition metal catalysis, organocatalysis, photocatalysis, and electrocatalysis. Reading and critical evaluation of peer-reviewed publications in these areas contribute to production of a publication-quality research review paper. This course satisfies the Advanced Writing Core requirement. Prerequisites: CTW 1, CTW 2, and CHEM 33. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Biochemistry I",
      "classCode": "CHEM 141",
      "description": "An introduction to structure/function relationships of biologically important molecules, enzymology, membrane biochemistry, and selected aspects of the intermediary metabolism of carbohydrates. Pre- or corequisite: CHEM 33. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Biochemistry II",
      "classCode": "CHEM 142",
      "description": "Includes a study of various aspects of the intermediary metabolism of carbohydrates, lipids, and amino acids, as well as nucleic acid structure and function, protein synthesis, and subcellular sorting, and more advanced molecular physiology, including membrane biochemistry, signal transduction, and hormone action. Prerequisite: CHEM 141. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Biochemical Techniques",
      "classCode": "CHEM 143",
      "description": "A laboratory course emphasizing fundamental theory and practice in biochemical laboratory techniques, including preparation and handling of reagents; isolation, purification, and characterization of biomolecules; enzyme kinetics; spectrophotometric assays; and electrophoretic techniques. Laboratory 8 hours per week. Prerequisites: CHEM 141 and consent of instructor. (3 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Biophysical Chemistry",
      "classCode": "CHEM 150",
      "description": "Introduction to the physical behavior of biomolecules. Topics include transport properties, reaction kinetics, sedimentation, electrophoresis, binding dynamics, and molecular motion. Prerequisites: MATH 13 and CHEM 50, or consent of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Quantum Chemistry",
      "classCode": "CHEM 151",
      "description": "Fundamentals of quantum mechanics, including wave functions and probability; rotational, vibrational, and electronic transitions; atomic and molecular electronic structure; and magnetic resonance. Prerequisites: MATH 13 and CHEM 50. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Chemical Thermodynamics",
      "classCode": "CHEM 152",
      "description": "Fundamental laws of thermodynamics, and applications to ideal and real gas equations of state, ideal and real solutions, phase equilibria, and electrochemistry. Prerequisites: MATH 13 and CHEM 50. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Physical Chemistry Laboratory",
      "classCode": "CHEM 154",
      "description": "Experimental applications of thermodynamics, kinetics, spectroscopy, and other aspects of physical chemistry. Laboratory 8 hours per week. Prerequisite: MATH 13 and CHEM 50. It is recommended that students are enrolled in or have completed CHEM 151 or 152. (3 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Undergraduate Research",
      "classCode": "CHEM 182",
      "description": "Experimental research project supervised by chemistry and biochemistry faculty members. Each unit requires a minimum of 30 hours of laboratory work. May be repeated for credit. Prerequisite: Consent of instructor. (1–3 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Senior Research Experience",
      "classCode": "CHEM 183",
      "description": "Individual research under the supervision of chemistry and biochemistry faculty members, culminating in a comprehensive progress report. Laboratory at least 9 hours per week. Prerequisites: Senior standing in chemistry and consent of instructor. (3 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Capstone Research Experience",
      "classCode": "CHEM 184",
      "description": "Continuation of individual research under the supervision of a chemistry and biochemistry faculty member, culminating in a thesis and oral presentation. Laboratory at least 9 hours per week. Prerequisites: CHEM 182 or 183, and consent of instructor. (3 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in Chemistry",
      "classCode": "CHEM 190",
      "description": "Special topics courses covering advanced topics in any of the five areas of study in chemistry may be offered on an intermittent basis. These courses may be offered as once-a-week seminars or follow more traditional course schedules. The course units will vary based on the number of course meetings per quarter and the course workload. Possible topics are organic mechanisms, medicinal chemistry, transition metals in organic synthesis, materials, nanotechnology, photochemistry, electrochemistry, molecular physiology, and membrane biochemistry. This course may be repeated for credit if the topics vary. (2–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Independent Study",
      "classCode": "CHEM 199",
      "description": "Directed study under the supervision of a faculty member in an area or topic in chemistry or biochemistry not covered in regular courses. Registration by permission of the professor directing the study only. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    }
  ]