[
    {
      "courseName": "Child Studies",
      "classCode": "CHST 3",
      "description": "Designed to cultivate critical awareness, thinking, and action with respect to children and families in schools and broader communities. The course fosters an understanding of social justice issues related to children and youth in schools and communities, historical movements and organizational structures within education, and the emerging professions of child studies. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Cultural Competence and Humility with Children and Families",
      "classCode": "CHST 4",
      "description": "Cultural competence and humility taken together allow us to better communicate, listen, teach, learn, support, and lead in multiple contexts. Becoming culturally competent requires the critical development of awareness, attitudes, knowledge, and skills that create supportive and transformative interactions when working with children and families within diverse environments. This course is designed to cultivate knowledge of self and others while also promoting a formative anti-oppression framework. Through readings, films, discussion, and trainings, we will devote ourselves to the rigorous examination of personal, interpersonal, and systemic/structural racism, classism, sexism, heterosexism, ageism, ableism, and religious discrimination toward the pursuit of social justice with children and families. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Compassionate Leadership and Mindfulness",
      "classCode": "CHST 5",
      "description": "Explores current research on how mindfulness (cultivating self-awareness and relational-awareness) leads to essential workplace leadership competencies such as: leading courageous conversations, managing conflict and emotions, and developing resilience in challenging situations. Students analyze how mindfulness programs impact the role businesses and public organizations (e.g., schools, prisons) play in civic life. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Anti-Racist & Decolonial Praxis in Early Childhood Contexts",
      "classCode": "CHST 6",
      "description": "Children witness and make meaning of racialization and racialized inequity in society. Grounded in transdisciplinary theories and research, this course (1) examines racialized inequity in the context of early childhood, and (2) applies an array of community-led, anti-racist, and decolonial praxis frameworks toward early childhood equity, accessibility, inclusion, belonging, and thriving in domains such as early care and education, health, housing, and the environment. This course requires participation in community-based learning experiences. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Quantitative Research Methods and Statistics in Child Studies",
      "classCode": "CHST 11",
      "description": "An introduction to research methods and exploratory data analysis, descriptive statistics, probability, sampling, estimation, and statistical inference. Work problems are focused on how statistics are used in evaluating and understanding questions about children in school and community settings. PSYC 51 fulfills the CHST 11 requirement for psychology double majors. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Qualitative Research Methods in Child Studies",
      "classCode": "CHST 12",
      "description": "An introduction to qualitative research methods and analysis of discourse, context, and the social construction of truth. Focus is on research questions related to evaluating and understanding familial, social, and political issues related to children. Emphasis is on the production of knowledge, interpretive frameworks, and research design.  (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Movement Education",
      "classCode": "CHST 66",
      "description": "An exploration of movement as a primary site of learning and meaning-making for children and youth. Students learn how to facilitate learning in the conceptual/cognitive, affective/socio-emotional, and psychomotor/kinesthetic domains, and reflect critically on the teaching process. Course culminates in student-led collaboratively designed lessons taught to children from neighboring K–8 schools. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Technology and Education",
      "classCode": "CHST 75",
      "description": "Explores the relationship between technology, society, and education. Students investigate the appropriate role of technology in educational reform, evaluate the personal impact of social media on children and adolescents, and propose solutions to the pressing educational needs of our society. Interactive and engaging discussions and team projects highlight the dynamic quality of these issues. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Writing for Research in Social Sciences",
      "classCode": "CHST 100",
      "description": "Explores quantitative and qualitative social science research on children, youth, and families, with a focus on the relationship between a research problem, the exploration of that problem, and the inferences that can be drawn from empirical inquiry. Students engage in close readings of scholarly articles while planning and participating in lessons to support collective learning. Emphasis on the development of skills in social science writing for academic audiences. Prerequisites: CTW 1, 2, CHST 11, (or PSYC 51 for double PSYC majors) and CHST 12 for majors; permission from instructor for non-majors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Early Childhood, Family and Community",
      "classCode": "CHST 101",
      "description": "An overview of theory and research of infancy and early childhood (ages 0–5).   Requires participation in community-based learning experiences off campus. Specific topics vary and the course may be repeated for credit. Prerequisite: CHST 100 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Middle Childhood, Family and Community",
      "classCode": "CHST 102",
      "description": "An interdisciplinary examination of children in middle childhood (ages 5–12).  Requires participation in community-based learning experiences off campus. Specific course topics vary and the course may be repeated for credit. Prerequisite: CHST 100 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advocacy for Children",
      "classCode": "CHST 104",
      "description": "An interdisciplinary examination of child and family advocacy and the prevention of child abuse and neglect within a risk and resilience framework. Requires participation in community-based learning experiences off campus. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Urban Education and Multiculturalism",
      "classCode": "CHST 106",
      "description": "This course explores the social and political forces shaping inequality in urban schools and beyond. Special attention is paid to the role of US institutions, political ideologies, and historical events, as the way unequal structures produce unequal outcomes is unpacked.  The course also delves into philosophical reflections on education policy, neoliberalism, standardized testing, tech in education, the social construction of merit, and much more.  Last, students; dare to “imagine otherwise,” while exploring the possibilities of structural change and a world where inequality and injustice no longer exist. This course requires participation in community-based learning experiences off campus. Fulfills Diversity or ELSJ requirement. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Children, Art, and Society",
      "classCode": "CHST 109",
      "description": "This course allows students to investigate the role of art and creativity in human development and understand the personal and societal impact of accessible, high quality, embodied arts experiences. The way the arts creates a path for more justice in the world, democratizes the classroom for English language learners, gracefully assists with classroom management, and fosters higher order thinking is explored, as is the notion of public schools offering all arts to all students. Student learning in this course culminates with transdisciplinary perspectives, acknowledging the powerful complexity and potential of the arts to serve as a bridge between diverse fields and perspectives creating new epistemologies. Final research papers have students investigating arts education efforts and organizations dedicated to the most pressing issues of our time (democracy, peace, diplomacy, the environment, migration, economic and social disparities, etc.), and offering imaginative analysis of ways to better serve the human family, particularly children and youth, via generative, creative, artful solutions. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics: International Internship/Study",
      "classCode": "CHST 115",
      "description": "Topics may vary. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Media and Youth",
      "classCode": "CHST 154Y",
      "description": "Cross-listed with COMM 154Y. For course description, see COMM 154Y. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Exceptional Child",
      "classCode": "CHST 138",
      "description": "Introduction to childhood mental, intellectual, and developmental disabilities, behavior disorders, communication (speech and language) disorders, hearing impairments, physical and health impairments, severe disabilities, and the gifted and talented. The impact of these differences in comparison with typical development is addressed. This course requires participation in community-based learning experiences off campus. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Internship in Child Studies",
      "classCode": "CHST 180",
      "description": "The Internship in Child Studies course provides students with an opportunity to work in schools and community settings that support children, youth and families.  Students apply their knowledge to authentic circumstances while exploring what it means to live and work in solidarity with children, youth and families. In addition, students strengthen their ability to “walk in accompaniment” thoughtfully, sensitively, and respectfully with communities experiencing economic, social, and/or political marginalization or oppression.  Prerequisite, Child Studies major. Required to complete prior to senior capstone, recommended spring of junior year. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Senior Capstone I",
      "classCode": "CHST 181",
      "description": "This course provides students with the opportunity to develop a research project and learn through direct engagement with children in school, family, or community settings. Students will be guided as they review the literature, devise a research question, and design and pilot research procedures. Prerequisites: senior status; CHST 100 and 180. This course is taught in the fall quarter and requires participation in community-based learning experiences off campus. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Senior Capstone II",
      "classCode": "CHST 182",
      "description": "Students will complete their research project developed in CHST 181 including data collection and analysis, writing a research paper in APA style, and presenting a research poster. Prerequisites: senior status; CHST 100 and 181. This course is taught in the winter quarter and requires participation in community-based learning experiences off campus. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Resilient Families",
      "classCode": "CHST 190",
      "description": "A community-engaged guided research experience focused on promoting well-being and resilience in children and families. Fifty hours of research for 1 credit. May be repeated for credit. Permission of instructor required. P/NP only. (1–2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Future Teachers Project Seminar",
      "classCode": "CHST 196",
      "description": "A seminar addressing education and the teaching profession for students participating in the Future Teachers Project (FTP). This program has a three-fold purpose: (1) offer students opportunities to take part in scholarly research and the production of knowledge, with special attention to urban contexts, (2) organize in-class discussions regarding the nexus of educational inequality, politics, and resistance movements, and (3) hold workshop sessions to increase the competitiveness of FTP scholars for graduate school, as they apply for fellowships, scholarships, and internships. May be repeated for credit. (1 unit)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Reading/Directed Research",
      "classCode": "CHST 199",
      "description": "Independent study or supervised research project with a faculty sponsor from CHST. Requires a written proposal and approval by both the faculty sponsor and the CHST program director. Proposal for enrollment is due before finals week of the previous quarter. P/NP only. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    }
  ]