[
    {
      "courseName": "Elementary Latin I",
      "classCode": "CLAS 1",
      "description": "Introduction to vocabulary, forms, and grammar of classical Latin. Development of reading skills with supporting exercises in writing. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Elementary Latin II",
      "classCode": "CLAS 2",
      "description": "Continuation of Latin I. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Elementary Latin III",
      "classCode": "CLAS 3",
      "description": "Completion of elementary Latin. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Intermediate Latin",
      "classCode": "CLAS 101",
      "description": "A course for students who have finished basic Latin grammar. Students will review Latin forms and syntax while reading prose and poetry of increasing complexity. Students will be prepared to enroll in Latin reading courses covering individual authors and genres. Offered in fall quarter only. Prerequisites: CLAS 3 or equivalent expertise in Latin. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Caesar",
      "classCode": "CLAS 121",
      "description": "Reading course in Latin. Representative selections from the Commentarii on the Gallic War and/or Bellum Civile. Consideration of the adaptation of history to political ends. Prerequisites: CLAS 3 or equivalent expertise in Latin. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Catullus",
      "classCode": "CLAS 122",
      "description": "Reading course in Latin. Lyric poems, short epigrams, and longer mythological poems by the poet Catullus, of the late Roman Republic. Prerequisites: CLAS 3 or equivalent expertise in Latin. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Roman Comedy",
      "classCode": "CLAS 123",
      "description": "Reading course in Latin. One or more plays by Plautus or Terence. Social function and nature of Roman comedy. Prerequisites: CLAS 3 or equivalent expertise in Latin. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ovid: Metamorphoses",
      "classCode": "CLAS 124",
      "description": "Reading course in Latin. Selections from Ovid’s epic compendium of mythology. Prerequisites: CLAS 3 or equivalent expertise in Latin. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Cicero: Philosophical Works",
      "classCode": "CLAS 125",
      "description": "Reading course in Latin. Consideration of Cicero’s eclectic philosophy through a careful reading of one or more of his philosophical dialogues. Prerequisites: CLAS 3 or equivalent expertise in Latin. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Cicero: Oratory and Rhetoric",
      "classCode": "CLAS 126",
      "description": "Reading course in Latin. One or more exemplars of Cicero’s rhetorical style or rhetorical theory. Consideration of rhetorical forms, figures, and topoi. Prerequisites: CLAS 3 or equivalent expertise in Latin. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Vergil: Aeneid",
      "classCode": "CLAS 127",
      "description": "Reading course in Latin. The epic poem on the effort of founding Rome and the cost of its greatness. Consideration of the traditional and innovative features of Vergil’s epic style and purpose. Attention to epic meter. Prerequisites: CLAS 3 or equivalent expertise in Latin. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Seneca: Tragedies",
      "classCode": "CLAS 128",
      "description": "Reading course in Latin. Careful reading and discussion of a play by Seneca, with particular consideration of Seneca’s cultural context and importance in literary history, including his influence on later dramatists such as Shakespeare. Prerequisites: CLAS 3 or equivalent expertise in Latin. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Roman Novel",
      "classCode": "CLAS 129",
      "description": "Reading course in Latin. Students will study a Roman Novel, with selections read in Latin and supplementary materials in English. Possible texts include Petronius’s Satyricon, a trenchant satire of Roman society composed under Nero; and Apuleius’s Golden Ass, the grim yet ribald tale of a man who accidentally turns himself into a donkey. Prerequisites: CLAS 3 or equivalent expertise in Latin. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Roman Elegy",
      "classCode": "CLAS 130",
      "description": "Reading course in Latin. Representative selections from the works of Tibullus, Propertius, and Ovid. Origins and development of the elegiac genre. Prerequisites: CLAS 3 or equivalent expertise in Latin. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Vergil: Eclogues and Georgics",
      "classCode": "CLAS 131",
      "description": "Reading course in Latin. Vergil’s earlier works: pastoral poems set in an idealized landscape and the didactic poem on the agriculture and countryside of his native Italy. Prerequisites: CLAS 3 or equivalent expertise in Latin. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Horace",
      "classCode": "CLAS 132",
      "description": "Reading course in Latin. Selections from the odes and epodes. Attention to cultural context and the adaptation of Greek lyric forms and rhythms to the Latin language. Prerequisites: CLAS 3 or equivalent expertise in Latin. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Livy",
      "classCode": "CLAS 133",
      "description": "Reading course in Latin. Selections from the Ab Urbe Condita—the history of Rome from its semi-mythical founding through monarchy, early Republic, and Punic Wars. Prerequisites: CLAS 3 or equivalent expertise in Latin. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Roman Letters",
      "classCode": "CLAS 134",
      "description": "Reading course in Latin. Selections from letters by various authors: Cicero, Seneca, Pliny. Discussion of the epistle as aliterary genre, with focus on the social and historical background of the author. Prerequisites: CLAS 3 or equivalent expertise in Latin. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Late Antique and Medieval Latin",
      "classCode": "CLAS 135",
      "description": "Reading course in Latin. Major works of prose and poetry from the fourth century to the Renaissance. St. Augustine’s Confessions; Boethius’s Consolation of Philosophy;the histories of Gregory of Tours, Bede, and Einhard; Latin fables; popular songs such as the Carmina Burana; and the humanistic writings of Dante, Boccaccio, and Petrarch. Prerequisites: CLAS 3 or equivalent expertise in Latin. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Roman Historians",
      "classCode": "CLAS 136",
      "description": "Reading course in Latin. Selections from Roman historians such as Tactitus or Sallust. Focus on the construction of history as both a literary genre and academic discipline, as well as how Romans constructed their own history. Prerequisites: CLAS 3 or equivalent expertise in Latin. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Latin Biography",
      "classCode": "CLAS 137",
      "description": "Reading course in Latin. Selections from Suetonius and/or Cornelius Nepos. Focus on the genre of biography and the cultural contexts of the authors and subjects. Prerequisites: CLAS 3 or equivalent expertise in Latin. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Martial",
      "classCode": "CLAS 138",
      "description": "Reading course in Latin. Selections from Martial’s epigrams. Focus on the genre of epigram, Martial’s poetic style, and the relationship between Martial’s poetry and his cultural context. Prerequisites: CLAS 3 or equivalent expertise in Latin. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in Latin Poetry",
      "classCode": "CLAS 139",
      "description": "Reading course in Latin. Occasional courses in selected authors or genres for advanced students. Possible topics: Lucretius, Lucan, or satire. Prerequisites: CLAS 3 or equivalent expertise in Latin. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in Latin Prose",
      "classCode": "CLAS 140",
      "description": "Reading course in Latin. Occasional courses in selected authors or genres for advanced students. Possible topics: Quintillian, Varro, Aulus Gellius. Prerequisites: CLAS 3 or equivalent expertise in Latin. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Elementary Greek I",
      "classCode": "CLAS 21",
      "description": "Introduction to vocabulary, forms, and grammar of Attic Greek. Development of reading skills with supporting exercises in writing. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Elementary Greek II",
      "classCode": "CLAS 22",
      "description": "Continuation of Greek I. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Elementary Greek III",
      "classCode": "CLAS 23",
      "description": "Completion of Greek grammar. Introduction to reading Greek literature. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Lucian",
      "classCode": "CLAS 151",
      "description": "Reading course in Greek. Selections from the author’s satirical treatments of mythology, history, philosophy, and rhetoric and/or from the fantasy called A True Story. Lucian’s place in the Second Sophistic. Prerequisites: CLAS 23 or equivalent expertise in Greek. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Homer: Odyssey",
      "classCode": "CLAS 152",
      "description": "Reading course in Greek. Selected passages demonstrating the exploration of the heroic ethos in an epic of peacetime. Consideration of epic meter and conventions. Prerequisites: CLAS 23 or equivalent expertise in Greek. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Euripides",
      "classCode": "CLAS 153",
      "description": "Reading course in Greek. A complete tragic drama. Attention to characterization, dramatic structure, poetry, andEuripides’ place in the history of tragedy. Prerequisites: CLAS 23 or equivalent expertise in Greek. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Herodotus",
      "classCode": "CLAS 154",
      "description": "Reading course in Greek. Selections from the Persian Wars. Focus on Herodotus’ prose style, narrative form, world view, and achievements as the “Father of History.” Peculiarities of the Ionic dialect. Prerequisites: CLAS 23 or equivalent expertise in Greek. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Plato",
      "classCode": "CLAS 155",
      "description": "Reading course in Greek. Careful reading from one or more dialogues such as Apology, Crito, Phaedo, and Republic. Detailed study of dialogue mode of discourse; overview of Plato’s philosophy. Prerequisites: CLAS 23 or equivalent expertise in Greek. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Greek New Testament",
      "classCode": "CLAS 156",
      "description": "Reading course in Greek. Readings selected from the Koine Greek text of the New Testament with a concentration on the gospels or the epistles. Close reading of the text with a view to theological implications of the vocabulary. Introduction to primary research tools. Prerequisites: CLAS 23 or equivalent expertise in Greek. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Hesiod",
      "classCode": "CLAS 157",
      "description": "Reading course in Greek. Selected readings from Hesiod’s two poems, Works and Days and Theogony. Prerequisites: CLAS 23 or equivalent expertise in Greek. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Xenophon",
      "classCode": "CLAS 158",
      "description": "Reading course in Greek. Selected readings from Xenophon’s Memorabilia, Anabasis, Cyropaedia or one of his other works. Focus on Xenophon’s style and cultural and historical context. Prerequisites: CLAS 23 or equivalent expertise in Greek. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Greek Novel",
      "classCode": "CLAS 159",
      "description": "Reading course in Greek. Selected chapters from one or more of the ancient Greek novels, paying particular attention to language and style. In addition to our reading, we will also explore the genre of the novel and the literary, historical, and social contexts surrounding the development of this literary phenomenon. Prerequisites: CLAS 23 or equivalent expertise in Greek. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Plutarch",
      "classCode": "CLAS 160",
      "description": "Reading course in Greek. Selected readings from Plutarch’s biographies or Moralia. Prerequisites: CLAS 23 or equivalent expertise in Greek. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Homer: Iliad",
      "classCode": "CLAS 161",
      "description": "Reading course in Greek. Selected passages illustrating the course and consequences of the wrath of Achilles and the nature of the hero. Consideration of epic meter and conventions. Prerequisites: CLAS 23 or equivalent expertise in Greek. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Sophocles",
      "classCode": "CLAS 162",
      "description": "Reading course in Greek. A complete tragic drama. Attention to characterization, dramatic structure, and poetry, and to the author’s particular contributions to the development of the tragic form. Metrical reading of the text. Prerequisites: CLAS 23 or equivalent expertise in Greek. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Aeschylus",
      "classCode": "CLAS 163",
      "description": "Reading course in Greek. A complete tragic drama. Attention to characterization, dramatic structure, and poetry, and to the author’s particular contributions to the development of the tragic form. Metrical reading of the text. Prerequisites: CLAS 23 or equivalent expertise in Greek. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Greek Oratory",
      "classCode": "CLAS 164",
      "description": "Reading course in Greek. Selections from a representative Greek orator such as Demosthenes or Lysias. Consideration of classical rhetorical forms, topoi, and cultural and historical context. Prerequisites: CLAS 23 or equivalent expertise in Greek. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Aristophanes",
      "classCode": "CLAS 165",
      "description": "Reading course in Greek. A complete comic drama. Attention to dramatic structure, characterization, poetry, political and social commentary, comedic style, and to Aristophanes’ place in the history of comedy. Prerequisites: CLAS 23 or equivalent expertise in Greek. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in Greek Poetry",
      "classCode": "CLAS 169",
      "description": "Occasional courses in selected authors or genres for advanced students. Possible topics: Lyric, Homeric Hymns, or Pindar. Prerequisites: CLAS 23 or equivalent expertise in Greek. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in Greek Prose",
      "classCode": "CLAS 170",
      "description": "Occasional courses in selected authors or genres for advanced students. Possible topics: Thucydides, Aristotle, or Marcus Aurelius. Prerequisites: CLAS 23 or equivalent expertise in Greek. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "11A. and 12A. Cultures & Ideas I and II",
      "classCode": "CLAS 11A",
      "description": "A two-course sequence focusing on a major theme in human experience and culture over a significant period of time. Courses emphasize either broad global interconnections, or the construction of Western culture in its global context. Courses will address significant texts, ideas, issues, and events in their historical context from a humanistic perspective. Classics topics include Friendship: Ancient and Modern, Gods and Mortals, Heroes and Heroism, Sports and Spectacle, Creating Barbarians, and Ancient Spaces. Successful completion of C&I I (CLAS 11A) is a prerequisite for C&I II (CLAS 12A). (4 units each quarter)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "11A. and 12A. Cultures & Ideas I and II",
      "classCode": "CLAS 12A",
      "description": "A two-course sequence focusing on a major theme in human experience and culture over a significant period of time. Courses emphasize either broad global interconnections, or the construction of Western culture in its global context. Courses will address significant texts, ideas, issues, and events in their historical context from a humanistic perspective. Classics topics include Friendship: Ancient and Modern, Gods and Mortals, Heroes and Heroism, Sports and Spectacle, Creating Barbarians, and Ancient Spaces. Successful completion of C&I I (CLAS 11A) is a prerequisite for C&I II (CLAS 12A). (4 units each quarter)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Greek Civilization",
      "classCode": "CLAS 19",
      "description": "An introductory overview that synthesizes central aspects of ancient Greek civilization to provide a general understanding of ancient Greek culture and its contributions to later societies. Topics include mythology, religion, history, theater, politics, art, philosophy, and gender. This course can be taken either as a lower-division course or as an upper-division course (CLAS 119). (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Legacy of Rome",
      "classCode": "CLAS 20",
      "description": "What have the Romans ever done for us? This course provides an overview of ancient Roman culture and the fundamental role the Romans played in shaping western civilization. We will pay particular attention to the legacy of Roman civilization that continues to influence contemporary culture, whether for good or ill. Topics include the republicanism, concepts of time, literature, architecture, religion, and the purpose of education itself. And the aqueducts. And the wine. (The course has no prerequisites.) This course can be taken either as a lower-division course or as an upper-division course (CLAS 120). (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Word Workshop: Scientific Etymology",
      "classCode": "CLAS 41",
      "description": "This class will help you build your vocabulary and acquire the tools to figure out words that you do not already know by teaching you the basics of English word formation and some common Greek and Latin morphemes. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Greek and Roman Heroes in Hollywood",
      "classCode": "CLAS 42",
      "description": "Movies have fascinated their audiences with Greek myths for decades but are notorious for playing fast and loose with the ancient stories. This course examines some cinematic versions of classical figures such as Perseus or Heracles and the classical sources they adapt for modern audiences. (topic varies). (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "History of Philosophy: Classical and Medieval",
      "classCode": "CLAS 51",
      "description": "Beginnings of Western philosophy. Representative philosophers of the Greek and Medieval traditions, with attention to their historical milieu and their relevance to contemporary thought. Also listed as PHIL 14. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to the Arts of Ancient and Medieval Europe",
      "classCode": "CLAS 52",
      "description": "Visual analysis of the ancient and medieval world. Topics may include the relationship between Greek art and politics, Imperial Roman art, propaganda, Pompeian wall painting, early Christian art, the origins of Islam, and the function and culture of pilgrimage in the Middle Ages. Also listed as ARTH 21. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ancient Monuments",
      "classCode": "CLAS 60",
      "description": "An exploration of the nature of political and religious authority: that is, the relationship between the individual, the state, and the divine—in three different ancient civilizations. The primary “texts” for this investigation are the representative monuments of each culture: the pyramids of Egypt (particularly the Old Kingdom), the Temple of Solomon in Jerusalem in the united monarchy, and the Parthenon. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ancient Empires",
      "classCode": "CLAS 61",
      "description": "The course examines the construction and manipulation of identities in three ancient empires—Achaemenid Persian, Seleucid, and Roman—as well as cultures on their peripheries. Both literary and material sources are used to study how the inhabitants and rulers of these large, cosmopolitan empires defined themselves. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Sex and Religion in Ancient Greece: Ancient Eros",
      "classCode": "CLAS 63",
      "description": "This course explores the various manifestations and significance of sex (“Bittersweet Eros”), both the deity and the divinely-inspired passion, in ancient Greece. While this course focuses on examining the socio-religious significance of Aphrodite and her son, Eros (the Roman Cupid), it is also designed to provoke an open conversation about responses to sex found in relevant contemporary religious expression. Assignments are derived from Greek and Roman literature, philosophy, historiography, and art, as well as from contemporary magazines, scholarly journals and books, religious documents, and movies. Participation in class discussion is mandatory for this seminar-style course. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Classical Mythology",
      "classCode": "CLAS 65",
      "description": "Principal gods and heroes of Greek and Roman antiquity: their stories, significance, and pictorial representations. Implications of myth in society and possible origins of myth. Important background for European and English literature. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ancient Mediterranean Religious Traditions",
      "classCode": "CLAS 5",
      "description": "An introduction to the beliefs and practices of religious traditions in the ancient Mediterranean world. Students will examine polytheistic, henotheistic, and monotheistic religions and their interactions with each other, particularly in cosmopolitan societies. Attention will be paid to ancient Egypt, Israel, Greece, Carthage, Rome, and the Celtic world.",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ancient Greek Religion",
      "classCode": "CLAS 67",
      "description": "Consideration of the differing attitudes and expectations of polytheisms and monotheisms, and of religious expression in the context of classical Greek cult and ritual. Readings are drawn from a wide variety of literary, historical, philosophical, and epigraphical texts. Also listed as HIST 16. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ancient Roman Religion",
      "classCode": "CLAS 68",
      "description": "Examination of religious practices, institutions, and beliefs of the ancient Romans. Special consideration of interconnections in Roman religiosity between the acts/beliefs of individuals and the concerns of the state. Concludes with philosophic mysticism, magic, mystery religions, and Christianity. Also listed as HIST 17. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Classics in Cinema",
      "classCode": "CLAS 75",
      "description": "A survey of the classical world through selected dramatic films illustrating sequentially the cultural and political history of ancient Greece and Rome. Close viewings of popular films, with comparative reference to sources and practice in the techniques of film criticism. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Hercules!",
      "classCode": "CLAS 83",
      "description": "While many people today may first encounter Hercules through the popular Disney movie, TV shows, or comic books, the original character of Hercules in the ancient world is much more complex than many of these current depictions convey. Not only powerful and brave, but also an adulterer and murderer, Hercules (or Heracles, as he is known to the ancient Greeks) struggles both literally and metaphorically on his path to immortality. Our class will examine various ancient and modern depictions of Hercules in order to understand the full picture of a truly complicated figure. This course can be taken either as a lower-division course or as an upper-division course (CLAS 183). (5 Units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Cultural Heritage and Collecting Antiquities",
      "classCode": "CLAS 86",
      "description": "This course will study the history of museums, art collecting, and art theft in the ancient world. It will explore the concept of cultural heritage to discuss what is shown in collections, and to critique what museums are choosing to show to the viewing public, and what this means for civic life. This class is an exploration of art collecting in the ancient world, the heritage of ancient art, and its presentation and preservation for the edification of the viewing public in our modern world. This course can be taken either as an upper-division course (CLAS 186) or lower-division course (4 units).",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Archaic Greek History: Scientists and Spartans",
      "classCode": "CLAS 107",
      "description": "If society collapsed, do you have the know-how to survive? Over three thousand years ago, this same question confronted the ancient Greeks. This course on Archaic Greek history examines how the Greeks used inquiry and experimentation to deal with problems such as climate change, epidemic disease, and economic decline. Students will study how these innovations forced the Greeks to confront social issues such as income inequality and environmental destruction that continue to have profound relevance. By studying the Greek response to such issues, students will be better able to think about the relationship between technology and society in the contemporary world. Also listed as HIST 107 (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ancient Greece",
      "classCode": "CLAS 108",
      "description": "A survey of Hellenic history from the Bronze Age to Alexander the Great. Emphasis on the rise and fall of the polis as an independent social, cultural, and political community. Also listed as HIST 108. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Hellenistic Age",
      "classCode": "CLAS 109",
      "description": "A cultural, social, and political review of Alexander the Great’s conquests and their Hellenistic ramifications through the reign of Egypt’s Cleopatra VII. Also listed as HIST 109. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Roman Republic",
      "classCode": "CLAS 110",
      "description": "A political, military, social, and cultural review of the rise and fall of the most successful state the West has ever known. Also listed as HIST 110. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Roman Empire",
      "classCode": "CLAS 111",
      "description": "A political, social, and cultural survey of the Roman Empire beginning with Augustus and tracing changes in Rome from the development of the Roman Empire as a world state to the development of Christianity as a world religion. Also listed as HIST 111. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Democracy Under Siege: Ancient Athens and Modern America",
      "classCode": "CLAS 113",
      "description": "This course will trace the fate of the Athenian democracy from the archaic period through the Hellenistic Age (circa 594 to 307 BCE). It will cover the foreign and domestic policies of Athens through this period, and cover both the problems and the opposition to democracy by non-democratic polities, as well as by those opponents of democracy who lived in Athens itself. Although the United States is a republic and not a democracy in the Athenian mode (which in fact, was the intent of our republic’s founders), the U.S. in the 21st century is facing comparable opposition both domestically and in the realm of foreign affairs to those which confronted the ancient Athenians. Parallels between the world of the 4th century BCE and the 21st century will not only be noted, they will be emphasized through readings and class discussions. Also listed as HIST 132. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Democratic City",
      "classCode": "CLAS 114",
      "description": "Do you have what it takes to negotiate with royalty, save a city from famine, foil a tyrannical coup, and be home by dinner? In this course, students will study the nature and history of ancient democracy. They will actively engage with this subject by taking on the role of citizens in a model Greek democracy. They will need to collaborate, persuade, and debate in order to solve case studies based on the problems ancient democracies faced. Students will gain hands-on experience with direct democratic problem-solving while learning about the history of ancient democracy and its relationship to contemporary politics. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Greek Art",
      "classCode": "CLAS 116",
      "description": "The course examines Greek art, architecture, and material culture from the Bronze Age through the Roman period. Special attention is paid to the development of art and architecture within political, historical, and cultural contexts. Also listed as ARTH 104. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Art and Architecture of the Roman Republic and the Early Empire",
      "classCode": "CLAS 117",
      "description": "Chronological survey of artistic development in Republican and Imperial Rome. Related issues include the influence of Greek and Etruscan art, the relationship between political ideology and public art programs, and the impact of improved materials on building design. Cross-listed with AAH 106. This course satisfies the advanced writing requirement. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Greek Civilization",
      "classCode": "CLAS 119",
      "description": "An introductory overview that synthesizes central aspects of ancient Greek civilization to provide a general understanding of ancient Greek culture and its contributions to later societies. Topics include mythology, religion, history, theater, politics, art, philosophy, and gender. This course can be taken either as an upper-division course or lower-division course (CLAS 19). (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Legacy of Rome",
      "classCode": "CLAS 120",
      "description": "What have the Romans ever done for us? This course provides an overview of ancient Roman culture and the fundamental role the Romans played in shaping western civilization. We will pay particular attention to the legacy of Roman civilization that continues to influence contemporary culture, whether for good or ill. Topics include republicanism, concepts of time, literature, architecture, religion, and the purpose of education itself. And the aqueducts. And the wine. (The course has no prerequisites.) This course can be taken either as an upper-division course or lower-division course (CLAS 20). (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Love and Relationships in Classical Antiquity",
      "classCode": "CLAS 141",
      "description": "An examination of the many forms of loving and erotic relationships as they pertained to the Greek and Roman quest for the best human life. Readings in Euripides, Sappho, Ovid, Plato, Aristotle, and many others from genres of poetry, essays, letters, tragedy, and philosophy. Also listed as PHIL 141D and WGST 133. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Heretics and Holy Wars",
      "classCode": "CLAS 144",
      "description": "Exploration of religion and the Mediterranean region between 235 and 622 CE. Attention will be paid to monasticism, pilgrimage, heresy, philosophy, and the relationships between the church and state, communities and individuals, and individuals and the divine. Also listed as HIST 106. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Age of Socrates",
      "classCode": "CLAS 146",
      "description": "A study of Socrates as both a historical and literary figure, with special attention to his political and cultural context, and to our three chief sources on him and his philosophical activities: Aristophanes, Plato, and Xenophon. Also listed as PHIL 141. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ancient and Modern Ethics",
      "classCode": "CLAS 149",
      "description": "This course will engage theories and issues related to normative ethics (generally speaking, the study of ethics concerned with right or wrong conduct, good or bad actions, and virtuous or vicious character). In this class, we will discuss a variety of both ancient and modern texts dealing with ethical theories/approaches and their practical applications, in order to productively debate the merits of these approaches and the plausibility of their applications to contemporary ethical issues, such as animal rights, eugenics, abortion, and torture.(5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ancient Science and Technology: Atoms, Aqueducts, and Alchemy",
      "classCode": "CLAS 171",
      "description": "This course examines the development of science and technology in the ancient Mediterranean, with a focus on Greek city-states, Hellenistic kingdoms in the age of Alexander the Great and Cleopatra, and the Roman Empire. The creation and evolution of ancient scientific disciplines are studied, as is the use of technology in construction, warfare, agriculture, religion, manufacturing, and medicine. Both ancient theory and practice are examined within their cultural, social, political, and economic context. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Bath and Body Works (in Ancient Rome)",
      "classCode": "CLAS 173",
      "description": "This course will consider the developments of baths and bathing in ancient Roman culture, examining how scientific and technological innovations in the construction of bath buildings contributed to the proliferation of daily public bathing. Other topics of consideration include the motivations behind building baths, the methods and technologies required to bring water to and from the baths, and connections to similar modern facilities. This course satisfies the STS requirement. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Topics in Classical Literature",
      "classCode": "CLAS 175",
      "description": "Occasional courses or seminars in specialized topics. Consult current course descriptions for details. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Topics in Ancient History",
      "classCode": "CLAS 176",
      "description": "Occasional courses or seminars in specialized topics. Consult current course descriptions for details. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Topics in Ancient Philosophy",
      "classCode": "CLAS 177",
      "description": "Occasional courses or seminars in specialized topics. Consult current course descriptions for details. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Topics in Classical Culture",
      "classCode": "CLAS 178",
      "description": "Occasional courses or seminars in specialized topics. Consult current course descriptions for details. Also listed as HIST 129. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Laughter and the Shape of Comedy",
      "classCode": "CLAS 180",
      "description": "Students will investigate the nature and psychosocial functions of laughter, with a particular eye to the Greek and Roman roots of Western comedy. Readings will focus on comedic plays by Aristophanes, Plautus, and Terence, supplemented with readings of ancient and modern humor theorists and psychologists. For each playwright, we will also analyze one popular recent movie and other modern analogs of humor and plot structures. Students will demonstrate their understanding of the material by collaborating over the course of the term to write, costume, and perform original plays in imitation of the ancient playwrights. Also listed as THTR 181a. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Classical Tragedy",
      "classCode": "CLAS 181",
      "description": "Representative works of the principal Greek tragic playwrights: Aeschylus, Sophocles, and Euripides. Features of the tragic genre, its origins, and the conventions of its performance. Also listed as THTR 181. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Myth on the Democratic Stage",
      "classCode": "CLAS 182",
      "description": "This course explores how ancient Greeks used tragic and comic plays to help people become better democratic citizens and whether their plays can still help us become better democratic citizens today. We will study selected Greek comedies, which directly mocked social and civic practices, and selected Greek tragedies, which used myths to guide audiences to think more critically about democratic politics, their own civic responsibilities, and the communal consequences of their traditional values. Students will use the ancient Greek plays to enrich their understanding of current events. We will also watch and discuss Miranda’s Hamilton as a modern analog. Satisfies the Civic Engagement requirement. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Hercules!",
      "classCode": "CLAS 183",
      "description": "While many people today may first encounter Hercules through the popular Disney movie, TV shows, or comic books, the original character of Hercules in the ancient world is much more complex than many of these current depictions convey. Not only powerful and brave, but also an adulterer and murderer, Hercules (or Heracles, as he is known to the ancient Greeks) struggles both literally and metaphorically on his path to immortality. Our class will examine various ancient and modern depictions of Hercules in order to understand the full picture of a truly complicated figure. This course can be taken either as a lower-division course (CLAS 83) or as an upper-division course. (5 Units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Classical Mythology in the Western Tradition",
      "classCode": "CLAS 184",
      "description": "An exploration of some of the ways authors from the classical period through the 20th century have manipulated Greek myths for their own poetic and political purposes. Focus is on the legends surrounding the fall of Troy, with particular attention paid to the shifting character of perhaps the two most protean figures in Greek mythology: Odysseus and Helen. Texts include selections from Homer’s Iliad, Vergil’s Aeneid, and Dante’s Inferno, and un-excerpted works by Homer, Sophocles, Euripides, Gorgias and Isocrates, Ovid, Seneca, Dictys and Dares, Shakespeare, Tennyson, Giraudoux, modern Greek poets, and the Coen brothers. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Gender in Antiquity",
      "classCode": "CLAS 185",
      "description": "Investigation into the representation and the reality of gender in social, economic, political, and religious contexts in the classical world. Also listed as WGST 157. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Cultural Heritage and Collecting Antiquities",
      "classCode": "CLAS 186",
      "description": "This course will study the history of museums, art collecting, and art theft in the ancient world. It will explore the concept of cultural heritage, to discuss what is shown in collections and to critique what museums are choosing to show to the viewing public and what this means for civic life. This class is an exploration of art collecting in the ancient world, the heritage of ancient art, and its presentation and preservation for the edification of the viewing public in our modern world. This course can be taken either as an upper-division course or lower-division course (CLAS 86) (5 units).",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Greek Justice and Democratic Juries",
      "classCode": "CLAS 188",
      "description": "This course explores the ancient Greek roots of modern American justice. We study how the classical Athenian court system worked, as well as how the Greeks used poetry, tragedy, comedy, mythology, and philosophy to develop and discuss the concepts of justice that underpinned their court systems. We focus particularly on the nature of justice, the rationale for jury trials, and the role law plays in a democratic state, comparing and contrasting classical Greek and modern American ideas. At the end of the course students run trials using classical Athenian court structure and judicial philosophy to try controversial cases currently working their way through the U.S. federal court system. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Capstone I",
      "classCode": "CLAS 197A",
      "description": "Biweekly seminar on various topics, combined with initial research for senior thesis. The identification of a coherent topic of thesis, development of a detailed outline, and preparation of an annotated bibliography, are conducted under the active direction of a member of the classics faculty. Prerequisites: For senior classics majors only; permission of instructor and department chair required. (3 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Capstone II",
      "classCode": "CLAS 197B",
      "description": "Continuation of seminar in addition to supervised completion of the final draft, public oral presentation, and defense of the senior thesis. Prerequisites: CLAS 197A. For senior classics majors only; permission of instructor and department chair required. (3 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Internships/Practica",
      "classCode": "CLAS 198",
      "description": "Independent work outside, and in coordination with, the department. By permission only.",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Reading/Research",
      "classCode": "CLAS 199",
      "description": "Individually designed programs of reading or research, in Latin, Greek, or classics (e.g., literature in translation or culture). Prerequisites: Available to advanced students. Permission of instructor and department chair required. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    }
  ]