[
    {
      "courseName": "1A. and 2A. Critical Thinking & Writing I and II",
      "classCode": "ENVS 1A",
      "description": "A two-course themed sequence featuring study and practice of academic discourse, with emphasis on critical reading and writing, composing processes, and rhetorical situation. The second course will feature more advanced study and practice of academic discourse, with additional emphasis on information literacy and skills related to developing and organizing longer and more complex documents. Topics may include the rhetoric surrounding current environmental issues, and environmental criticism with a variety of media. Successful completion of CTW I (ENVS 1A) is a prerequisite for CTW II (ENVS 2A). (4 units each quarter)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "1A. and 2A. Critical Thinking & Writing I and II",
      "classCode": "ENVS 2A",
      "description": "A two-course themed sequence featuring study and practice of academic discourse, with emphasis on critical reading and writing, composing processes, and rhetorical situation. The second course will feature more advanced study and practice of academic discourse, with additional emphasis on information literacy and skills related to developing and organizing longer and more complex documents. Topics may include the rhetoric surrounding current environmental issues, and environmental criticism with a variety of media. Successful completion of CTW I (ENVS 1A) is a prerequisite for CTW II (ENVS 2A). (4 units each quarter)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "My Environment",
      "classCode": "ENVS 5",
      "description": "What is the environment and how do I interact with it? This course explores fundamental questions about our relationship with the natural world, centered around five themes: My Earth, My Water, My Food, My Pollution and My Climate. Through assignments and labs, students gain experience in geological reasoning and interpretation; groundwater and surface water resource management; ecological footprinting; air pollution impacts; and more. Laboratory 15 hours. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "11A and 12A. Cultures & Ideas I and II",
      "classCode": "ENVS 11A",
      "description": "A two-course sequence focusing on a major theme in human experience and culture over a significant period of time. Courses emphasize either broad global interconnections or the construction of Western culture in its global context. Themes may include nature, imagination, and environment in myth, art, literature, music, drama, story, philosophy, and sacred text. Successful completion of C&I I (ENVS 11A) is a prerequisite for C&I II (ENVS 12A). (4 units each quarter)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "11A and 12A. Cultures & Ideas I and II",
      "classCode": "ENVS 12A",
      "description": "A two-course sequence focusing on a major theme in human experience and culture over a significant period of time. Courses emphasize either broad global interconnections or the construction of Western culture in its global context. Themes may include nature, imagination, and environment in myth, art, literature, music, drama, story, philosophy, and sacred text. Successful completion of C&I I (ENVS 11A) is a prerequisite for C&I II (ENVS 12A). (4 units each quarter)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Environmental Biology L&L",
      "classCode": "ENVS 21",
      "description": "In this course, students will gain an understanding of how humans are affecting life on Earth. Students will explore the principles of evolution and ecology in contexts ranging from agriculture and forestry, to pollution mitigation and public health. Lecture and laboratory exercises will prepare students for upper-division science courses required for the Environmental Science and Environmental Studies major or minor. Laboratory 30 hours. Saturday field trip may be required. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Environment and Society",
      "classCode": "ENVS 22",
      "description": "This course presents environmental studies as an interdisciplinary academic field focused on society-nature relations. In part one, we examine population, markets, institutions, ethics, hazards, political economy, and social construction as core social science perspectives. Part two uses these approaches to explain nature-society puzzles related to agriculture, food, energy, climate change, biodiversity, forests, oceans, and land use change. In each of these cases, we focus on specific objects and their context (e.g., tuna in the Pacific Ocean or redwood trees in Northern California), as we analyze human-environment interdependence, and assess the complex causes, consequences, and potential responses to change processes occurring at the local, national, and global scales. We will also consider the personal and collective dimensions of social change through environmental civic engagement. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Earth Systems L&L",
      "classCode": "ENVS 23",
      "description": "This course will investigate the workings and complexities of the Earth system, including the interactions, synergies, and feedbacks that link the geologic, oceanic, hydrologic, and climate system. Building on basic physical and chemical principles, students will study how continents, soils, oceans, freshwater reservoirs, and the atmosphere were formed, which processes are taking place to change them, and how they are affected by human action. Lecture and laboratory exercises will prepare students for upper-division science courses required for the Environmental Science and Environmental Studies major or minor. Laboratory 30 hours. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "World Geography",
      "classCode": "ENVS 50",
      "description": "Provides an understanding of world geography through an appreciation of contemporary global problems in different world regions. Broad topics that will be covered include globalization, demographic trends, economic development and underdevelopment, human-environment interactions, changing cultures, and geopolitics. These topics will illustrate the distribution of political, cultural, socioeconomic, and physical processes and features around the world and will be covered at local, regional, and global scales. Also listed as ANTH 50. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Deep Dive",
      "classCode": "ENVS 77",
      "description": "Intended for first-year and sophomore Environmental Studies and Environmental Science majors, but open to any student. A mini-immersion into an environmental topic, enlivened by hands-on experiences, weekend field trips, exceptional activities, and close interactions with faculty. Course themes vary by year and quarter. 2 units, P/NP.",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Environmental Thought",
      "classCode": "ENVS 79",
      "description": "Using an ecocritical approach, this course examines primary and secondary sources related to the evolution of environmental thought in modern times. The work of seminal thinkers from within the conservation movement, environmental philosophy, and environmental sciences is explored, as well as the social and economic influences in post-World War II America that created the modern environmental movement. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Sustainability 101",
      "classCode": "ENVS 95",
      "description": "This course provides credit for participating in efforts at Santa Clara University to heighten awareness of sustainability; engaging actively in opportunities that pursue the university’s sustainable mission; and reflecting on these experiences. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Capstone",
      "classCode": "ENVS 100",
      "description": "This class will bridge the internship and capstone experience.  The first part of the class will focus on the internship and professional development, including a reflection and analysis of experiences and organizations, documentation of learning, and forward-looking vocational discernment. The second part will help students prepare for their winter quarter capstone experiences, through identifying appropriate methods, creating a proposal of work to be done during winter quarter, and submitting projects for human subjects approval.  Prerequisites: Senior class standing; completion of internship; ENVS 21, 22, and 23; completion of (or concurrent enrollment) in ENVS 116 and an approved statistics course for the major. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Capstone Seminar",
      "classCode": "ENVS 101",
      "description": "A  project-based research course that integrates both the Environmental Studies and Environmental Science majors. Student transdisciplinary teams work as consultants to address a wide range of environmental issues, with the goal of  providing research  of value to a community partner or agency.  Topics may include ecology,  water resources, sustainable planning, and food, water, and climate justice.  Students develop skills in project management, research, collaboration, and communication with diverse audiences. Teams present their research findings at a poster session for ESS faculty and community stakeholders at the end of the quarter. Prerequisites: Senior class standing; completion of internship; ENVS 21, 22, and 23; completion of ENVS 116 and an approved statistics course for the major. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Environmental Statistics L&L",
      "classCode": "ENVS 110",
      "description": "A course in applied statistics for environmental researchers. Students gain training in quantitative analysis, statistical coding,  experimental design, and hypothesis testing. Theory and concepts are covered in lectures and readings. Laboratory sessions provide practical experience using the statistical programming language  R to analyze and visualize datasets. Examples used in lectures and lab assignments are derived from the fields of biology, public health, and environmental studies and sciences. Laboratory 30 hours. Also listed as BIOL 160. Prerequisite: BIOL 1C or ENVS 21. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Mixed Methods for the Environment",
      "classCode": "ENVS 111",
      "description": "This project-based course will introduce and develop skills for the conduct of qualitative environmental research, drawing from several social science approaches, especially ethnography, participant observation, focus groups, interviews, and surveys. Students will learn strategies for conducting effective literature reviews and learn how to conduct interviews, write field notes, and be effective participant observers. Prerequisite: ENVS 22. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to GIS",
      "classCode": "ENVS 116",
      "description": "Spatial analysis helps to address critical questions in the environmental field, such as whether environmental burdens are disproportionately affecting disadvantaged communities or where habitat conservation measures might be most effective. Geographic Information Systems (GIS) can be used to overlay different kinds of spatial data for mapping and analysis. The class will use a project-based approach to generating, querying, analyzing, and displaying GIS data utilizing industry standard software. Prerequisite: ENVS 21, 22 or 23; or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Intermediate GIS",
      "classCode": "ENVS 117",
      "description": "This course is focused on using spatial analysis to solve urban and environmental problems, using R and RStudio, along with other open source tools. It also explores spatial data in augmented reality (AR) and virtual reality (VR). The course includes a strong emphasis on data management, including acquiring, cleaning, and visualizing data. Students will be introduced to new spatial analysis techniques, and will apply these techniques through labs, homework assignments, and a final project. Given the importance of replication in science, students will also create and document code that may be useful for other researchers. Prerequisite: ENVS 116. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Environmental Law and Regulation in the United States",
      "classCode": "ENVS 120",
      "description": "Introduction to the U.S. legal system’s approach to environmental protection. Topics include the roles of legislatures and environmental agencies at the federal, state, and local levels; the independent role of the judiciary in establishing environmental law; and specific statutes such as the Clean Air Act. Students evaluate questions of federalism, uses of economic incentives, and relationships between environmental protection and economic growth. Prerequisite: ENVS 22. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Environmental Politics and Policy",
      "classCode": "ENVS 122",
      "description": "This course analyzes environmental governance in the last half century and focuses on the social dimensions and impacts of policy change. Part one introduces environmental politics and policymaking processes in the context of history, different justifications, and competing interests and values. Part two compares regulatory approaches and policy tools, as we examine key pieces of environmental legislation in the United States, including the Clean Air, Clean Water, National Environmental Policy, and Endangered Species Acts. This section focuses on air pollution; climate policy and waste; addressing issues of local, state, and national regulations, environmental justice, scientific uncertainty, representation, and the politics of policy change. Part three examines the rise of sustainability agendas, highlighting the roles of civil society and corporate firms. A concluding discussion explores how civic engagement and innovations could accelerate transitions towards a greener economy. Students compose policy memos, participate in debates, and collaborate with their peers in a team-based role-playing simulation game. Also listed as POLI 157. Prerequisite: ENVS 22 or POLI 1. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Water Law and Policy",
      "classCode": "ENVS 124",
      "description": "Introduction to the legal and regulatory concepts related to water. Examines rights, policies, and laws, including issues related to water supply and access (water transfers/water markets, riparian and appropriative doctrines), flood control, water pollution and quality (the Clean Water Act, EPA standards, instream flows for fish), and on-site stormwater management/flood control. A focus on California water law and policy is complemented with some national and international case studies. Also listed as CENG 124. Prerequisite: ENVS 22 recommended. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Urban and Environmental Planning",
      "classCode": "ENVS 128",
      "description": "This course uses the lens of sustainability to examine major issues in land use, transportation, housing, economic development, public health, environmental planning and restoration, environmental justice, and public participation. Students in this course will critically evaluate the role of urban planning in solving challenges including climate change, racial injustice, and economic inequality. In doing so, this course will also offer students the opportunity to engage with real-world planning issues in the Bay Area and beyond. Prerequisite: ENVS 22 recommended. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Environmental Education",
      "classCode": "ENVS 131",
      "description": "An introduction to the study and practice of environmental education. Surveys philosophies, theories, and methods of environmental education with a special emphasis on techniques for engaging K–12 students in outdoor settings to maximize learning of environmental concepts and to improve the students’ understanding of their personal connections to nature. Introduces creative ways that we, as current or future teachers, parents, or mentors can use active study of and interactions with the outdoor environment to engage young people in the study of environmental systems and basic biological, chemical, and physical sciences. A portion of the course will be taught in field-based settings. Students will participate in service-learning projects that will give them practical experience planning and leading environmental education lessons. Especially valuable for future teachers. Prerequisite: ENVS 21, 22, or 23 recommended. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Agroecology L&L",
      "classCode": "ENVS 132",
      "description": "The goal of agroecology is to reduce the negative impact of farming while meeting the food needs of the world. This course examines in a holistic framework the ecological principles and processes that govern agroecosystem productivity and stability. A wide variety of agricultural management practices and designs are assessed and discussed in terms of their capacity to sustain long-term production. Students will also learn research methods that explore the resilience and sustainability of agroecosystems. One required weekend field trip. Laboratory 30 hours. Prerequisite: ENVS 21. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Food, Culture, and the Environment",
      "classCode": "ENVS 136",
      "description": "Exploration of the history and impact that food choices have made on human societies and the environment. Several foods that are staples in the world today, like sugar or corn have significantly affected the environment, patterns of land use, economies (both local and global), cuisine, and the meaning of meals and food sharing. Class topics illustrate the regional and historical impacts of plant and animal domestication, the industrial revolution, and industrial agriculture on people and the environment.  Case studies highlight the cultural significance of foods, food choices, and agricultural economies. Also listed as ANTH 140. Prerequisite: ENVS 22 recommended. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Historical Ecology",
      "classCode": "ENVS 137",
      "description": "Historical ecology investigates the historical relationships between cultures and their environments. Students are introduced to methods used to reconstruct past environments. They draw on these, as well as historical documents, maps, and land use information, to learn how to reconstruct the historical ecology of the Santa Clara Valley. Also listed as ANTH 145. Prerequisite: ENVS 22 recommended. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Environmental Biology in the Tropics",
      "classCode": "ENVS 141",
      "description": "This summer course examines tropical biology and ecology and their relationship to issues of sustainable development. The course includes 1.5 weeks of instruction at SCU, and 3.5 weeks of field study in Costa Rica. Particular emphasis on tropical ecology, community ecology, reforestation and restoration ecology, sustainable agriculture and fair trade, and ecotourism. Taught in conjunction with ANTH 197. Enrollment by application via International Programs. Prerequisite: ANTH 1 or BIOL 1C or ENVS 21. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Writing for the Environment",
      "classCode": "ENVS 143",
      "description": "This course examines a current topic in the environmental humanities, varying from quarter to quarter. Past themes have included “Environmental Hope,” “Environmental Apocalypse,” and “Writing for the Birds.” Exploration of environmental literature coupled with intensive writing practice in formats including personal essays, nature writing, discourse analysis, and ecocriticism. Prerequisite: Junior or senior standing.  (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Natural History of Baja L&L",
      "classCode": "ENVS 144",
      "description": "Examines the natural history of Baja California Sur, with emphasis on the taxonomy of marine and terrestrial organisms, the ecology of desert and coastal ecosystems, and the biogeography of the peninsula. Meets twice a week in winter quarter and culminates in a 10-day spring break trip to the Sierra de la Laguna region and the Isla Espiritu Santo complex. Students will become familiar with desert, riparian, beach, mangrove, and rocky intertidal habitats, develop field observation and species identification skills, and explore local conservation challenges. Laboratory 30 hours. Prerequisites: BIOL 1C or ENVS 21 or permission of instructor. Enrollment by application only. Travel fees required. Also listed as BIOL 144. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Environmental Technology L&L",
      "classCode": "ENVS 145",
      "description": "A hands-on lab course covering a variety of technologies, from planetary monitoring to biomimicry, from climate adaptation and mitigation to geoengineering. Addresses “bleeding edge” as well as more traditional technologies that enhance both human welfare and environmental quality in developed and developing countries. Students will explore how technology is used to monitor and assess the planet, investigating a range of sensors and spatial scales. Students will also examine solar energy approaches, ranging from photovoltaic arrays to solar thermal plants to passive solar designs. Prerequisites: ENVS 21 and 23; or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Agriculture, Environment, and Development: Latin America",
      "classCode": "ENVS 146",
      "description": "Offers a cross-disciplinary examination of the prospects for “sustainable development” in rural areas of Latin America. Students will use diverse points of view to look at interactions between poverty, development, and environmental degradation. While there is no single, universally accepted definition of sustainable development, a central goal of this course is that each student will come away with the ability to understand the key elements that distinguish different discourses on this subject. Prerequisite: ENVS 22. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "International Environment and Development",
      "classCode": "ENVS 147",
      "description": "Examines the intersection of environment and development in the developing world. Students will explore meanings and measures of development as well as international institutions that influence development and environmental policy. Conceptual frameworks for addressing human-environmental relationships, including globalization, famine and hunger, sustainable development, population-poverty interactions, and gender will be explored. Specific topics to be covered include deforestation, water use, conservation and development, oil extraction, and urbanization. Prerequisite: ENVS 22 recommended. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "African Environment and Development",
      "classCode": "ENVS 149",
      "description": "Students will gain an in-depth understanding of Africa’s diversity and dynamism, considering how people and environments have interacted through space and time. We will examine Africa’s social, cultural, economic, political, and environmental systems to understand Africa’s trajectory of development. Also listed as POLI 146. Prerequisite: ENVS 22 recommended. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Political Ecology",
      "classCode": "ENVS 150",
      "description": "Explores political ecology as a field of study and as a critical tool to analyze environmental issues. Focuses on going beyond simplified explanations about environmental problems, tracing environmental change to broader political, economic, and cultural issues. Topics explored will include land degradation, conservation through parks and reserves, land use conflicts, science and power, social movements, urban pollution, and public health. Course readings include case studies from across the globe to examine how political ecology research engages issues and how it offers critical insights needed to address environmental problems. Challenges students to critically examine their own interpretations and understandings of today’s most important environmental issues. Prerequisite: ENVS 22. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Restoration Ecology L&L",
      "classCode": "ENVS 151",
      "description": "The science and practice of restoring degraded ecosystems, from tidal marshes to coral reefs, with an emphasis on California habitats and local management challenges. Students will develop skills in reading scientific literature, interpreting data, and taking field measurements. Students will learn how to monitor the success of restoration projects at meeting the goals of biodiversity and ecosystem function. Laboratory and fieldwork 30 hours. Saturday field trip may be required. Also listed as BIOL 151. Prerequisite: BIOL 1C or ENVS 21. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Conservation Science",
      "classCode": "ENVS 153",
      "description": "Conservation is a scientific enterprise and a social movement that seeks to protect nature, including Earth’s animals, plants, and ecosystems. Conservation science applies principles from ecology, population genetics, economics, political science, and other natural and social sciences to manage and protect the natural world. Conservation is all too often seen as being at odds with human well-being and economic development. This course explores the scientific foundations of conservation while highlighting strategies to better connect conservation with the needs of a growing human population. We will examine whether conservation can protect nature, not from people, but for people. Also listed as BIOL 153. Prerequisite: BIOL 1C or ENVS 21. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Environmental and Food Justice",
      "classCode": "ENVS 155",
      "description": "This course unites two vibrant fields for academic study and arenas for social, political, and ecological action. Environmental justice as a principle affirms the right of all people to healthy livable communities. Environmental injustice occurs when environmental benefits and burdens are unevenly distributed along the lines of identity, including race, class, and/or nationality. Food justice research addresses inequalities in food access and studies the patterns, causes, and solutions associated with increasing hunger and obesity among eaters and the accumulation of environmental costs in agricultural landscapes. After reviewing several seminal studies in environmental and food justice, this class delves into case studies in California and Central America. Learners will conduct a major research project, participate in team-based collaborations, and engage local communities as part of this course. Prerequisite: ENVS 22 or ENVS 79 recommended. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "General Ecology L&L",
      "classCode": "ENVS 156",
      "description": "Quantitative study of the interrelationships of organisms with their biotic and abiotic environments. Emphasis on population dynamics, interspecific relationships, community structure, and ecosystem processes. Laboratory and field work 30 hours, including one weekend field trip. Also listed as BIOL 156. Prerequisites: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Water Resources L&L",
      "classCode": "ENVS 160",
      "description": "This course covers fundamental concepts in hydrology and water resources management such as precipitation, runoff and infiltration, flow in streams and aquifers, floods and droughts, water budgets, water delivery systems, and stream restoration, water cycling, use, treatment, water pollution, and conservation. Interactions between water and human societies, ecosystems, agriculture, natural resources, and climate are explored through domestic and international case studies. Course concepts are reinforced through indoor and outdoor class and laboratory exercises and field trips. Laboratory 30 hours. Prerequisites:  ENVS 23. ENVS 21 and 22 recommended. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Water Security",
      "classCode": "ENVS 161",
      "description": "UN millennium development goals include access to safe drinking water and basic sanitation for all people, yet in many places those have remained an elusive goal. Water security invokes the idea of risk, but also of action, and resonates with governments, managers, academics, donors, activists, and organizations. In this course students analyze frameworks and approaches to water security. Through critical evaluation of the recent literature and principles from the fields of environmental science and studies, students gain perspectives on barriers and solutions to safeguarding access to adequate quantities of acceptable quality water for sustaining livelihoods, ecosystems, and human well-being. Prerequisite: Junior or senior standing.  (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Climate Change: Past to Future L&L",
      "classCode": "ENVS 166",
      "description": "Human-caused changes to the climate system are now widely accepted and expected to have great effects on physical, biological, and human systems from sea level rise to human disease, ocean acidification, and mass extinction. We will explore climate change in three broad units: (1) foundational aspects of the climate system such as Earth’s energy balance, greenhouse effect, carbon cycle, and circulation of the oceans and atmosphere; (2) evolution of the climate system throughout Earth’s history; and (3) impacts, vulnerabilities, and solutions for modern climate change. Students will model Earth’s energy balance; examine Earth’s carbon and water cycles in the field and lab; experimentally determine sea level rise with water isotopes; and use climate models to predict future changes. Lectures and discussions of current scientific literature and government documents will be motivated by student interest. Laboratory 30 hours. Prerequisite: ENVS 23. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Environmental Justice",
      "classCode": "ENVS 170",
      "description": "This course offers an exploration of environmental justice as a social movement and a rapidly developing academic field of study at the intersection of race, class, and environmental policy. Course coverage will unite empirical research, social science theory, and case studies to explore societal inequities in environmental burden and access to natural resources,  as well as avenues for securing rights and inclusive participation. Prerequisite: ENVS 22. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Oceanography",
      "classCode": "ENVS 175",
      "description": "An introduction to the marine environment presenting an integrated overview of the physical, geological, chemical and biological characteristics of the world’s oceans. Case studies from the primary literature will illustrate human influences on the oceans and the importance of ocean processes for the functioning of our planet. The course covers physical principles that determine the nature of oceanic currents, tides, waves and coastlines, as well as marine biological communities, human societies’ use of oceanic resources, and the impacts of marine pollution and climate change. Prerequisites: ENVS 21 and 23. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Energy and the Environment",
      "classCode": "ENVS 180",
      "description": "This course exposes students to the connection between energy resources and human development, public health, and societal inequity. Students explore both  traditional non-renewable supplies (coal, petroleum, natural gas, and nuclear) and renewables (natural gas, nuclear, biomass, wind, solar, hydropower, and geothermal), while recognizing the importance of energy conservation and storage. Students will explore the energy for the United States, comparing visionary scientific research with current and proposed policy strategies. Students will gain an understanding of the vast array of societal and environmental impacts of our energy demands, while defining opportunities and challenges for the future. Prerequisite: ENVS 23 recommended. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Garbology",
      "classCode": "ENVS 185",
      "description": "This class follows the path of our waste products as they are landfilled, burned, treated, recycled, reused, dumped on minority communities, or shipped abroad. Building on basic chemical and biological principles, we explore the ultimate fate of organic and inorganic waste. We look to the past and to other societies to better understand how we got to this throw-away society and what we can learn from past practices and other cultures. We explore sustainable solutions, including new efforts to reduce our waste such as “extended producer responsibility”, design-for-disassembly, green chemistry, and zero waste. Students will also learn how to utilize the “life cycle analysis” approach as a basis for those daily decisions such as paper versus plastic. Prerequisite: ENVS 23 or permission of instructor.  (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Environmental Colloquium",
      "classCode": "ENVS 188",
      "description": "An interdisciplinary research seminar in which invited speakers, representing academia, the private sector, NGOs, and government agencies, present their current work in the field of environmental studies or environmental sciences. Students will engage with the speaker's topic through assigned readings, discussion, and/or short written assignments. This course may be repeated for credit. Graded P/NP only. Prerequisite: ENVS 21, 22 or 23. (1 unit)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Urban Agriculture Practicum",
      "classCode": "ENVS 191",
      "description": "The rise in urban populations, in conjunction with industrial agriculture, has resulted in a disconnect between the public and their food system. Urban farms are diverse spaces that are utilized by a wide variety of groups for food security, food sovereignty, education, and connection to nature. Through lectures and hands-on activities held at SCU’s Forge Garden and Bronco Urban Garden, students will learn practical skills in sustainable urban food production. In addition to their experiential learning placement at a local school garden in downtown San Jose, students will explore urban farming models through field trips and through visits from guest speakers working in urban agriculture in Silicon Valley. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Sustainable Living Undergraduate Research Project (SLURP)",
      "classCode": "ENVS 195",
      "description": "This two-quarter research-based course is designed to promote a culture of sustainability at Santa Clara University and also fulfills the ESS internship requirement.   Students engage in intensive research over the course of winter and spring quarters on projects to support SCU’s Center for Sustainability’s Strategic Plan. (2 units in each of two academic quarters)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in Environmental Studies",
      "classCode": "ENVS 196",
      "description": "Course content and topics vary depending on the professor. (Variable units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in Environmental Science",
      "classCode": "ENVS 197",
      "description": "Course content and topics vary depending on the professor. (Variable units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Environmental Proseminar",
      "classCode": "ENVS 198",
      "description": "A seminar course primarily for sophomore and junior majors intended to permit reflection about vocation; develop job-searching, self-promotion, and networking skills to aid in obtaining an internship or preparing for  research experience; and foster the further development of professional skills. Students are graded P/NP only. Prerequisite: Environmental Studies and Environmental Science majors only; sophomore standing or above. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Reading or Research",
      "classCode": "ENVS 199",
      "description": "Students who want to enroll in 199A or 199B should meet with the faculty supervisor no later than the fifth week of the term preceding the start of the project. Prerequisite: A written description of the proposed project must be presented to the department chair for approval. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Reading in Environmental Science or Environmental Studies",
      "classCode": "ENVS 199A",
      "description": "Detailed investigation based on directed readings on advanced environmental topics, under the close supervision of a faculty member. Prerequisite: Permission of department chair and instructor before registration. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Environmental Research",
      "classCode": "ENVS 199B",
      "description": "Supervised laboratory, field, or other research under the guidance of a faculty member. The goal should be a written report suitable for publication or a conference presentation. Prerequisite: Permission of department chair and instructor before registration. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    }
  ]