[
    {
      "courseName": "Introduction to the Study of Race and Ethnicity in the United States",
      "classCode": "ETHN 5",
      "description": "An introduction to the history and contemporary manifestations of race and ethnicity in the United States, paying particular attention to how race and ethnicity are socially constructed, the intersections of race, gender, and class dynamics, and the institutionalization of racial and ethnic hierarchies. Through critical readings, class discussions, and films, students will have the opportunity to develop a solid academic foundation for understanding racial and ethnic diversity in the United States. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Indigenous/Native American Studies",
      "classCode": "ETHN 10",
      "description": "Interdisciplinary exploration of the diverse experiences and history life of American Indians, Native Americans, and Indigenous people of the Americas. Topics include Native history, sovereignty, politics, economics, education, health, entertainment and recreation, identity, law and government, art, literature, performance, and religion. Explores key debates within Native American studies in relation to identity and identification regarding gender, sexuality, race, class, and ethnicity. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Intro to Indigenous/Native American Literature",
      "classCode": "ETHN 11",
      "description": "Also listed as ENGL 37. For course description see ENGL 37. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Chicana/o/x and Latina/o/x Studies",
      "classCode": "ETHN 20",
      "description": "Since 1996, Latinas/os/xs have constituted the largest racial/ethnic minority population in the United States. Despite the significance of this population, most non-Latinas/os/xs have little knowledge of the history, challenges, and important contributions made by this complex population. This class will begin to remedy that gap in knowledge by introducing students to the history and contemporary struggles of Chicanas/os/xs and Latinas/os/xs in the United States, focusing particular attention on the experiences of the largest groups of Latinas/os/xs today: Mexican Americans, Puerto Ricans, Central Americans, and Cuban Americans. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Intro to Latinx Literature",
      "classCode": "ETHN 21",
      "description": "Also listed as ENGL 36. For course description see ENGL 36. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Sexuality and Spirituality in Latinx and Chicanx Literature and Theologies",
      "classCode": "ETHN 25",
      "description": "For course description see TESP 59. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to African American Studies",
      "classCode": "ETHN 30",
      "description": "Students will engage in major debates about the history, politics, and cultures of communities of African descent living in the United States. Students will examine texts at the cutting edge of interdisciplinary scholarship in African American studies in order to explore the key themes of origins, power, community, identity, and expression that are central to understanding race-related issues. In addition, students will create innovative research projects to help develop positions about the ideology of race, the dynamics of group consciousness, and the significance of collective action, self-determination, and aesthetics to the African American experience. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Gender and African American Lit",
      "classCode": "ETHN 35",
      "description": "Focuses on women writers of the Harlem Renaissance and the intersections of gender, race, and class. Examines paradigms that lead to racial inequity and social injustice, and themes of gender empowerment, miscegenation, colorism, passing, sexuality, and motherhood. Using poetry, short stories, plays, and film, examines how these women engaged in acts of resistance as they sought to rescue themselves from negative stereotypes and redefine themselves in the new world. Also listed as ENGL 35G and WGST 14. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to African American Literature",
      "classCode": "ETHN 36",
      "description": "Also listed as ENGL 35. For course description see ENGL 35. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Asian American Studies",
      "classCode": "ETHN 40",
      "description": "Multidisciplinary survey of Asian Americans including Asian cultural heritage, immigration, and the formation of Asian American communities. Examines worldviews and values, religious beliefs, family and kinship, language, and contemporary community issues of identity, sex roles, stereotyping, employment, and education. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Asian American Literature",
      "classCode": "ETHN 41",
      "description": "Also listed as ENGL 38. For course description see ENGL 38. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Filipino American Studies",
      "classCode": "ETHN 50",
      "description": "Explores mainstream representations of the Filipino American community. Twentieth-century works written by and about Filipino Americans, with an emphasis on four relevant themes: the legacy of Spanish Colonialism and American Imperialism; U.S. politics and the history of Filipino American activism and resistance; problems of identity as it relates to class, gender/sexuality, mixed heritages, and generational differences; and Filipino Americans and popular culture. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to the South Asian Experience in the United States",
      "classCode": "ETHN 51",
      "description": "This course addresses mainstream representations of the South Asian American community. Students will read 20th-century works, written by and about South Asian Americans, with an emphasis on the following relevant themes: the history of South Asian immigrants to the United States; U.S. politics and the history of South Asian American activism and resistance; problems of identity as it relates to class, gender/sexuality, mixed heritages, and generational differences; South Asian Americans and popular culture; and the future of South Asian Americans in the United States and the reverse brain drain to India. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Racial and Ethnic Politics in the U.S.",
      "classCode": "ETHN 55",
      "description": "Examination of the historical and contemporary forms of political organization, political participation and political movements among the major racial and ethnic populations groups in the United States since the 1960s with particular focus on the struggles for power and resistance among African Americans, Chicanas/os/xs and Latinas/os/xs, Asian Americans and American Indian/Native Americans. The necessary elements needed to build and to sustain multiracial coalitions along with an examination of the  political future for communities of color  will be addressed. Also listed as POLI 55. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Feminist Approaches to Disabilities Studies",
      "classCode": "ETHN 59",
      "description": "Also listed as WGST 59.  For course description see WGST 59. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Journalism: Diversity and Community",
      "classCode": "ETHN 60",
      "description": "Also listed as COMM 40EL. For course description see COMM 40EL. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Drama of Diversity",
      "classCode": "ETHN 65",
      "description": "Also listed as THTR 65. For course description see THTR 65. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Literature by American Women Writers of Color",
      "classCode": "ETHN 69",
      "description": "Also listed as ENGL 69A and WGST 15. For course description see ENGL 69A. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Multicultural Literature of the United States",
      "classCode": "ETHN 70",
      "description": "Also listed as ENGL 39 and WGST 16. For course description see ENGL 39. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Iranian American Women Writers",
      "classCode": "ETHN 75",
      "description": "The last two decades have witnessed a surge in texts published by Iranian American women. This course introduces readers to the voices of these women writers through their memoirs, art, fiction, poetry, and films. Through critical readings, class discussions, and films, students will have the opportunity to develop a solid academic foundation for understanding contemporary writings and lived experiences of Iranian American women. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to the Study of the MENA Diaspora",
      "classCode": "ETHN 80",
      "description": "This course is an interdisciplinary survey of the contemporary racialization of the Middle Eastern/North African Diaspora in the US. Through critical readings, class discussions, and films, students will have the opportunity to develop a solid academic foundation for understanding contemporary writings and lived experiences of MENA Americans in the US. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Contemporary Literature from the MENA Diaspora",
      "classCode": "ETHN 81",
      "description": "This course explores the work of contemporary MENA writers in the diaspora through their memoirs, art, fiction, poetry, and films. Through critical readings, class discussions, and films, students will have the opportunity to develop an understanding of contemporary writings that center the lived experiences, the resistance, and the ancestral knowledges of the MENA diaspora. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Historical Fiction & Literary Resistance",
      "classCode": "ETHN 90",
      "description": "In this course, students will engage with a series of novels defined as neo-slave narratives that perform what Toni Morrison has referred to as “literary archeology” through resisting the historical silences around the specific experiences of enslaved women. By the conclusion of the quarter, students will develop an understanding of Black Feminist theory, the genre of the neo-slave narrative, concepts of cultural memory, as well as the historical, political, and social contexts that shaped the production of the primary texts. Also listed as ENGL 34. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "African American Independent Filmmakers",
      "classCode": "ETHN 95",
      "description": "This class provides an in-depth analysis and historical overview of independent African American filmmakers who made significant contributions to the genre of film. We will examine how African American filmmakers used film as a medium to heighten the consciousness of their audience, combat negative stereotypes, give voice to marginalized or underrepresented groups, and raise social awareness about issues affecting their diverse communities. Using film and text, we will read, discuss, and write about paradigms that lead to inequity and injustice. Specifically, we will examine the intersection of gender, race, and class, and note how these dynamics are illustrated in the cinema of African Americans. We will also understand how African American filmmakers were able to rise above adversity and hone and sustain their art, while confronting their myriad oppressions. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Race, Class, and Culture through Film",
      "classCode": "ETHN 96",
      "description": "Explores how filmmakers who are concerned about racism portray the politics, history, and culture of people of African descent. Examines how this medium can humanize subjects who are often objectified and exploited and give voice to communities whose perspectives and opinions have been historically excluded from mainstream discourses. Considers how films can interrogate the physical, cultural, and sometimes, psychological brutality of racist practices, as well as the ways that racism intersects with other forms of marginalization related to class, gender, sexuality, and citizenship. The content, production, and distribution of these cinematic portraits illuminate the political philosophies, hybrid cultures, and emancipating collective action of black communities. Integrates students in faculty research by involving students in a documentary film project about the relationship between the social movements for African liberation and black power. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Race, Class, Gender and Freedom",
      "classCode": "ETHN 100",
      "description": "This course will be devoted to an exploration of the definitions and expressions of freedom within the United States by a variety of groups through the lenses of race, gender and class.  The idea of freedom was present from the time our nation was founded and since then, individuals and groups within American society have claimed authority to define and defend their freedoms.  The main themes will be political freedom (including speech, religion, civil rights, etc.), economic freedom, personal/sexual freedom, and exporting freedom. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Youth and Critical Race Studies",
      "classCode": "ETHN 101",
      "description": "Youth & Critical Race Studies examines the intersections of race/ethnicity and age in U.S. society. The purpose of this course is to examine age and ageism via an intersectional lens that also centers racial formations. We will examine and interrogate the sociocultural construction of childhood/youthhood, as well as its intersections with racism and ageism. We will consider the ways in which race shapes young people’s lived experiences within various contexts and settings, such as school, family and communities, as well as popular culture and media. Additionally, we will engage with other markers of identity and positionality, such as gender, sexuality and class, whilst attending to forms of racism and ageism in shaping youth development, agency and lived experiences. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Decolonial Feminist Epistemologies",
      "classCode": "ETHN 102",
      "description": "Decolonial Feminist Epistemologies engages with Third World and emerging Fourth Wave feminist actions and struggles. In this course we therefore look to past feminist movements and expressions, to understand the present, and carve a vision and humanizing liberatory anti-oppressive and decolonial feminist future. In this course we will engage with decolonial feminist epistemologies – or theories and foundations of knowledge – that are anchored in embodiment, affect (feeling, emotion), community- connection, cultural expression, and most importantly art, performance, and creative subjectivity: decolonial feminist epistemologies in praxis and art! (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Studies in Indigenous/Native American Literature",
      "classCode": "ETHN 111",
      "description": "Also listed as ENGL 137. For course description see ENGL 137. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Indigenous/Native Peoples of the United States and Mexico",
      "classCode": "ETHN 112",
      "description": "Examination of the national policies, ideologies, and attitudes that have shaped the lives of indigenous peoples living along the U.S.-Mexico border. Issues include cultural survival, cultural change, national and individual identity, gender relations, legal and political problems, and intercultural relations. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Indigenous/Native Americans of the United States",
      "classCode": "ETHN 113",
      "description": "Also listed as HIST 180. For course description see HIST 180. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Immigration in the United States",
      "classCode": "ETHN 120",
      "description": "This class examines the history of immigration to the U.S. with a particular focus on the way race and immigration have intersected and the particular experiences of Mexican immigrants  in the 20th and 21st century. We will examine both historical shifts in U.S.-Mexican relations which have impacted immigration in the region and look specifically at several key political issues including: unauthorized immigration, increasing detentions and deportations of immigrants, the effects of globalization on immigration, the rise in immigrant civic participation, immigrant led social and political movements,  the relationship between immigration and national security, and the ongoing efforts to build a just and equitable immigration system. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Chicana/x and Latina/x Feminisms in the U.S.",
      "classCode": "ETHN 125A",
      "description": "This class examines the experiences, thoughts, interests, and ideologies of Chicanas/xs and Latinas/xs in the U.S. paying particular attention to how race, class, gender, sexuality and difference have manifested in their lives, and how women engage, resist, organize and respond to these forces. Utilizing a range of cultural, social, literary, and political analysis the class will highlight the experiences of Mexican American, Central American, Cuban, and Puerto Rican in the 20th and 21 century. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Chicana/o/x Families and Gender Roles",
      "classCode": "ETHN 121",
      "description": "An examination of Chicana/o/x families in the United States. Addresses two general areas in family research: (1) the historical development of Mexican immigrant families and subsequent generations of communities and families of Mexican Americans, and (2) a life-cycle analysis of families with a specialized focus on gender roles and relations. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Chicana/o/x Communities in the United States",
      "classCode": "ETHN 122",
      "description": "Examination of the development of the social, cultural, political, and economic structures that shape Chicana/o/x communities in the United States. Themes include the evolution of barrios, the historical and contemporary impact of Mexican land grants, ghettoization, education, gangs, employment, and the political economy. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Chicana/o/x Experience",
      "classCode": "ETHN 123",
      "description": "An examination of the major issues in the Chicana/o/x experience dealing with historical and contemporary topics. Themes such as race, identity and culture, immigration, community, family, gender, gangs, historical interpretations and the Chicana/Chicano movements will be examined. Politics and socioeconomic conditions including the farmworker movement and educational concerns will be addressed. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Latinx Literature and Cultural Studies",
      "classCode": "ETHN 124",
      "description": "Also listed as ENGL 136. For course description see ENGL 136. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Latinas/os/xs in the United States",
      "classCode": "ETHN 125",
      "description": "This class examines the history and politics of Latinas/os/xs in the U.S. with a particular focus on the experiences of the largest ethnic groups within this population; namely Mexican Americans, Puerto Ricans, Salvadorans, Dominicans, and Cuban Americans. Throughout the class we will compare and contrast their experiences being mindful of the intersecting differences of ethnicity, race, sex, gender, class, and age that alter the composition and opportunities of these communities. The class will highlight the political development of these populations, focusing particular attention on their relationship to both European and American colonization and expansion, patterns of immigration and incorporation, discrimination and obstacles to political empowerment, and mobilization for change. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Chicana/x and Latina/x Feminisms in the U.S.",
      "classCode": "ETHN 125A",
      "description": "This class examines the experiences, thoughts, interests, and ideologies of Chicanas/xs and Latinas/xs in the U.S., paying particular attention to how race, class, gender, sexuality and difference have manifested in their lives and how women engage, resist, organize and respond to these forces. Utilizing a range of cultural, social, literary, and political analysis the class will highlight the experiences of Mexican American, Central American, Cuban, and Puerto Rican in the 20th and 21 century. Also listed as WGST 141. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Latina/o/x Immigrant Detention and Incorporation in the Age of Terrorism",
      "classCode": "ETHN 126",
      "description": "This class will examine shifts in immigration politics with specific focus on the largest population of immigrants in the United States, namely Latinas/os/xs. In the course of this examination, we will pay particular attention to changes occurring after 1996 and the increasing scrutiny of both documented and undocumented immigrants that has led to surges in the numbers of immigrants detained, apprehended, incarcerated, and deported. We will be mindful of the gendered, class, and racialized dynamics at work in the development and execution of new immigration policy, and we will examine the effect of these shifts on concepts of citizenship. In the end, the course will compel students to consider the moral, political, and legal implications of an immigration policy focused disproportionately on enforcement and challenge them to find comprehensive alternatives. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Race and Mass Incarceration",
      "classCode": "ETHN 127",
      "description": "This course is an introduction to the development and contemporary expansion of the Prison-Industrial Complex, with particular attention to the disproportionate incarceration of individuals of color. Through critical readings, class discussions, and films, students will have the opportunity to develop a solid academic foundation for understanding contemporary discourses on mass incarceration. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Race and Mass Incarceration",
      "classCode": "ETHN 127H",
      "description": "This course is an introduction to the development and contemporary expansion of the Prison-Industrial Complex, with particular attention to the disproportionate incarceration of individuals of color. Through critical readings, class discussions, and films, students will have the opportunity to develop a solid academic foundation for understanding contemporary discourses on mass incarceration. Also listed as Honors 20 (open only to Honors program) (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Mexican American Literature",
      "classCode": "ETHN 128",
      "description": "Also listed as SPAN 133. For course description see SPAN 133. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Mexican Popular Catholicism and Gender",
      "classCode": "ETHN 129",
      "description": "From the perspective of the sociology of religion, this course contextualizes the lives of Chicanas/Mexicanas in Mexican popular Catholic tradition, practices, and belief system with particular attention to race, class, gender, and sexuality. This course repositions feminist analysis from a brief acknowledgement of the influence of Mexican popular Catholicism in the lives of Chicanas/Mexicanas to a much more encompassing critical analysis of exactly how Catholicism influences women’s everyday experiences. Through the use of case studies and secondary research, students will explore the creative and complex ways Chicanas/Mexicanas participate in the workforce, in politics, in public life, and at home as people of faith. Also listed as RSOC 139 and WGST 152. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Studies in African American Literature",
      "classCode": "ETHN 130",
      "description": "Also listed as ENGL 135. For course description see ENGL 135. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "African American Autobiography",
      "classCode": "ETHN 130A",
      "description": "This course will survey African and African American memoirs and autobiographies from arrival in the Americas to the present. Beginning with slave narratives, we will examine relationships between race and writing by asking: What role has writing by African Americans played in the long fight for political freedom and equality? How has that writing changed over time to reflect the different social and political needs of its historical moment? How has that writing been shaped by different ways of thinking about race? How has race, in turn, been shaped or constructed by that writing? And how do representations of gender, sexuality and class participate in a literary construction of race? We will explore how these representations respond to and interact with the “majority culture’s” efforts to define race in a different set of terms. We will focus throughout on autobiography as a site where this struggle over definition takes place—where African American writers have reappropriated and revised words and ideas that had been used to exclude them from both American literary history and America itself. Course requirements include active engagement with readings, discussions, and writing assignments. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "In memory of Toni Morrison",
      "classCode": "ETHN 131",
      "description": "In memory of Toni Morrison, students will spend the quarter weeks sitting with her work. Through close readings of her fiction, essays, speeches and interviews, we will work to develop a complex and nuanced understanding and appreciation of her critical interventions to American literature and beyond. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "August Wilson’s Twentieth Century",
      "classCode": "ETHN 131A",
      "description": "In this course, students will closely engage with August Wilson’s canon of ten plays that centered the lived experiences of Black people and spanned the twentieth century. Through critical readings of the plays, class discussions, and viewings of performances, students will explore the influence of the Blues, the Black Arts Movement, theories of magical realism and cultural memory as well as develop a critical understanding of Wilson’s major contributions to American theatre and beyond.  (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The History of Hip-Hop",
      "classCode": "ETHN 132",
      "description": "As Chuck D of Public Enemy once said, “Rap both dictates and reflects.” This course will examine the historical contexts and diasporic flows that have shaped (and been shaped by) one the most important cultural forms on the planet. We will examine the multicultural roots/routes of rap and hip-hop from its West African bardic traditions to Caribbean and African American oral traditions; study the development of rap as a musical genre extending from soul, funk, and disco styles; analyze the musical and verbal traits of rap music as exemplary of an urban street/hip-hop aesthetic; discuss its influence on musical technology (i.e., sampling) and cultural influences in the mainstream; investigate concepts of authenticity as well as philosophical and political ideologies; review controversies and debates concerning rap music’s articulations of race, gender, and sexuality; and examine the global impact of hip-hop culture. Musical examples and video documentaries will be used in conjunction with class lectures, discussion, and presentations by guest artists. Also listed as MUSC 132. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "African American Art",
      "classCode": "ETHN 132A",
      "description": "Also listed as ARTS 146.  For course description, see ARTS 146. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Malcolm and Martin",
      "classCode": "ETHN 133",
      "description": "This course explores the lives, philosophies, and political activism of Malcolm X and Martin Luther King Jr. In an effort to complicate the violence/non-violence paradigm, which has often pitted the two men as political opponents, this course seeks to uncover the long trajectory of the philosophical development and political activism of both men through the end of each of their lives, in 1965 and 1968 respectively. Both figures’ lives and activism are situated within the black freedom movement of the 20th century, which was both transnational and global. As such, this course attempts to locate these two figures within various iterations of black nationalism, civil right activism, anti-colonialism, and Black Power. Also listed as HIST 168. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "African Americans in Postwar Film",
      "classCode": "ETHN 135",
      "description": "This course examines the presence of African Americans in mainstream Hollywood films during the postwar period. How did Hollywood representations of African Americans change after World War II? What shifts and continuities occurred during the postwar period? And how did those changes reflect the ebbs and flows of civil rights activism through the 1970s? The goal of this course is to gain a deeper understanding of broader social and historical change by engaging the politics of race through a core aspect of American popular culture. Also listed as HIST 185. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Black Theatre",
      "classCode": "ETHN 136",
      "description": "An exploration of the contributions black artists have made to enrich the American theatre as playwrights, actors, designers, and directors. Also listed as ENGL 129 and THTR 161. For course description, see THTR 161. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "African American Pursuit of Freedom",
      "classCode": "ETHN 137",
      "description": "Also listed as HIST 155. For course description, see HIST 155. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Black Migration in the World",
      "classCode": "ETHN 138",
      "description": "Also listed as HIST 157. For course description, see HIST 157. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Black Girl Magic",
      "classCode": "ETHN 138A",
      "description": "This course will explore African American women’s history and celebrate their many triumphs through racial and gender oppression in American society.  The course will be a space to critically engage Black women’s literature and theory on race and processes of racialization in the United States. The course highlights the ways that Black women have challenged dominant conceptualizations of race through critically reflecting on their lived experiences and rigorously interrogating seemingly “race-less” concepts like geography, mobility and humanity.  Course requirements include active engagement with readings, discussions, and writing assignments. Also listed as HIST 181. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Asian American Women",
      "classCode": "ETHN 141",
      "description": "An examination of Asian American women from a historical and contemporary framework within U.S. society. Focuses on the struggle for identity and adjustment in the first generation and the conflicts with subsequent generations of Asian American women. Analyzes two major themes: (1) the interplay of gender identity formation and conflict, both in the family and in the paid labor force; and (2) the development of individual and collective survival strategies. Also listed as WGST 111. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Asian American Communities",
      "classCode": "ETHN 142",
      "description": "An examination of selected topics affecting Asian Americans in the United States. Issues include the changing nature of communities, community institutions, anti-Asian violence, occupational glass ceilings, higher education, political mobilization, gender relations, identity formation, and the new patterns of Asian immigration. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Asian Americans in the Media",
      "classCode": "ETHN 144",
      "description": "This course will explore historical and contemporary representations of Asian Americans in the media, with a particular emphasis on cinema. Starting with the era of silent film and through an analysis of race, ethnicity, gender, and class, we will examine how Asian Americans have been portrayed on the screen over time, as well the ways they have participated in Hollywood and independent productions as both performers and filmmakers. Class lectures and readings will address the social contexts of these productions and provide tools for interpreting visual culture. By studying media as sites of knowledge, we will develop a critical understanding of how ideas of and about Asian Americans are constructed, perpetuated, and contested. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Studies in Asian American Literature",
      "classCode": "ETHN 145",
      "description": "Also listed as ENGL 138. For course description see ENGL 138. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Civil Rights and Anti-Colonial Movements",
      "classCode": "ETHN 149",
      "description": "This course examines the connections between two historical developments often treated separately: the U.S. civil rights struggle and African anti-colonial movements. By placing these two movements in a transnational framework, the course explores the global challenge to the racialized world order of the 19th and early 20th century. How did the civil rights struggle gain momentum in the aftermath of World War II? What was the longer history and role of “black nationalism” and Pan-Africanism in the transnational struggle? What were the connections between the civil rights movement and contemporary independence movements in Africa and Asia? One of the central goals of the course is to show how we can expand our understanding of U.S. history by reaching beyond the interaction between the U.S. government and other nation-states to examine political and cultural change. Also listed as HIST 153. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Urban Education and Multiculturalism",
      "classCode": "ETHN 150",
      "description": "This course takes a critical multicultural approach to understanding urban education, encouraging a connection between theory and personal experience and observations. With a focus on schools in large urban contexts, this course centralizes the experiences of low-income students of color. Race and class will be two critical lenses with which we will examine (1) the historical context of educational inequality, (2) current issues of educational inequity, and (3) the movement towards educational justice. Students should leave the course with a stronger understanding of the social and historical foundations of U.S. education. (5 units)  Also listed as CHST 106.",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Race, Class, and Gender in the United States",
      "classCode": "ETHN 151",
      "description": "Also listed as SOCI 153 and WGST 115. For course description see SOCI 153. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Multiracial Identities",
      "classCode": "ETHN 152",
      "description": "This course focuses on multiracial identity constructs in African American and Asian American literature. Using journey as a metaphor, the course seeks to define “movement” and “place” in contexts where physical, spiritual, voluntary, or forced journeys contribute to the transformative possibilities of race, class, gender, and identity. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Minority Politics in the United States",
      "classCode": "ETHN 153",
      "description": "Also listed as POLI 153. For course description see POLI 153. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Women of Color in the United States",
      "classCode": "ETHN 154",
      "description": "Explores the historical and present-day issues for women of color in the United States inclusive but not limited to key topics such as sexuality, family, work, media, and activism. Students will examine the impact of racism, sexism, heterosexism, and classism on African American, Asian American, Chicana/x and Latina/x, and American Indian/Indigenous/ Native American women in the United States. Using an interdisciplinary approach, students will also investigate their shared experiences as well as their differences. Also listed as WGST 112. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Racism in the United States",
      "classCode": "ETHN 155",
      "description": "Multidisciplinary study of racism in the United States. Its historical manifestations from the arrival of Europeans in North America to contemporary times; its psychological and political dimensions; and its impact on U.S. culture, law, and economy. Also listed as HIST 187. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Intersectionality: Principles and Praxis",
      "classCode": "ETHN 154A",
      "description": "How do categorical identities, including race, gender, class, sexuality, disability, etc., work together to create our lived experiences? What is the use of intersectionality as a buzzword, or public concept, in contemporary struggles for social recognition, integration, and equity?  This course is an introduction to thinking about intersectionality, as a theoretical frame, a description of lived experience, and method of praxis. It will examine the history and application of intersectionality from black women's movements of the 1970s, to its codification in legal theory, to current scholarship and activism that have intersectionality and intersectional experiences at their core. Also listed as WGST 125 & SOCI 126. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Race, Gender, Class, and the College Experience",
      "classCode": "ETHN 157",
      "description": "How do we understand our experiences in college? Explores student experiences in higher education by using lenses that focus on race, gender, and class. Activities, self-reflection, lecture, and discussion will be used to explore student identity, the history of higher education, college access and retention, campus climate, and student development. Also listed as WGST 114. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Race, Gender, and Politics in the News",
      "classCode": "ETHN 158",
      "description": "Also listed as COMM 168A and WGST 117. For course description see COMM 168A. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Race, Gender, and Public Health in the News",
      "classCode": "ETHN 159",
      "description": "Also listed as COMM 164A and WGST 116. For course description see COMM 164A. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Documentary Making for Social Justice",
      "classCode": "ETHN 160",
      "description": "This creative course provides students the opportunity to write, dissect, and produce their own 10-minute documentaries that are committed to social justice. In addition to producing their own films, students will examine how documentary filmmakers use film as a medium to heighten the consciousness of their audience, combat negative stereotypes, give voice to marginalized or underrepresented groups, and raise social awareness about issues affecting their diverse communities. Reading film as “text”—complete with their own arguments, aesthetic concerns, social, political, and historical influences—we will understand how documentaries are used to illuminate disparities or confront issues of inequity and injustice. Specifically, we will examine the intersection of gender, race, class, spirituality, and sexuality, and note how these dynamics function in film to enlighten our global community. Writers in this course will be moved from idea to script and, ultimately, film. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Creating Diverse College-Going Communities",
      "classCode": "ETHN 161",
      "description": "In this course, students will develop an understanding of diversity issues in college access, reflect on their own experiences, utilize this knowledge to develop a workshop curriculum to enhance college-going, and then implement this curriculum in high school classrooms as a community-based learning opportunity. This course introduces students to the background of colleges and universities in the United States, (including history, institutional types, and diverse student representation), then explores the many factors that influence college access and experiences in college (including class, race, gender, first-generation college student status, financial aid, and admissions processes). Students will reflect on their own college application and selection process and their experiences in college. Using this knowledge, students will engage in community-based learning (CBL) in which they provide college-related tutoring, mentoring, and workshops for high school students. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Diversity and the Media",
      "classCode": "ETHN 162",
      "description": "This course focuses on the complex, changing, dynamic, and powerful relationships between dominant and underrepresented groups in society, the mass media, and broader social contexts; and discusses media representations of social groups, contexts of media production, and media use among underrepresented groups. The concepts of hegemony, power, social construction, and intersectionality are vital for understanding these relationships, and vital for the course. The course connects to the field of cultural studies in that it focuses on the everyday uses of symbolic forms and aims to make students aware of, and sensitive to, some of the dynamics connected with media images, symbolic power, and the production of meaning in today’s world. Students are encouraged to formulate, question, and put into context, their own versions of reality. Also listed as COMM 121A. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Multiracial Communities in Central California",
      "classCode": "ETHN 163",
      "description": "This course will examine the process of racialization in various communities throughout California and uncover how various ethno-racial groups within these communities live, work, and thrive together in their specific locales. This course will begin by interrogating definitions of community, spatial geography, political economy, as well as attempting to understand social attitudes about race and racism. Then we will examine various cities as case studies to understand the different ways multiracial communities formed. The end goal is to understand the nuances of how multiracial communities, both urban and rural, developed and inscribed meaning onto the geography of California. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Popular Music, Race, and American Culture",
      "classCode": "ETHN 164",
      "description": "Also listed as MUSC 134. For course description see MUSC 134. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Community-Based Research Methods",
      "classCode": "ETHN 165",
      "description": "Provides students with the epistemological, theoretical and ethical foundations for engaging in community-based research methodologies with ethnically and culturally diverse communities. Students will examine decolonizing and anti-oppressive methodologies toward engaging in social justice and participatory action research. This course is designed to equip students with the skills and abilities to engage in community-based, action-oriented and collaborative research projects. The goal is for students to think critically and reflexively, while examining, reflecting and re/deconstructing how research methods and knowledge are reproduced. More specifically, this course engages students in community-based projects where knowledge is co-produced in collaboration with communities of color, who are most affected by social structural issues, and well positioned to identify and address injustices through direct-actions and/or deconstructing systems of power and oppression. This course is exclusively for ethnic studies majors and minors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Race and Religion in the United States",
      "classCode": "ETHN 166",
      "description": "Also listed as RSOC 184. For course description see RSOC 184. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Race and Inequality",
      "classCode": "ETHN 167",
      "description": "Also listed as SOCI 175. For course description see SOCI 175. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Contemporary Struggles of Writers of Color",
      "classCode": "ETHN 168",
      "description": "This course centers the voices of writers of color in the U.S. Students will explore what is made possible through literature by examining a variety of genres. Through critical readings, class discussions, and film screenings, students will have the opportunity to develop a complex understanding of the contemporary issues addressed by writers of color in their novels. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Gender, Sexuality & Social Movements in the 20th century U.S.",
      "classCode": "ETHN 169",
      "description": "Also listed as HIST 119 and WGST 168. For course description see HIST 119. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Immigrant Businesses in the United States",
      "classCode": "ETHN 170",
      "description": "Also listed as SOCI 150. For course description see SOCI 150. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Immigrant Communities",
      "classCode": "ETHN 171",
      "description": "Also listed as SOCI 180. For course description see SOCI 180. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Whiteness Studies in the 21st Century",
      "classCode": "ETHN 172",
      "description": "Explores the impact of immigration to the United States, particularly the effect of the immigration reform law of 1965 that resulted in large increases in immigration to the United States particularly from Latin America and Asia. This wave of immigrants and their U.S.-born children have significantly changed the fabric of American society. Examines case studies of immigrants and the second generation from Cuba, Mexico, Nicaragua, Vietnam, and Haiti using a comparative sociological perspective. Also listed as HIST 183. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Decolonizing Music Education",
      "classCode": "ETHN 173",
      "description": "Also listed as MUSC 114. For course description see MUSC 114. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Educational Inequality, Racism and Resistance",
      "classCode": "ETHN 174",
      "description": "This course critically examines the connection between educational inequality, racism and resistance from a multicultural perspective.   Encouraging students to view racism beyond isolated incidents by individuals, this course will expose racial inequality in schools as sustained by laws and formal institutions. In this course, students will be exposed to both theory and research that explore concepts including race and racism, racial microaggressions, stereotype threat, racial battle fatigue, internalized racism, and resistance. Students will examine the extent to which these forces impact multiple minority communities in K-16 contexts, as well as community efforts for social justice. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Black Power",
      "classCode": "ETHN 175",
      "description": "This course explores the history of Black Power by examining the philosophical positions and plans of action that defined this branch of the Black Freedom Movement. As Black Power activists sought to fight racism and achieve liberation by asserting Black political, cultural, and economic autonomy, the course therefore centers critiques of capitalism, political organizing, community empowerment, and artistic expression as articulated and practiced by Black Power activists throughout the 20th century.  (5 Units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Race & Sex in Modern America",
      "classCode": "ETHN 176 – Interracial Intimacy",
      "description": "Also listed as HIST 105. For course description see HIST 105(cross-listed with HIST 105 effective Spring 2023). (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Race and World War II",
      "classCode": "ETHN 178",
      "description": "World War II stands as one of the most explosive moments in U.S. and global history in the 20th century because of the myriad ways the conflict influenced the postwar world. The United States emerged from the war as the premiere global superpower in terms of combined military, diplomatic, and financial supremacy. However, the United States found itself under increased scrutiny due to its history and maintenance of structural or institutionalized racism. In the midst of military and ideological conflict against the Nazi regime in Germany, and addressing the claims of civil rights and anti-colonial activists, the United States became a composite site of the tensions that defined a democratic society struggling with ongoing racism. This reading seminar explores these tensions, which were exacerbated by the rise of anti-racist perspectives in the anthropological and biological sciences just preceding the war. The assigned readings and discussions engage these phenomena in order to properly explore the significance of “race” in the World War II era. Also listed as HIST 178. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Race, Voting, Campaigns, and Elections",
      "classCode": "ETHN 180",
      "description": "This class examines how the traditional vehicles of American political participation – namely voting, campaigns, and elections – have been racialized throughout American history and the particular impacts and responses among African Americans and Latinas/os/xs. As part of this examination we look closely at the participation of racial and ethnic minorities in various forms of electoral activity (as both voters and candidates), we analyze enduring obstacles to their political empowerment (both structural and resource constraints), and highlight efforts to remove those barriers. A critical examination of the upcoming national elections will feature prominently throughout this course and students will have the opportunity to examine local elections more closely through an original research project designed to study the intersection of race and voting in San Jose, California. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Seminar - Women of Color in the United States",
      "classCode": "ETHN 184",
      "description": "Explores the historical and present-day issues for women of color in the United States inclusive but not limited to key topics such as sexuality, family, work, media, and activism. Students will examine the impact of racism, sexism, heterosexism, and classism on African American, Asian American, Chicana/x and Latina/x, and American Indian/Indigenous/Native American women in the United States. Using an interdisciplinary approach, students will also investigate their shared experiences as well as their differences. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Seminar  in U.S. Racial and Ethnic Politics",
      "classCode": "ETHN 185",
      "description": "Selected topics in U.S. politics. Also listed as POLI 195DW. This course has Diversity and Advanced Writing components. Prerequisites: POLI 153; CTW 1&2 for the Advanced Writing component. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Seminar - Contemporary Latina/o/x Immigration Issues",
      "classCode": "ETHN 186",
      "description": "This class creates a seminar version of ETHN 120 Mexican Immigration to the U.S. (see description above) by covering the same topics but focusing outcomes on producing original student research (either paper or project) and highlighting student participation and presentations through weekly readings and other course material. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Seminar - Youth Activism & Contemporary Social Movements",
      "classCode": "ETHN 187",
      "description": "Youth Activism & Contemporary Social Movements examines current social movements catalyzed and led by young people. The course specifically examines youth community organizing and youth activism as a context for social justice work that parallels, yet differs from the Civil Rights Movements of the 1960s. In this course, we engage an intersectional analysis of race, age, and other markers of identity and difference. Through this perspective we will examine the contributions and role of young people in contemporary 21st-century social movements from the 1960s through the present that have contributed to contemporary youth activisms. Within a U.S. context, social movements have often been grouped into three different time periods: the Civil Rights Movement, the post-1960s, and the contemporary social movements. The thematic organization of these periods reflects the different struggles experienced by social groups within societies, and the varied approaches and mechanisms through which communities and young people organized. Although these social movements and waves of political activism are characterized and shaped by the timeframe of their unique sociopolitical context, there are similarities across all periods. One similarity across these timeframes concerns the significant leadership and activism of young people—children, youth, and young adults—to resist and challenge structures of power and systems of oppression. From Anti-Islamophobia movements; to Black Lives Matter; to Undocumented & Unafraid; to LGBTQ and women’s rights movements; to the institutionalization of ethnic studies curricula and the ending of gun violence in schools—all of these movements underscore the power of young people. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Seminar - Civil Rights and Anti-Colonial Movements",
      "classCode": "ETHN 188",
      "description": "This course examines the connections between two historical developments often treated separately: the U.S. civil rights struggle and anti-colonial movements across the globe. By placing these movements in a transnational framework, we will explore through readings and the production of an original research paper, the global challenge to the racialized world order of the modern world. What was the longer history and role of Black Nationalism and Pan-Africanism in the transnational struggle? How did women contribute to the longer struggle against white supremacy in both the United States and colonial world? The central goal of the course is to expand our understanding of anti-racist struggle by moving beyond the formal boundaries of the United States of America in the 20th and 21st centuries.(5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Peer Educator in Ethnic Studies",
      "classCode": "ETHN 194",
      "description": "Peer educators in ethnic studies work closely with a faculty member to help students in an ethnic studies course understand course material, think more deeply about course material, benefit from collaborative learning, and/or to help students enjoy learning. Enrollment is by permission of the instructor. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Seminar in Critical Race Theory and Methods",
      "classCode": "ETHN 195",
      "description": "This course serves as an introduction to several of the methods used in advanced research in critical race and ethnic interdisciplinary research. The course will examine a range of theoretical and applied topics in research methods including: debates in epistemology, objectivity, interdisciplinary, and intersectionality; how to formulate a research design (from research question to presentation of findings); and applications of specific methodological tools such as interviews, participant observation, biography, content analysis, experimental design, and survey research. This course is exclusively for ethnic studies majors and minors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Praxis and Practitioners of Critical Racial and Ethnic Studies",
      "classCode": "ETHN 196",
      "description": "This class is organized around a weekly presentation, lecture, film, or other engagement by a local, regional, or national practitioner or activist whose work addresses key challenges and social justice work within racial and ethnic minority communities. The weekly presentation will serve as a focal point for critical analysis of contemporary racial and ethnic studies including pressing social, cultural, economic, and political issues within historically marginalized racial minority communities. Students are required to attend the weekly presentation and write a short reflection that summarizes their individual experiences.  Prerequisite: Any Ethnic Studies course . (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in Ethnic Studies",
      "classCode": "ETHN 197",
      "description": "(1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Internship",
      "classCode": "ETHN 198",
      "description": "(2–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Research",
      "classCode": "ETHN 199",
      "description": "A capstone senior project that involves intensive reading and writing, culminating in a final research project under the direction of an ethnic studies faculty member Prerequisite: Written approval by the director of the Ethnic Studies Department prior to registration. (2–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    }
  ]