[
    {
      "courseName": "The Nature of Mathematics",
      "classCode": "MATH 4",
      "description": "For students majoring in arts and humanities. Topics chosen from set theory, logic, counting techniques, number systems, graph theory, financial management, voting methods, and other suitable areas. Material will generally be presented in a setting that allows students to participate in the discovery and development of important mathematical ideas. Emphasis on problem solving and doing mathematics. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Finite Mathematics for Social Science",
      "classCode": "MATH 6",
      "description": "Introduction to finite mathematics with applications to the social sciences. Sets and set operations, Venn diagrams, trees, permutations, combinations, probability (including conditional probability and Bernoulli processes), discrete random variables, probability distributions, and expected value. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Statistics",
      "classCode": "MATH 8",
      "description": "Elementary topics in statistics, including descriptive statistics, regression, probability, random variables and distributions, the central limit theorem, confidence intervals and hypothesis testing for one population and for two populations, goodness of fit, and contingency tables. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Precalculus",
      "classCode": "MATH 9",
      "description": "College algebra and trigonometry for students intending to take calculus. Does not fulfill the undergraduate Core Curriculum requirement in mathematics. Requires enrollment in weekly lab session - MATH 9L. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Precalculus Lab",
      "classCode": "MATH 9L",
      "description": "Focus on active learning to prepare students for calculus. Does not necessarily coordinate topics with MATH 9 on a weekly basis. Instead, the lab sessions are designed to help students to build overall strength in non-routine problem solving. (1 unit)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Calculus and Analytic Geometry I",
      "classCode": "MATH 11",
      "description": "Limits and differentiation. Methods and applications of differentiation. Ordinarily, only one of MATH 11, 30, or 35 may be taken for credit. Note: MATH 11 is not a suitable prerequisite for MATH 31 or 36 without additional preparation. Prerequisite: MATH 9 or a passing grade on the Calculus Readiness Exam. If MATH 9 is taken, a grade of C- or higher is strongly recommended before taking MATH 11.(4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Calculus and Analytic Geometry II",
      "classCode": "MATH 12",
      "description": "Further applications of differentiation. Integration and the fundamental theorem of calculus. Methods and applications of integration. Only one of MATH 12, 31, or 36 may be taken for credit. Note: MATH 30 and 35 are not suitable prerequisites for MATH 12 without additional preparation. Prerequisite: MATH 11 or equivalent. A grade of C- or higher in MATH 11 is strongly recommended before taking MATH 12. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Calculus and Analytic Geometry III",
      "classCode": "MATH 13",
      "description": "Taylor series, vectors, quadric surfaces, and partial derivatives, including optimization of functions with multiple variables. Prerequisite: MATH 12 or equivalent. Students who have taken MATH 31, MATH 36, or an equivalent course may take MATH 13 after consultation with an instructor.A grade of C- or higher in MATH 12 is strongly recommended before taking MATH 13. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Calculus and Analytic Geometry IV",
      "classCode": "MATH 14",
      "description": "Vector functions, line integrals, multiple integrals, flux, divergence theorem, and Stokes’ theorem. Prerequisite: MATH 13 or equivalent. A grade of C- or higher in MATH 13 is strongly recommended before taking MATH 14. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Series and Differential Equations",
      "classCode": "MATH 23",
      "description": "Sequences, series, and analytic functions. Use of explicit, numerical, and series methods to solve ordinary differential equations. Complex numbers. Only one of MATH 22, 23, or AMTH 106 may be taken for credit. Prerequisite: MATH 13. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Calculus for Business I",
      "classCode": "MATH 30",
      "description": "Differentiation and its applications to business, including marginal cost and profit, maximization of revenue, profit, utility, and cost minimization. Natural logarithms and exponential functions and their applications, including compound interest and elasticity of demand. Study of the theory of the derivative normally included in MATH 11, except trigonometric functions not included here. Ordinarily, only one of MATH 11,30, or 35 may be taken for credit. Note: MATH 30 is not a suitable prerequisite for MATH 12 or 36 without additional preparation. Prerequisite: MATH 9 or a passing grade on the Calculus Readiness Exam. If MATH 9 is taken, a grade of C- or higher is strongly recommended before taking MATH 30. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Calculus for Business II",
      "classCode": "MATH 31",
      "description": "Integration and its applications to business, including consumer surplus and present value of future income. Functions of several variables and their derivatives. Emphasis throughout the sequence on mathematical modeling, the formulation of practical problems in mathematical terms. Only one of MATH 12, 31, or 36 may be taken for credit. Note: MATH 11 and 35 are not suitable prerequisites for MATH 31 without additional preparation. Prerequisite: MATH 30 or equivalent. A grade of C− or higher in MATH 30 is strongly recommended before taking MATH 31. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Calculus for Life Sciences I",
      "classCode": "MATH 35",
      "description": "Modeling with functions, limits, and derivatives. Derivative rules and tools. Applications to the life sciences. Ordinarily, only one of MATH 11, 30, or 35 may be taken for credit. Note: MATH 35 is not a suitable prerequisite for MATH 12 or 31 without additional preparation. Prerequisite: MATH 9 or a passing grade on the Calculus Readiness Exam. If MATH 9 is taken, a grade of C- or higher is strongly recommended before taking MATH 35. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Calculus for Life Sciences II",
      "classCode": "MATH 36",
      "description": "Integration, differential equations, and probability. Applications to the life sciences. Only one of MATH 12, 31, or 36 may be taken for credit. Note: MATH 11 and 31 are not suitable prerequisites for MATH 36 without additional preparation. Prerequisite: MATH 35 or equivalent. A grade of C- or higher in MATH 35 is strongly recommended before taking MATH 36. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Discrete Mathematics",
      "classCode": "MATH 51",
      "description": "Predicate logic, methods of proof, sets, functions, sequences, modular arithmetic, cardinality, induction, elementary combinatorial analysis, recursion, and relations. Also listed as COEN 19. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Abstract Algebra",
      "classCode": "MATH 52",
      "description": "Groups, homomorphisms, isomorphisms, quotient groups, fields, integral domains; applications to number theory. Prerequisite: MATH 51 or permission of the instructor. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Linear Algebra",
      "classCode": "MATH 53",
      "description": "Vector spaces, linear transformations, algebra of matrices, eigenvalues and eigenvectors, and inner products. Prerequisite: MATH 13. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Lower-Division Seminars",
      "classCode": "MATH 90",
      "description": "Basic techniques of problem solving. Topics in algebra, geometry, and analysis. (1–4 units) Note: Although CSCI 10 is not explicitly listed as a formal prerequisite, some upper-division courses suggested for computer science majors may presuppose the ability to write computer programs in some language. A number of upper-division courses do not have specific prerequisites. Students planning to enroll should be aware, however, that all upper-division courses in mathematics require some level of maturity in mathematics. Those without a reasonable background in lower-division courses are advised to check with instructors before enrolling.",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Writing in the Mathematical Sciences",
      "classCode": "MATH 100",
      "description": "An introduction to writing and research in mathematics. Techniques in formulating research problems, standard proof methods, and proof writing. Practice in mathematical exposition for a variety of audiences. Strongly recommended for mathematics and computer science majors beginning their upper-division coursework. MATH 100 may not be taken to fulfill any mathematics or computer science upper-division requirements for students majoring or minoring in mathematics or computer science. Offered on demand. Prerequisites: CTW 1, CTW 2.(5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "A Survey of Geometry",
      "classCode": "MATH 101",
      "description": "Topics from advanced Euclidean, projective, and non-Euclidean geometries. Symmetry. Offered in alternate years. Prerequisite: MATH 13. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Calculus",
      "classCode": "MATH 102",
      "description": "Topics to be chosen from the following:  Open and closed subsets of , the definition of limits and continuity for functions on , the least upper bound property on R, the intermediate and extreme value theorems for functions on , the derivative of a function on  in terms of a matrix, the matrix interpretation of the chain rule, Taylor's theorem in multiple variables with applications to critical points, the inverse and implicit function theorems, multiple integrals, line and surface integrals, Green’s theorem,  Stokes’ theorem, the divergence theorem, and differential forms. Prerequisites: MATH 14, 51, and 53. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Linear Algebra",
      "classCode": "MATH 103",
      "description": "Abstract vector spaces, dimensionality, linear transformations, isomorphisms, matrix algebra, eigenspaces and diagonalization, Cayley-Hamilton Theorem, canonical forms, unitary and Hermitian operators, applications. Prerequisite: MATH 53. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Theory of Functions of a Complex Variable",
      "classCode": "MATH 105",
      "description": "Analytic functions. Cauchy integral theorems, power series, conformal mapping. Riemann surfaces. Offered in alternate years. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Abstract Algebra I",
      "classCode": "MATH 111",
      "description": "Topics from the theory of groups. Offered in alternate years. Prerequisites: MATH 52 and 53. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Abstract Algebra II",
      "classCode": "MATH 112",
      "description": "Rings and ideals, algebraic extensions of fields, and the Galois theory. Offered in alternate years. Prerequisite: MATH 111. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Topology",
      "classCode": "MATH 113",
      "description": "Topological spaces and continuous functions. Separability and compactness. Introduction to covering spaces or combinatorial topology. Offered in alternate years. Prerequisites: MATH 14 and 51 (102 recommended). (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Probability and Statistics I",
      "classCode": "MATH 122",
      "description": "Sample spaces; conditional probability; independence; random variables; discrete and continuous probability distributions; expectation; moment-generating functions; weak law of large numbers; central limit theorem. Pre- or corequisite: MATH 14. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Probability and Statistics II",
      "classCode": "MATH 123",
      "description": "Confidence intervals and hypothesis testing. Maximum likelihood estimation. Analysis of variance (ANOVA) and analysis of categorical data. Simple and multiple linear regression. Optional topics may include sufficiency, the Rao-Blackwell theorem, logistic regression, and nonparametric statistics. Applications. Pre- or corequisite: MATH 53 or permission of instructor, and MATH 122. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Mathematical Finance",
      "classCode": "MATH 125",
      "description": "Introduction to Ito calculus and stochastic differential equations. Discrete lattice models. Models for the movement of stock and bond prices using Brownian motion and Poisson processes. Pricing models for equity and bond options via Black-Scholes and its variants. Optimal portfolio allocation. Solution techniques will include Monte Carlo and finite difference methods. Also listed as FNCE 116, FNCE 3489, and AMTH 367. Prerequisites: MATH 53 or permission of instructor and MATH 122 or AMTH 108. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Logic and Foundations",
      "classCode": "MATH 133",
      "description": "Deductive theories. Theories and models. Consistency, completeness, decidability. Theory of models. Cardinality of models. Some related topics of metamathematics and foundations. Open to upper-division science and mathematics students and to philosophy majors having sufficient logical background. Offered on demand. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Set Theory",
      "classCode": "MATH 134",
      "description": "Naive set theory. Cardinal and ordinal arithmetic. Axiom of choice and continuum hypothesis. Axiomatic set theory. Offered on demand. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Mathematical Models",
      "classCode": "MATH 141",
      "description": "Matching the real world with mathematical structure using such things as differential equations, difference equations, and stochastic processes, at the instructor’s discretion.  Topics related to continuous or discrete models may be selected from topics, including the following: qualitative analysis, simulation, parameter estimation, steady-state analysis, shock waves, random walks, Markov chains, agent-based models, and cellular automata. Offered in alternate years. Prerequisites: MATH 53 and one of MATH 22, 23, and AMTH 106. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Partial Differential Equations",
      "classCode": "MATH 144",
      "description": "Linear partial differential equations with applications in physics and engineering, including wave (hyperbolic), heat (parabolic), and Laplace (elliptic) equations. Solutions on bounded and unbounded domains using Fourier series and Fourier transforms. Introduction to nonlinear partial differential equations. Offered in alternate years. Prerequisite: MATH 14. Recommended: MATH 22 or 23 or AMTH 106. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Optimization I",
      "classCode": "MATH 146",
      "description": "Methods for finding local maxima and minima of functions of multiple variables in either unconstrained or constrained domains: the Hessian matrix, Newton’s method, Lagrangians, Karush-Kuhn-Tucker conditions. Convex sets, convex functions, and convex programming. Methods for determining functions that optimize an objective like maximizing profit or minimizing task completion time: calculus of variations, optimal control, and both deterministic and stochastic dynamic programming. Also listed as CSCI 146. Prerequisites: CSCI 10 (or prior programming experience), MATH 14, and MATH 53. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Optimization II",
      "classCode": "MATH 147",
      "description": "Algorithms for computing local and global optima. Numerical methods for finding local optima, including gradient descent and Nelder-Mead. The simplex method for linear programming and the duality of zero-sum games. Metaheuristics for approximating global optima. Also listed as CSCI 147. Prerequisites: MATH 122 or AMTH 108, and MATH/CSCI 146. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Intermediate Analysis I",
      "classCode": "MATH 153",
      "description": "Rigorous investigation of the real number system. Concepts of limit, continuity, differentiability of functions of one real variable, uniform convergence, and theorems of differential and integral calculus. Offered in alternate years. Prerequisite: MATH 51 and either 102 or 105. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Intermediate Analysis II",
      "classCode": "MATH 154",
      "description": "Continuation of MATH 153. Offered in alternate years. Prerequisite: MATH 153. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ordinary Differential Equations",
      "classCode": "MATH 155",
      "description": "Systems of linear differential equations with constant coefficients. Numerical methods and applications. Autonomous systems, critical points, and stability of linear and nonlinear systems. Elementary Liapunov theory. Existence and uniqueness of solutions. Offered in alternate years. Prerequisite: MATH 53 or permission of instructor. Recommended:  CSCI 10 and either MATH 22 or 23 or AMTH 106. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Numerical Analysis",
      "classCode": "MATH 166",
      "description": "Numerical algorithms and techniques for solving mathematical problems. Linear systems, integration, approximation of functions, solution of nonlinear equations. Analysis of errors involved in the various methods. Direct methods and iterative methods. Also listed as CSCI 166. Prerequisites: CSCI 10 or equivalent, and MATH 53, or permission of the instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Development of Mathematics",
      "classCode": "MATH 170",
      "description": "A selection of mathematical concepts with their historical context. Offered in alternate years. Prerequisite: Upper-division standing in a science major. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Problem Solving",
      "classCode": "MATH 172",
      "description": "Use of induction, analogy, and other techniques in solving mathematical problems. Offered in alternate years. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Differential Geometry",
      "classCode": "MATH 174",
      "description": "Introduction to curves and surfaces. Frenet-Serret formulas, Gauss’ Theorema Egregium, Gauss-Bonnet theorem (as time permits). Offered in alternate years. Prerequisite: MATH 53. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Theory of Numbers",
      "classCode": "MATH 175",
      "description": "Fundamental theorems on divisibility, primes, congruences. Number theoretic functions. Diophantine equations. Quadratic residues. Offered in alternate years. Prerequisite: MATH 52. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Combinatorics",
      "classCode": "MATH 176",
      "description": "Permutations and combinations, generating functions, recursion relations, inclusion-exclusion, Pólya counting theorem, and a selection of topics from combinatorial geometry, graph enumeration, and algebraic combinatorics. Prerequisite: MATH 51. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Graph Theory",
      "classCode": "MATH 177",
      "description": "Selected topics from planarity, connectedness, trees (enumeration), digraphs, graph algorithms, and networks. Offered in alternate years. Prerequisite: MATH 51. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Cryptography",
      "classCode": "MATH 178",
      "description": "History, classical cryptosystems, stream ciphers, AES, RSA, discrete log over finite fields and elliptic curves, and signatures. This course followed by CSCI 181. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Upper-Division Seminars",
      "classCode": "MATH 190",
      "description": "Advanced topics in algebra, geometry, or analysis. Research projects. May be repeated for credit. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Undergraduate Research",
      "classCode": "MATH 192",
      "description": "Research project supervised by a faculty member in the department. Prerequisite: Permission of the professor directing the research must be secured before registering for this course. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Math Education and Social Justice",
      "classCode": "MATH 195",
      "description": "This course will examine issues of social justice surrounding mathematics education in U.S. public schools. Topics include problem solving and pedagogical methods, learning challenges, diversity, accessibility, and educational technology. Students will explore these topics while interacting with local students in high schools that serve students from traditionally marginalized  communities. Students will provide support and guidance to precalculus students and serve as higher education role models, while also gaining insight into public mathematics education issues through personal interactions with teachers and students. Students will learn, reflect, analyze and integrate through their personal interactions, structured written reflections, in-class discussions, and a final project which helps address these issues. MATH 195 satisfies the ELSJ requirement, but does not count towards a math major/minor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Topics",
      "classCode": "MATH 197",
      "description": "Areas of mathematics not ordinarily covered in regularly scheduled courses, often areas of current interest. May be repeated for credit. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Internship/Practicum",
      "classCode": "MATH 198",
      "description": "Guided study related to off-campus practical work experience in mathematics or statistics. Enrollment restricted to majors or minors of the department. Prerequisite: Approval of a faculty sponsor. (1 unit)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Independent Study",
      "classCode": "MATH 199",
      "description": "Reading and investigation for superior students under the direction of a staff member. This can be used only to extend, not to duplicate, the content of other courses. May be repeated for credit. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Computing and Applications",
      "classCode": "CSCI 3",
      "description": "An overview course providing multiple perspectives on computing. Students will learn the structures of computer programming without writing code, gain high-level understanding of important computing systems such as the Internet and databases, and discuss the impact of technology on society. Offered on demand. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Computer Science",
      "classCode": "CSCI 10",
      "description": "Introduction to computer science, and computer programming in Python. Basic programming structures, conditionals, loops, functions, recursion, arrays. Topics relating to the applications of and social impact of computing, including privacy, artificial intelligence, computation in physics, psychology, and biology. Discussion of cryptography, computation through history, networks, hardware, and basic runtime analysis. Includes weekly lab. CSCI 10 may be taken for credit if the student has received credit for COEN 10, but not COEN 11 or a similar introductory programming course, or CSCI 60. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to C++ and Object-Oriented Programming",
      "classCode": "CSCI 60",
      "description": "Basic object-oriented programming techniques using C++: abstract data types and objects; encapsulation. The five phases of software development (specification, design, implementation, analysis, and testing). Memory management and pointers. Includes weekly lab. Prerequisite: A grade of C− or better in CSCI 10 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Data Structures",
      "classCode": "CSCI 61",
      "description": "Specification, implementations, and analysis of basic data structures (stacks, queues, hash tables, binary trees) and their applications in sorting and searching algorithms. Using the Standard Template Library. Runtime Analysis. Prerequisite: A grade of C− or better in CSCI 60 or equivalent. CSCI 61 and COEN 12 cannot both be taken for credit. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Programming",
      "classCode": "CSCI 62",
      "description": "Advanced object-oriented programming and applications of object-oriented programming and data structures. Topics include GUI design, testing and debugging skills, graphs, file processing, inheritance, polymorphism, and design and implementation of large software projects. Topics will be applied primarily in the context of a social network, developed iteratively throughout the quarter. Software development projects will include topics in data science, security, and algorithms. Prerequisite: A grade of C− or better in CSCI 61, COEN 79, or equivalent (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Lower-Division Seminars",
      "classCode": "CSCI 90",
      "description": "Basic techniques of problem solving. Topics in computer science. (1–4 units) Note: Although CSCI 10 is not explicitly listed as a formal prerequisite, some upper-division courses suggested for computer science majors may presuppose the ability to write computer programs in some language. A number of upper-division courses do not have specific prerequisites. Students planning to enroll should be aware, however, that all upper-division courses in computer science require some level of maturity in computer science and mathematics. Those without a reasonable background in lower-division courses are advised to check with instructors before enrolling.",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Computer Simulation",
      "classCode": "CSCI 127",
      "description": "Techniques for generation of probability distributions. Monte Carlo methods for physical systems. Applications of computer models, for example, queuing, scheduling, simulation of physical or human systems. Offered on demand. Prerequisite: CSCI 10 or equivalent (MATH 122 recommended). (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Optimization I",
      "classCode": "CSCI 146",
      "description": "Methods for finding local maxima and minima of functions of multiple variables in either unconstrained or constrained domains: the Hessian matrix, Newton’s method, Lagrangians, Karush-Kuhn-Tucker conditions. Convex sets, convex functions, and convex programming. Methods for determining functions that optimize an objective like maximizing profit or minimizing task completion time: calculus of variations, optimal control, and both deterministic and stochastic dynamic programming. Also listed as MATH 146. Prerequisites: CSCI 10 (or prior programming experience), MATH 14, and MATH 53. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Optimization II",
      "classCode": "CSCI 147",
      "description": "Algorithms for computing local and global optima. Numerical methods for finding local optima, including gradient descent and Nelder-Mead. The simplex method for linear programming and the duality of zero-sum games. Metaheuristics for approximating global optima. Also listed as MATH 147. Prerequisites: MATH 122 or AMTH 108, and MATH/CSCI 146. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Theory of Automata and Languages",
      "classCode": "CSCI 161",
      "description": "Classification of automata, formal languages, and grammars. Chomsky hierarchy. Representation of automata and grammars, BNF. Deterministic and nondeterministic finite state automata. Regular expressions and languages. Push-down automata. Context-free languages. Context-sensitive grammars and linear bounded automata. Recursively enumerable languages. Turing machines; normal forms; undecidability. Prerequisite: MATH 51 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Computational Complexity",
      "classCode": "CSCI 162",
      "description": "Turing machines.  Undecidable problems.  Time- and space-bounded complexity classes.  Reducibility and completeness.  P vs. NP.  Offered in alternate years. Prerequisite: MATH 51. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Theory of Algorithms",
      "classCode": "CSCI 163",
      "description": "Introduction to techniques of design and analysis of algorithms: asymptotic notations and running times of recursive algorithms. Design strategies: brute-force, divide and conquer, decrease and conquer, transform and conquer, dynamic programming, greedy technique. Intractability: P and NP, approximation algorithms. Also listed as COEN 179. Prerequisites: MATH 51; and either CSCI 61 or COEN 12, or equivalents, with a grade of C- or above. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Theory of Algorithms",
      "classCode": "CSCI 164",
      "description": "Advanced techniques for the design, analysis, and implementation of algorithms with an emphasis on graph algorithms and application: routing and shortest paths, network flow, vertex coloring, social network analysis and geometric/topological graph algorithms. Prerequisites: CSCI 163 or COEN 179. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Data Privacy and Algorithmic Fairness",
      "classCode": "CSCI 165",
      "description": "The theoretical foundations of data privacy and algorithmic fairness for applications including machine learning, graph analysis, quantifying bias in statistical models, and socially-aware algorithm design. Emphasis on research skills such as designing project proposals, reading academic papers, presenting and critiquing work-in-progress, and producing a final research project. Prerequisites: MATH 51 and CSCI 10; CSCI 163 and basic probability recommended. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Numerical Analysis",
      "classCode": "CSCI 166",
      "description": "Numerical algorithms and techniques for solving mathematical problems. Linear systems, integration, approximation of functions, solution of nonlinear equations. Analysis of errors involved in the various methods. Direct methods and iterative methods. Also listed as MATH 166. Prerequisites: CSCI 10 or equivalent, and MATH 53 or permission of the instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Computer Graphics",
      "classCode": "CSCI 168",
      "description": "Systematic and comprehensive overview of interactive computer graphics, such as mathematical techniques for picture transformations and curve and surface approximations. Prerequisites: CSCI 10 or equivalent, and MATH 13. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Programming Languages",
      "classCode": "CSCI 169",
      "description": "Comparative study of major classes of programming languages, with particular focus on functional programming. Introduction to theoretical definitions of languages and run-time concerns, with emphasis on strong points and weak points of various languages and on using the appropriate language for a given task. Programs written in several languages (e.g., Python, Java, Scala). Prerequisites: CSCI 61 and MATH 51, or permission of the instructor. Credit will NOT be granted for both CSCI 169 and COEN 171. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Computer Security",
      "classCode": "CSCI 180",
      "description": "Fundamental security topics may include, but are not limited to, security principles, operating system security, access control, memory safety, software and system security, authentication and impersonation, threats and attacks, web security, and network security. Prerequisite: COEN 20. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Applied Cryptography",
      "classCode": "CSCI 181",
      "description": "Hash functions and applications, stream ciphers, time stamping, secret sharing, running time analysis, key management, and cryptocurrencies. Prerequisites: MATH 178 and CSCI 60 or permission from instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Data Science",
      "classCode": "CSCI 183",
      "description": "Data manipulation, analysis, and visualization. Statistical modeling, dimension reduction and techniques of supervised and unsupervised learning. Big data software technologies. Prerequisites: A grade of C- or above in CSCI 61 or equivalent, and MATH 53 and 122, or permission of the instructor. CSCI 169 strongly recommended. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Applied Machine Learning",
      "classCode": "CSCI 184",
      "description": "Introduction to machine learning. Selected topics from supervised and unsupervised learning. Current applications and technologies in machine learning development. Prerequisite: A grade of C- or above in CSCI 183. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Web and Data Mining",
      "classCode": "CSCI 185",
      "description": "Web and data mining paradigms, data pre-processing and analysis, information retrieval and search engines, text analysis, link analysis, ranking, advanced topics. Prerequisites: A grade of C- or above in CSCI 61 or equivalent, and MATH 53 and 122, or permission of the instructor. CSCI 169 or 183 strongly recommended. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Design and Management of Software",
      "classCode": "CSCI 187",
      "description": "Students will learn best practices for the design and implementation of large software projects, including building their own quarter-long programming project. In addition to discussing and enacting the systems development life cycle, students will learn the basics of user experience design and formal software verification. Prerequisite: A grade of C- or better in CSCI 61, COEN 70, or COEN 79. Credit will not be given for both CSCI 187 and COEN 174. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Upper-Division Seminars",
      "classCode": "CSCI 190",
      "description": "Advanced topics in computer science. Research projects. May be repeated for credit. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Undergraduate Research",
      "classCode": "CSCI 192",
      "description": "Research project supervised by a faculty member in the department. Permission of the professor directing the research must be secured before registering for this course. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Topics",
      "classCode": "CSCI 197",
      "description": "Areas of computer science not ordinarily covered in regularly scheduled courses, often areas of current interest. May be repeated for credit. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Internship/Practicum",
      "classCode": "CSCI 198",
      "description": "Guided study related to off-campus practical work experience in computer science. Enrollment restricted to majors or minors of the department. Prerequisite: Approval of a faculty sponsor. (1 unit)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Independent Study",
      "classCode": "CSCI 199",
      "description": "Reading and investigation for superior students under the direction of a faculty member. This course can be used only to extend, not to duplicate, the content of other courses. May be repeated for credit. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    }
  ]