[
    {
      "courseName": "Music Theory I",
      "classCode": "MUSC 1",
      "description": "Beginning course in a comprehensive theory sequence thatintroduces students to the basic elements of music theory including pitch, rhythm, meter, modes, scales, intervals, triads, and seventh chords Required for musical theatre minor. Prerequisite: None. Majors and minors with extensive theory background are recommended to take the Theory Placement Exam. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Musicianship I",
      "classCode": "MUSC 1A",
      "description": "Musicianship is hands-on, practical training that builds skill with music fundamentals: rhythm, melody, harmony, ear training, notation, and improvisation. Prerequisite: None. This is the introductory course in a sequence; students with significant musicianship training are encouraged to contact the instructor for a placement assessment.. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Music Theory II",
      "classCode": "MUSC 2",
      "description": "Continuation of Music Theory sequence. Introduction to the application of materials learned in Music Theory I, including basic chord progressions realized through 4-part writing and harmonic analysis..Prerequisite: MUSC 1 or permission of instructor. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Musicianship II",
      "classCode": "MUSC 2A",
      "description": "Continuing course to develop aural skills through solfège and rhythmic training, keyboard harmony, improvisation, and dictation. Prerequisite: MUSC 1A or permission of instructor. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Music Theory III",
      "classCode": "MUSC 3",
      "description": "Continuation of Music Theory sequence.  Further instruction in common practice harmony including figured bass and part-writing with an introduction to chromatic harmony and score analysis. Prerequisite: MUSC 2 or permission of instructor. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Musicianship III",
      "classCode": "MUSC 3A",
      "description": "Continuing course to develop aural skills through solfège and rhythmic training, keyboard harmony, improvisation, and dictation. Prerequisite: MUSC 2A or permission of instructor. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Listening: Global Music",
      "classCode": "MUSC 7",
      "description": "This course explores the relationship between music and culture as it introduces students to a wide range of musical styles throughout the world. Designed for both majors and minors, students will learn basic ethnomusicological concepts and explore musical cultures from Africa, the Americas, the Middle East, South and Southeast Asia, and Europe. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Listening: Western Music",
      "classCode": "MUSC 8",
      "description": "This course offers an introduction to Western music history. Students will learn about musical elements, forms, and techniques through listening, lecture, and performance activities. Designed for both majors and non-majors, this course focuses on strategies for listening to, and writing about music. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Listening: Electronic Music",
      "classCode": "MUSC 9",
      "description": "This course combines elements of history, theory, and practice of electronic music. The computer becomes the instrument through which students explore new ways of manipulating and organizing sound. Designed for both majors and non-majors, this course creates a space for discussion and critical listening of different types of electronic music (contemporary, popular, and experimental), culminating in a final creative project by each participant. No previous computer or electronic music experience required. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Listening: Jazz",
      "classCode": "MUSC 10",
      "description": "This course offers an introduction to jazz music and history, focusing on key stylistic developments and major artists. Designed for both majors and non-majors, this course focuses on strategies for listening to, analyzing, and writing about jazz music. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "and 12A. Cultures & Ideas I and II",
      "classCode": "MUSC 11A",
      "description": "A two-course sequence focusing on a major theme in human experience and culture over a significant period of time. Courses emphasize either broad global interconnections or the construction of Western culture in its global context. Courses may address music and language; the ways people around the world have cultivated music and used music to cultivate other aspects of themselves and their societies; and other topics. Successful completion of C&I I (MUSC 11A) is a prerequisite for C&I II (MUSC 12A). (4 units each quarter)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Physics of Music",
      "classCode": "MUSC 19",
      "description": "The course explores the physical foundations underlying the production, propagation, and perception of music. No prior knowledge of either physics or music is expected, and math will be restricted to basic algebra and trigonometry. At the end of this course, students should possess a basic understanding of the nature of sound; the basic workings of string, wind, and brass instruments, as well as the human voice and ear; knowledge of basic musical notation; and a familiarity with some acoustical problems and their solutions. Through laboratory investigations, students will become familiar with methods of scientific exploration and gain an appreciation of the experimental method. Also listed as PHYS 7. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Beginning Piano Class",
      "classCode": "MUSC 30",
      "description": "Introductory instruction in piano in a classroom setting. Class limited to 18 students. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Performance Practicum",
      "classCode": "MUSC 33",
      "description": "This class is designed to offer practical experience in performance and professional development. Students will meet to discuss a specific performance-based topic and perform in a weekly studio-class setting in the Recital Hall. Class discussions will include a range of topics in professional and career development. Recommended for music majors and minors. May be repeated for credit. (1 unit)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Beginning Voice Class",
      "classCode": "MUSC 34",
      "description": "Study and application of basic vocal techniques to develop singing facility. Practical experience in performing. May be repeated for credit. Required for musical theatre minor. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Beginning Guitar Class",
      "classCode": "MUSC 36",
      "description": "Examination of essential elements required to play guitar in the classical style, including fundamental principles of technique, sight-reading, pedagogical repertoire, history, and literature. May be repeated for credit. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Beginning Composition Class",
      "classCode": "MUSC 37",
      "description": "This course explores personal expression through the creation of original music. Students explore the music and acoustical properties of sound while developing the creative and technical skills necessary to write a song or complete a finished musical piece. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Music Theory IV/Advanced Harmonic Language",
      "classCode": "MUSC 104",
      "description": "Continuation of Music Theory sequence.  Further instruction in the application of chromatic harmony including post-tonal materials and an introduction to form. Prerequisite: MUSC 3 or permission of instructor. Meets the elective requirement for music majors and minors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Modal Musicianship",
      "classCode": "MUSC 105",
      "description": "This advanced-level musicianship course explores the modal system, modern mixture, and complex mode relationships from melodic and harmonic perspectives. Students will be asked to explore this vocabulary creatively through improvisation and composition activities. Advanced rhythmic vocabulary often associated with modal improvisation will also be introduced, including odd and mixed meters, tuplets, and polyrhythms. Prerequisite: MUSC 3A. Meets the elective requirement for music majors and minors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Jazz Musicianship",
      "classCode": "MUSC 106",
      "description": "This advanced level musicianship class will explore melodic, rhythmic, and harmonic aspects of the jazz language including the blues and Bebop principles, the seventh chord as consonance, harmonic extensions, the ii V7 I progression, and swing, shuffle, and Latin rhythmic styles. Prerequisite: MUSC 2A or permission of instructor. Meets the elective requirement for music majors and minors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Tonal Musicianship",
      "classCode": "MUSC 107",
      "description": "This course offers advanced level musicianship training focusing on melodic, harmonic, and rhythmic aspects of musical language characteristic of the tonal period of Western Art Music (ca. 1600–1910). The emphasis will be on studying tonicization and modulation in the context of classical functional harmony. Prerequisite: MUSC 3A. Meets the elective requirement for music majors and minors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Pan-Tonal Musicianship",
      "classCode": "MUSC 108",
      "description": "This advanced level musicianship course will explore aspects of musical language that extend beyond the diatonic scale and functional harmonic relationships characteristic of classical tonality. Topics will include even divisions of the octave, symmetrical scales, navigating chromatic space by thinking intervallically, trichords, non-metered rhythms, simultaneous meters, and metric modulation. Prerequisite: MUSC 3A. Meets the elective requirement for music majors and minors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Lyric Diction",
      "classCode": "MUSC 109",
      "description": "This course provides singers and actors with a vital introduction to the fundamentals of accurate pronunciation in English, French, German, Latin, and Italian language, with an emphasis on lyric (sung) diction. Pronunciation and comprehension of the International Phonetic Alphabet is taught. Required for musical theatre minors, lyric track. Meets the elective requirement for music majors and minors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Instrumentation/Arranging",
      "classCode": "MUSC 110",
      "description": "An exploration of orchestration and arranging for all instruments, in various styles. Prerequisite: MUSC 2 or permission of instructor. Meets the elective requirement for music majors and minors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Counterpoint",
      "classCode": "MUSC 111",
      "description": "Detailed study and creation of contrapuntal music in the 16th-century Renaissance and 18th-century Baroque styles. Prerequisite: MUSC 3 or permission of instructor. Meets the elective requirement for music majors and minors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Music and Cultural Appropriation",
      "classCode": "MUSC 112",
      "description": "This course examines the aesthetic, social, and political effects of cultural appropriation in music from the United States and around the world. What is at stake when music crosses boundaries of culture, race, ethnicity, gender, class, religion, and nation state? Students will research specific instances and iterations of appropriation through sound and movement, such as sampling, cultural borrowing, and cross-cultural collaboration, as well as forms of cultural and economic exploitation. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Form and Analysis",
      "classCode": "MUSC 113",
      "description": "Study of the organization of sound into different established musical forms and their structures with a focus on listening, analysis, performance, and hands-on compositional activities that explore a broad range of musical styles and intellectual traditions from various cultures and historical periods. Prerequisite: MUSC 3 or permission of instructor. Meets the elective requirement for music majors and minors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Decolonizing Music Education",
      "classCode": "MUSC 114",
      "description": "This course seeks to address and disrupt the racist, sexist, ableist, homo- and transphobic, and imperialist practices in Western music education, especially at the college level. Working against histories of exclusion and white privilege, students will collaborate with faculty to create new pedagogical models for teaching music theory, history, and musicianship and be active participants in the Music department’s ongoing curriculum development. Also listed as ETHN 173.  (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Experimental Sound Design",
      "classCode": "MUSC 115",
      "description": "This course is about creating sounds on the computer from scratch. From simulating nature sounds to creating unique synthesizers, this class provides basic tools for the discovery of new timbres. Using the powerful SuperCollider language in a hands-on class environment, students will learn the basics of various digital synthesis techniques and explore their creative applications in electronic music composition and in other fields. Meets the elective requirement for music majors and minors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Music at Noon",
      "classCode": "MUSC 116",
      "description": "This class is organized around the Music at Noon series of concerts and performances. The weekly series brings the opportunity to experience live performances of music from all parts of the world by artists of local, national, and international renown. Students are required to attend all performances and write short reflections that summarize their individual experience. Prerequisite: None. Required class for music majors and minors. (1 unit)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "20th Century Musical Style and Practice",
      "classCode": "MUSC 117",
      "description": "Study and practice of musical structures, systems, and notation used from the beginning of the 20th century to the present day, including post-chromaticism, atonality, timbre, indeterminacy, minimalism, electro-acoustic writing, and other contemporary musical styles. Prerequisite: MUSC 3 or permission of instructor. Meets the elective requirement for music majors and minors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Study in Pedagogy",
      "classCode": "MUSC 118",
      "description": "A teaching practicum in which junior or senior music majors work with a music faculty member in a classroom, studio, or ensemble framework to assist in the planning and execution of a course. Music majors only. (1 unit)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Music, Technology, and Society",
      "classCode": "MUSC 119",
      "description": "This course examines how technology in music and the arts reflects and informs societal and cultural change. The course explores the ways in which music production, consumption, and distribution inform and are informed by digital technology. Assignments include readings and critical analysis, as well as composing pieces and collaborating on creative projects that explore the topics presented in class. Meets the elective requirement for music majors and minors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Junior Recital",
      "classCode": "MUSC 120",
      "description": "Presentation of 30 to 45 minutes of music in recital. All Junior Recitals require a pre-recital hearing, and approval of the student’s applied teacher and assigned committee. Junior Recitalstake place in the Winter quarter only, except by permission of the department chair. Registration by permission number only. More information about the recital hearing can be found on the department’s website. Open to majors and minors only. Students enrolled in Junior Recital are recommended to take MUSC 33. (1 unit)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Senior Recital",
      "classCode": "MUSC 121",
      "description": "Presentation of 45 to 60 minutes of music in recital. All Senior Recitals require a pre-recital hearing, and approval of the student’s applied teacher and assigned committee. Registration by permission number only. More information about the recital hearing can be found on the department’s website. Open to majors and minors only. Students enrolled in Senior Recital are recommended to take MUSC 33. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Motown and the Sound of Young America",
      "classCode": "MUSC 122",
      "description": "Motown and the Sound of Young America explores the various contexts surrounding the founding, establishment, and thriving of the Motown Label in the United States. Various topics including the civil rights movement, race, gender, socio-politics, and Detroit in the 1950s-1960s will be integrated into the class as well as the career paths and profiles of favorite artists such as Stevie Wonder, Marvin Gaye, Diana Ross, and Michael Jackson. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Jazz Theory",
      "classCode": "MUSC 123",
      "description": "This course covers the harmonic, rhythmic, and melodic techniques associated with the American art form of Jazz.  The presentation of these musical concepts will be accompanied by the analysis of songs and solos from the repertoire. In addition to technical assignments, students will compose music based on the principles discussed.  Prerequisite - MUSC 2 or instructor's permission. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Anthropology of Music",
      "classCode": "MUSC 130",
      "description": "An intellectual history of ethnomusicology. Approaches and theories from anthropology, musicology, folklore, religious studies, linguistics, critical theory, and gender studies will be explored in order to interrogate music’s relationship to culture, power, and practice. Meets the elective and Ethnomusicology/Music History requirement for music majors and minors. Also listed as ANTH 153. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Music Research and Writing",
      "classCode": "MUSC 131",
      "description": "This course is an introduction to research methods in music scholarship. Students will engage in local fieldwork-based projects and learn techniques for documenting, interpreting, and writing about musical cultures. Meets the elective and Ethnomusicology/Music History requirement for music majors and minors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The History of Hip-Hop",
      "classCode": "MUSC 132",
      "description": "This course will examine the historical contexts and diasporic flows that have shaped (and have been shaped by) hip-hop music. Topics explored will include the multicultural roots of hip-hop from West African bardic traditions to Jamaican sound system culture to African-American oral practices. Meets the elective and Ethnomusicology/Music History requirement for music majors and minors. Also listed as ETHN 132. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Music and Community",
      "classCode": "MUSC 133",
      "description": "Music and Community is a course designed to provide exploratory, analytical, and hands-on experience with civic leaders and organizations that focus their work in social advocacy and community engagement.  Students will broaden their knowledge and perspectives on rotating communities including Incarcerated Youth, Homeless Women, Veteran Women, and Mexican Immigrants & Farmworkers, immerse themselves in these communities, and utilize the power of music as a vehicle to break social barriers and tell the stories of their community partners. Learning will be focused on activities in and outside the classroom, including interactive and project-based learning. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Popular Music, Race, and American Culture",
      "classCode": "MUSC 134",
      "description": "A cultural history of blues-based American popular music from minstrelsy to disco. Emphasis will be placed on the development of a wide range of musical styles, such as ragtime, classic blues, swing, rhythm and blues, rock and roll, soul, and funk. Major themes include the impact of the music industry, the commercialization of black music, race and gender politics, social movements, and technology. Meets the elective and Ethnomusicology/Music History requirement for music majors and minors. Also listed as ETHN 164. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Music and Ecstasy",
      "classCode": "MUSC 135",
      "description": "This course will study the relationship of music to the experience of ecstasy or transcendence.  Religious or supernatural phenomena are the basis of many musical compositions throughout history and the experience of spiritual transcendence through musical composition and performance crosses all genres of music-making. Interweaving themes from religion, science, psychology, music theory, history, and philosophy, students will examine why music speaks to us in ways that words cannot. Meets the elective requirement for music majors and minors (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Music of Africa",
      "classCode": "MUSC 136",
      "description": "This course focuses on the history, musical characteristics, and sociopolitical, economic, and cultural roles of selected musical traditions from across Africa. Major themes include nationalism, resistance, and urbanization. Meets the elective and Ethnomusicology/Music History requirement for music majors and minors. Also listed as ETHN 148. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Jazz: Culture, Race, and Spirit",
      "classCode": "MUSC 137",
      "description": "This course is designed to explore the musical traditions of jazz by studying identity, spirituality, cultural transmission, and race relations. Topics will include the cultural roots of jazz, New Orleans as the birthplace for jazz, the Harlem Renaissance, the birth of bebop, John Coltrane’s music and spirituality, jazz and social protest, and spiritual practices of Herbie Hancock and Wayne Shorter. The course will include lectures, in-depth listening, readings, class discussions, and student presentations. Meets the elective requirement for music majors and minors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Flamenco History and Performance",
      "classCode": "MUSC 139",
      "description": "This course explores the musical and social history of flamenco, from its roots in India along the “gypsy” trails through North Africa, Asia, and Europe. Students will examine how this dynamic art form grew out of the cultural legacy of the “gitanos” (gypsies) in Andalusia, Spain and learn about flamenco song forms, dances, and rhythms. Meets the elective and Ethnomusicology/Music History requirement for music majors and minors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Improvisation",
      "classCode": "MUSC 156",
      "description": "This class explores the process of creating music through interactive activities designed to awaken students’ imagination and expand and deepen their understanding of music as an art form. The class community itself will be an improvising performance ensemble. Prerequisites: Theory I and/or Musicianship I; or commensurate experience and permission of the instructor. Meets the elective requirement for music majors and minors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Early 20th Century Music",
      "classCode": "MUSC 186",
      "description": "Survey of Western music from Debussy to World War II, including Strauss, Schoenberg, Stravinsky, and others. Meets the elective and Ethnomusicology/Music History requirement for music majors and minors. (5 units).",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Music Since 1945",
      "classCode": "MUSC 187",
      "description": "Survey of Western music from 1945 to the present, including the rise of technology in music and cross-cultural trends of the late 20th and early 21st centuries.  Meets the Culture and Context Requirement for majors and minors.  Meets the requirement for elective and Ethnomusicology/Music History requirement for music majors and minors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Senior Honors Project",
      "classCode": "MUSC 188",
      "description": "This course is designed to allow senior music majors and minors an opportunity to pursue in-depth musical studies within the parameters of a project or thesis in one of the following areas: music history/ethnomusicology, composition/music theory, or performance studies. This project is administered solely by the Department of Music as a course offering, and is separate from the University Honors program. (2-5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Sacred Music and the Church",
      "classCode": "MUSC 189",
      "description": "This course examines the interplay between church doctrine, musical style, and the power of social, political, and cultural forces, primarily through the genre of the mass. Gregorian chant, sacred concert music, modern service music, and non-Western music traditions will be studied. Meets the elective and Ethnomusicology/Music History requirement for music majors and minors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Music of the Middle Ages and Renaissance",
      "classCode": "MUSC 190",
      "description": "Survey of Western music from approximately 800–1600 CE. Works to be studied include chant, motets, masses, and the development of polyphony through various sacred and secular music of the Medieval and Renaissance periods. Meets the elective and Ethnomusicology/Music History requirement for music majors and minors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Music of the Baroque and Classical Periods",
      "classCode": "MUSC 192",
      "description": "Survey of Western music from approximately 1600 to 1827 CE, including study of the great works of J.S. Bach, Handel, Haydn, Mozart, and Beethoven. Meets the elective and Ethnomusicology/Music History requirement for music majors and minors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics",
      "classCode": "MUSC 193",
      "description": "Special topics course in Music. May be taken more than once when topics differ. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Music of the Romantic Period",
      "classCode": "MUSC 194",
      "description": "Survey of Western music of the 19th century, including the great works of late Beethoven, Brahms, Wagner, and others. Meets the elective and Ethnomusicology/Music History requirement for music majors and minors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Applied Music Instruction (30 Minutes)",
      "classCode": "MUSC 195",
      "description": "30 minute individual applied lessons in voice or musical instrument of choice.  Other fields of instruction such as composition and conducting are also available.  Students must complete the request form prior to registration.  Please visit www.scu.edu/music for more information  Meets the applied instruction requirement for music majors and minors. (.5 unit).",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Applied Music Instruction (45 Minutes)",
      "classCode": "MUSC 196",
      "description": "45 minute individual applied lessons in voice or musical instrument of choice.  Other fields of instruction such as composition and conducting are also available.  Students must complete the request form prior to registration.  Please visit www.scu.edu/music for more information. Meets the applied instruction requirement for music majors and minors. (.75 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Applied Music Instruction (60 Minutes)",
      "classCode": "MUSC 197",
      "description": "60 minute individual applied lessons in voice or musical instrument of choice.  Other fields of instruction such as composition and conducting are also available.  Students must complete the request form prior to registration.  Please visit www.scu.edu/music for more information.. Meets the applied instruction requirement for music majors and minors. (1 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "University Orchestra",
      "classCode": "MUSC 140",
      "description": "Preparation and concert performance of major works of orchestral literature. Open to all SCU students. This course fulfills the ensemble requirement for music majors and minors. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Concert Choir",
      "classCode": "MUSC 142",
      "description": "A mixed ensemble of select singers that performs a wide variety of a cappella and accompanied secular and sacred choral music from every period in music history through the present day. Emphasis is on a comprehensive survey of choral literature through performance, as well as development of choral tone, blend, diction, and sight singing skills.. No audition is required to join.Fulfills the ensemble requirement for music majors and minors. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Chamber Singers",
      "classCode": "MUSC 143",
      "description": "An 18–24 voice mixed ensemble of highly select advanced singers. Repertoire includes a variety of sophisticated chamber choral music from the Renaissance to the present day. By audition only. Fulfills the ensemble requirement for music majors and minors. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Jazz Ensemble",
      "classCode": "MUSC 145",
      "description": "Preparation and performance of jazz literature for large ensemble. By audition only. Fulfills the ensemble requirement for music majors and minors. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Jazz Combo",
      "classCode": "MUSC 146",
      "description": "Focus on jazz improvisation, techniques, and theory in small group performance. By audition only. Fulfills the ensemble requirement for music majors and music minors. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "World Music Ensemble",
      "classCode": "MUSC 152",
      "description": "World Music Ensemble provides opportunities for students to perform music outside the Western art tradition. Open to all SCU students regardless of musical experience. Fulfills the ensemble requirement for music majors and music minors. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Music Theater Workshop",
      "classCode": "MUSC 153",
      "description": "Preparation of solo and ensemble operatic excerpts in a workshop setting. Technical, stylistic, and dramatic preparation employing music reading skills, ornamentation, gesture, and choreography resulting in a public performance presented at the end of the quarter. Fulfills the ensemble requirement for music majors and music minors. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Wind Ensemble",
      "classCode": "MUSC 154",
      "description": "Preparation and performance of wind ensemble and chamber winds literature. Open to all students. A part assignment audition is required. .Fulfills the ensemble requirement for music majors and minors. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "New Music Ensemble",
      "classCode": "MUSC 155",
      "description": "Flexible ensemble dedicated to the performance and study of a broad range of contemporary styles and musical notations that span the music of the 20th and 21st centuries. Open to all SCU students with permission of instructor. . Fulfills the ensemble requirement for music majors and music minors. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Laptop Orchestra (SCLOrk)",
      "classCode": "MUSC 157",
      "description": "Computer-mediated music ensemble and learning environment for experimental electronic music composition and performance practice. This interdisciplinary courseexplores the intersections of music, computer science,composition, and live performance. Students present their work in a public concert at the end of the quarter. No music background is required. Registration by permission number only. Fulfills the ensemble requirement for music majors and music minors. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    }
  ]