[
    {
      "courseName": "1A. and 2A. Critical Thinking & Writing I and II",
      "classCode": "PHIL 1A",
      "description": "A two-course themed sequence featuring study and practice of academic discourse, with emphasis on critical reading and writing, composing processes, information literacy, and rhetorical situations. There are course-by-course variations as to the theme of the course. Successful completion of CTW I (PHIL 1A) is a prerequisite for CTW II (PHIL 2A). (4 units each quarter)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "1A. and 2A. Critical Thinking & Writing I and II",
      "classCode": "PHIL 2A",
      "description": "A two-course themed sequence featuring study and practice of academic discourse, with emphasis on critical reading and writing, composing processes, information literacy, and rhetorical situations. There are course-by-course variations as to the theme of the course. Successful completion of CTW I (PHIL 1A) is a prerequisite for CTW II (PHIL 2A). (4 units each quarter)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "11A. and 12A. Cultures & Ideas I and II",
      "classCode": "PHIL 11A",
      "description": "A two-course sequence focusing on a major theme in philosophy and culture over a significant period of time. Courses may address autonomy, personhood, community, justice, human dignity, law, the self, religion, cosmology, and other topics. Successful completion of C&I I (PHIL 11A) is a prerequisite for C&I II (PHIL 12A). (4 units each quarter)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "11A. and 12A. Cultures & Ideas I and II",
      "classCode": "PHIL 12A",
      "description": "A two-course sequence focusing on a major theme in philosophy and culture over a significant period of time. Courses may address autonomy, personhood, community, justice, human dignity, law, the self, religion, cosmology, and other topics. Successful completion of C&I I (PHIL 11A) is a prerequisite for C&I II (PHIL 12A). (4 units each quarter)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "History of Western Philosophy: Classical and Medieval",
      "classCode": "PHIL 14",
      "description": "Beginnings of Western philosophy. Representative philosophers of the Greek and medieval traditions, with attention to their historical milieu and their relevance to contemporary thought.Also listed as CLAS 51. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "History of Western Philosophy: Early Modern",
      "classCode": "PHIL 15",
      "description": "Principal fashioners of the modern mind. 17th- and 18th-century philosophers studied in the historical context of their times with attention to their impact on the present.(4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "History of Western Philosophy: Modern",
      "classCode": "PHIL 16",
      "description": "Introduction to  later modern and contemporary philosophy, from the critical revolution of Kant to some of the dominant currents of the 20th century.Prerequisite: PHIL 15 strongly recommended. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Informal Logic",
      "classCode": "PHIL 17",
      "description": "Introduction to the art of logical reasoning. Emphasis on the ability to recognize common fallacies of argumentation.(4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Formal Logic",
      "classCode": "PHIL 18",
      "description": "Introduction to the study of deductive inference, including traditional and modern techniques.(4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Knowledge and Reality",
      "classCode": "PHIL 19",
      "description": "Introduction to fundamental philosophical concepts and debates in epistemology (the study of knowledge) and metaphysics (the study of fundamental reality), through exposure to selected works that exemplify the best qualities of contemporary philosophical writing. Students will engage in intensive writing practice to develop their own competency in contemporary philosophical writing.Prior completion of PHIL 14 or 15 required. Course fulfills the Advanced Writing Core requirement. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Ethics",
      "classCode": "PHIL 21A",
      "description": "Consideration of the traditional theoretical questions posed in moral philosophy: standards that determine the morality of an action, the motives and consequences of an act, the good life. Authors studied may include Plato, Aristotle, Aquinas, Bentham, Mill, Kant.Satisfies the Ethics Core requirement for the bachelor’s degree in all undergraduate colleges except the Business School. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Ethics in Chinese Philosophy",
      "classCode": "PHIL 21B",
      "description": "Consideration of the major ethical questions, answers, and practices in Chinese philosophy. Traditions studied include, but are not limited to, Confucianism, Daoism, Mohism, and Legalism, as well as contemporary interpretations of these traditions. Close attention will be paid to concepts such as virtue, ritual, self-cultivation, social harmony, family reverence, and the roots of human morality. Satisfies the Ethics Core requirement for the bachelor’s degree in all undergraduate colleges except the Business School. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ethics in the Digital Age",
      "classCode": "PHIL 22",
      "description": "Formal inquiry into normative ethics and the ethical dimensions of the digital revolution, including (but not limited to) privacy and surveillance, intellectual property, hacking and cybercrime, robotics, artificial intelligence, computer games, virtual identities, and virtual worlds. Satisfies the Ethics Core requirement for the bachelor’s degree in all undergraduate colleges except the Business School. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ethics and Gender",
      "classCode": "PHIL 23",
      "description": "Formal inquiry into normative ethics. Emphasis on ethical principles and theories as they apply to concepts and practices related to sex, masculinity, and femininity. Special attention to gender theory and feminism. Topics studied may include pornography, sexuality, heterosexual/gay marriage and family life, domestic violence and rape on and off campus, abortion and reproduction, fashion and appearance, gender discrimination, sex-based affirmative action, and sexual harassment. Satisfies the Ethics Core requirement for the bachelor’s degree in all undergraduate colleges except the Business School. Also listed as WGST 58. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ethics and Gender in Film",
      "classCode": "PHIL 24",
      "description": "Formal inquiry into normative ethics. Emphasis on ethical principles and theories as they relate to concepts of gender and sex applicable to both males and females. In addition to written texts about ethics and gender, both dramatic and documentary films will be studied to illustrate how gender is both experienced by men and women and portrayed in the lived world. Topics studied may include sexuality and sexual orientation, male and female gender roles, heterosexual/homosexual marriage and family life, sexual violence, transsexuality, abortion and reproduction, and gender discrimination. Films studied may include The Hunting Ground, Thelma and Louise, Southern Comfort, Boys Don’t Cry, The Bro Code, Sliding Doors, The Mask You Live In, If These Walls Could Talk, The Laramie Project, and In the Company of Men. Satisfies the Ethics Core requirement for the bachelor’s degree in all undergraduate colleges except the Business School.(4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ethics in Society",
      "classCode": "PHIL 25",
      "description": "Formal inquiry into normative ethics. Special attention to general ethical principles and to the practical application of these principles to current ethical issues in society. Topics may include the concepts of freedom, obligation, value, rights, justice, virtue, and moral responsibility, as applied to issues such as abortion, punishment, economic distribution, racial and sexual discrimination, sexuality, political obligation, nuclear war, and pornography. Satisfies the Ethics Core requirement for the bachelor’s degree in all undergraduate colleges except the Business School. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ethics in Business",
      "classCode": "PHIL 26",
      "description": "Formal inquiry into normative ethics. Special attention to general ethical principles and the application of these principles to current moral issues in business. Topics may include truth in advertising, corporate social responsibility, affirmative action, capitalism, government regulation, quality of work-life, environmental and resource issues, and ethical codes of conduct. Students who take MGMT 6 or MGMT 6H may not take this course for credit. Fulfills the Ethics Core requirement for the bachelor’s degree in all undergraduate colleges. Partial fulfillment of the Civic Engagement Core requirement for students in the Business School. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ethics in Health Care",
      "classCode": "PHIL 27",
      "description": "Formal inquiry into normative ethics. Special attention to general ethical principles and the application of these principles to current moral issues in medicine and the health sciences. Topics may include the definition of death, informed consent, the just distribution of health care, euthanasia and assisted suicide, genetic manipulation, assisted reproduction, research involving human subjects, decisions to forgo life-sustaining medical treatment, truth-telling, and organ transplantation. Satisfies the Ethics Core requirement for the bachelor’s degree in all undergraduate colleges except the Business School. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ethics in Politics",
      "classCode": "PHIL 28",
      "description": "Formal inquiry into normative ethics. Emphasis on moral issues in political theory. Possible topics include the concepts of rights, justice, dignity, equality, personhood, desert, retributivism, and utility. Issues discussed may include alienation, individualism, community, discrimination, capital punishment, sexual equality, civil disobedience, revolution, and world hunger. Satisfies the Ethics Core requirement for the Bachelor’s degree in all undergraduate colleges except the Business School. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ethics and the Environment",
      "classCode": "PHIL 29",
      "description": "Formal inquiry into normative ethics. Emphasis on moral issues and the environment. Topics include animal rights, anthropocentrism, cost-benefit analysis, human rights, interspecies justice, land (use and value), population control, rights (of future generations and natural objects), values (moral and aesthetic) and preferences, wildlife protection, and wilderness. Satisfies the Ethics Core requirement for the bachelor’s degree in all undergraduate colleges except the Business School. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ethics and the Law",
      "classCode": "PHIL 30",
      "description": "Formal inquiry into normative ethics. Emphasis on moral issues and concepts in contemporary legal debates such as the rule of law, the duty to aid, the relationship between law and ethics, freedom of speech, the right to die, criminally charging minors as adults, the legalization of drugs, obscenity and indecency, the moral justification for punishment, including capital punishment, and state regulation of marriage. Satisfies the Ethics Core requirement for the bachelor’s degree in all undergraduate colleges except the Business School. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ethics and Marginalized Persons",
      "classCode": "PHIL 31",
      "description": "Formal inquiry into normative ethics. Emphasis on ethical principles and the application of these theories to persons who are gay, disabled, elderly, and poor. Special attention given to recognition, voice, authenticity, dialogue, and place as basic needs of personhood. Subjects raised will address marginalization and the damage it does to persons. Topics studied may include difference, shame, fear, loneliness, desire for accommodation, invisibility, justice, and discrimination. Satisfies the Ethics Core requirement for the bachelor’s degree in all undergraduate colleges except the Business School. Also fulfills the ELSJ Core requirement.(4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Neuroethics",
      "classCode": "PHIL 32",
      "description": "Formal inquiry into normative ethics. Emphasis on issues in the ethics of neuroscience and the neuroscience of ethics. Questions raised include: how do advances in fMRI resolution impact our right to keep our mental lives private? In light of advances in medical care, should we amend the current medical definition of brain death? Is neurosurgery a morally acceptable approach to certain mental illnesses? What do the neurosciences tell us about what it means to be a rational and moral agent? Do the neurosciences prove that we lack free will? Satisfies the Ethics Core requirement for the bachelor’s degree in all undergraduate colleges except the Business School. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ethics and Race",
      "classCode": "PHIL 33",
      "description": "Formal inquiry into normative ethics. Emphasis on moral issues regarding race in society. Personhood, character, fairness, empathy, and justice (substantive and procedural) will be offered as ethical lenses to evaluate racial questions. Issues discussed may include nobodiness, affirmative action, intersectionality, stereotyping, mass incarceration, Black Feminist thought, redlining, poverty and employment, the Radical Contract, privilege, policing, and lateral violence. Particular emphasis will be given to the African-American experience. Satisfies the Ethics Core requirement for the bachelor’s degree in all undergraduate colleges except the Business School. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ethics and Adulthood",
      "classCode": "PHIL 34",
      "description": "A philosophical inquiry into the ethical challenges facing young people as they transition into adulthood. The course is grounded in major normative ethical theories in the Western philosophical tradition. Ethical issues dealt with may include: the nature and cultivation of moral virtue, the ethical dimensions of autonomy and responsibility, marriage, friendship, duties to self and others, and the implications of electronic technology for personal relationships. Satisfies the Ethics Core requirement for the bachelor’s degree in all undergraduate colleges except the Business School. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Ethics in Drama, The Drama in Ethics",
      "classCode": "PHIL 35",
      "description": "An examination of philosophical ethics both in theory and in the dramatic portrayal of characters struggling with particular ethical problems. Also an exercise in writing original dialogue for characters contending with ethical decisions and in acting dramatic dialogue taken from published plays and student scene writing. Students’ attention and efforts will be directed not only to the cognitive, but also to the affective and bodily dimensions of ethical decision-making in particular circumstances. This course is intended to be a melding of philosophical reflection and inquiry with theatrical artistic expression in order to better understand what it means to be a virtuous person who lives a good life in an ambiguous world. Also listed as THTR 60. Satisfies the Ethics Core requirement for the bachelor’s degree in all undergraduate colleges except the Business School. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Science, Technology, and Society",
      "classCode": "PHIL 40",
      "description": "An investigation of the philosophical questions surrounding the social impact of science and technology, exploring issues such as technological determinism, the impact of technology on moral life, and the complex relationship among science, technology, and modern culture. Special attention may be given to the social and ethical implications of specific technologies such as robotics, nanotechnology, neuroimaging, and/or technologies for digital communication. Course fulfills the STS Core requirement. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Diversity and Disability",
      "classCode": "PHIL 41",
      "description": "Examines the nature and meaning of disability: what it is like living with disability (one’s own or others’); the legal, social, and ethical aspects of disability (particularly on justice and individual and personal treatment of disabled persons); and the intersections of disability with other social categories such as class, ethnicity, sexual orientation, age, and race. Students will be exposed to these issues by reading scholarly and nonfiction texts, doing research, viewing films, and working with disabled persons in the community through the Arrupe partnerships for community-based learning. Course fulfills the ELSJ and Diversity: U.S. Perspectives Core requirements.(4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Faith and Reason",
      "classCode": "PHIL 42",
      "description": "Exploration into possible combinations of faith and reason. Does faith alone provide truth? Must faith precede knowledge? Do faith and reason work in harmony, or does faith act as a barrier to accurate reasoning? Additional questions may include: If belief is not to be blind, what preambles to faith are required? What constitutes sufficient reasons for reasonable belief? Is faith rational or irrational or neither? If faith relies on reasoning, what type of reasoning? What defines belief? Special attention may be given to how persons of faith employ philosophy to explore and articulate their belief. Course fulfills the RTC 2 Core requirement.(4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Religion and American Law",
      "classCode": "PHIL 43",
      "description": "Examination of the interface of religion and American constitutional, statutory, and common law. Topics may include the legal status and definition of religion; the First Amendment guarantee of free exercise of religion and prohibition on government establishment of religion; religious objections to health services; conscientious objection to war and military service; free exercise and dangerous or restrictive activities; clergy malpractice and improper sexual behavior; the ministerial exception to employment anti-discrimination laws; religion and politics; disputes over ownership of church property; and teaching in public schools about religion and science. Texts will include judicial opinions and other legal materials. Course fulfills the RTC 2 Core requirement. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Free Speech, Hate Speech, and Civil Discourse",
      "classCode": "PHIL 44",
      "description": "Examination of the ethical, legal, and social implications of the exercise and limitation of free speech with special emphasis on regulation of speech and intellectual inquiry on college campuses. Topics may include “politically correct” speech; opposition to campus speech from individuals with controversial or biased views; use of “trigger warnings”; academic freedom and unpopular speech about gender, race, ethnicity, and religion; definitions of “hate speech”; the value of intellectual diversity of viewpoints; the virtue of tolerance; the differences among ethical, legal, and prudential limits on speech; and importance of civil discourse for engagement with social and legal policy. Course fulfills the Civic Engagement Core requirement. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Civility and Democracy",
      "classCode": "PHIL 45",
      "description": "Civility is derived from citizen and city. This course will explore the ability of humans to live together and thrive as citizens within democratic order. Primary emphasis will be given to defining civility (and incivility), exploring its connections with justice, questioning whether or not it may coincide with civil disobedience, describing its links to law and the rule of law, and highlighting its reliance on vibrant public discourse. Specific topics may include marginalization, tolerance, free speech, safety, empathy, political rhetoric, voting, and education. Fulfills Civic Engagement Core Requirement. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in Applied Ethics (E, P)",
      "classCode": "PHIL 108",
      "description": "Selected philosophical problems in applied ethics studied at an advanced level. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in Ethical Theory (E)",
      "classCode": "PHIL 109",
      "description": "Selected philosophical problems in ethical theory studied at an advanced level. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Classic Issues in Ethics (E, P)",
      "classCode": "PHIL 110",
      "description": "Exploration of the fundamental questions of ethics through close study of some of the great works of moral philosophy, such as Plato’s Republic, Aristotle’s Nicomachean Ethics, Kant’s Groundwork, and Mill’s Utilitarianism. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ethical Theory (E)",
      "classCode": "PHIL 111",
      "description": "Examination of major philosophers or issues in moral and social philosophy. Topics may include dignity, moral rights and obligations, justice, moral relativism, virtue, the good, and happiness. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ethics, Authenticity, Freedom, and Vocation (E)",
      "classCode": "PHIL 112",
      "description": "An inquiry into the moral ideal of being an authentic self, the meaning and moral significance of freedom, and the relation of these to vocation understood as an individual’s choice of major projects in the world and fundamental values, as response to the multiple calls of that which is outside of the self, and as the common experience of being summoned by a specific person seeking help or attention and of having to respond to this summons. The central premise of the course is that anyone who asks the classic questions of vocation (What am I good at doing? What am I passionate about doing? What are my values? Where do I find meaning in life? Where do I and the needs of the world and other persons intersect?) should reflect systematically on what it means to be an authentic self and what it means to be an agent with freedom of choice, as well as on the basic moral values that attach to authentic freedom. Satisfies the Ethics Core requirement for the bachelor’s degree in all undergraduate colleges except the Business School. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Bioethics (E, P)",
      "classCode": "PHIL 113",
      "description": "Examination of ethical concepts and problems encountered in the practice of medicine and other health professions as well as the conduct of biomedical science. Subjects studied may include the protection of human and animal subjects involved in scientific research, stem cell research and clinical investigation, public support for biomedical research, the proper character and scope of the clinician-patient relationship, informed consent, truth-telling, confidentiality of medical information, the duty to warn third parties of familial genetic risks and of threats posed by mentally disturbed patients, genetic testing and screening, abortion, the right to refuse life-sustaining medical treatment, surrogate decision making for the incompetent, physician assisted suicide, euthanasia, allocation of scarce medical resources, the definition of death, organ transplantation, and justice in providing access to basic health care services. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Environmental Philosophy and Ethics (E, P)",
      "classCode": "PHIL 116",
      "description": "Formal inquiry into normative ethics. Investigation of environmental issues from the point of view of classical ethical perspectives and consideration of how questions about the moral value of the environment provide new challenges to such classical theories. Topics may include animal rights, human rights, the rights of future generations, the rights of nature, anthropocentrism, interspecies justice, land (use and value), wilderness, and values and preferences. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Bioethics and the Law (E, P)",
      "classCode": "PHIL 117",
      "description": "Bioethics (normative ethics as applied to medicine and the health care professions, the life sciences, and biotechnology) is partially constituted by legal norms and values. Exploration of the evolving relationship between law and bioethics, as well as the substantive law and ethics of selected topics by studying cases and bioethical texts. Topics studied may include the definition of death, informed consent, the physician-patient relationship, euthanasia/assisted suicide and the law of criminal homicide, advance directives for health care, confidentiality, involuntary civil commitment for mental illness, regulation of research involving human subjects, the use of nonhuman animals in biomedical research, the legal and moral status of prenatal humans, parental control over the medical care of minor children, tort law and medical practice, and state licensure of healthcare professionals. Satisfies the Ethics Core requirement for the bachelor’s degree in all undergraduate colleges except the Business School. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ethics and Constitutional Law (E, P)",
      "classCode": "PHIL 118",
      "description": "Exploration of how the constitutional rights and interests of individuals and groups of individuals can be understood and justified by moral and social/political philosophy. Particular constitutional subjects to be studied may include the Fourth Amendment (search and seizure), obscenity and pornography, equal protection, gender discrimination, freedom of speech, freedom of association, free exercise of religion, State establishment of religion, discrimination against queer persons, privacy and personal autonomy, privacy and reproductive freedom, and substantive due process. Readings typically consist of Supreme Court cases. Satisfies the Ethics Core requirement for the bachelor’s degree in all undergraduate colleges except the Business School. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ethics and Criminal Law (E, P)",
      "classCode": "PHIL 119",
      "description": "Examination of the moral and conceptual foundations of contemporary criminal law. Topics studied may include ethical justifications of punishment (utilitarianism, retributivism), sentencing and proportionality, the nature of criminal acts and the guilty mind (mens rea), degrees of culpability, mental capacity for mens rea, causation, justification and excuse, types of criminal homicide and the death penalty, women’s rights and feticide laws, the right of self-defense/defense of others, necessity, duress, the insanity defense, trying juveniles as adults, attributions of criminality (attempt, complicity, conspiracy), plea bargaining and justice, applicability of theories of justice to criminal behavior, constitutional and moral rights of suspects and convicts, and the criminal liability of corporations. Satisfies the Ethics Core requirement for the bachelor’s degree in all undergraduate colleges except the Business School. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Feminism and Ethics (E, P)",
      "classCode": "PHIL 120",
      "description": "Exploration of theories of feminism, patriarchy, and gender, and of ethics as applied to the contemporary experience and social situation of women. Topics may include equality, affirmative action, comparable worth, pornography, sexuality, reproductive technologies, maternal-fetal relations, rape and domestic violence, female body image, cosmetic surgery, “alternative” families, militarism, and environmentalism. Satisfies the Ethics Core requirement for the bachelor’s degree in all undergraduate colleges except the Business School. Also listed as WGST 184. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Political Philosophy and Ethics (E, P)",
      "classCode": "PHIL 121",
      "description": "Moral issues in political philosophy, especially traditional ethical justifications for political authority. Topics may include theories of political authorization and contract theory, rights, liberty, equality, justice, community, revolution, civil disobedience, and others. Satisfies the Ethics Core requirement for the bachelor’s degree in all undergraduate colleges except the Business School. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Virtue Ethics (E, P)",
      "classCode": "PHIL 122",
      "description": "Exploration of various basic issues in ethics, such as friendship, courage, or compassion, from the point of view of virtues or (moral) character. Close study of classic authors—for example, Aristotle—as well as contemporary writers on virtue ethics. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Philosophy of Law (E, P)",
      "classCode": "PHIL 123",
      "description": "Investigation into the definition, use, and application of law. Particular attention will be given to the intersection (or non-intersection) of law and morality. Specific topics may include civil disobedience, the rule of law, duty to follow the law, and legal interpretation. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Natural Law Tradition (E, P, H)",
      "classCode": "PHIL 124",
      "description": "Examination of the intersection (or non-intersection) of morality and law within the 2,500-year natural law tradition and its most famous exponent, Thomas Aquinas. Particular topics addressed may include justice, politics, rights, the social contract, international law, positive law, and the sources of law. Applications of natural law reasoning in areas such as criminal justice, civil law, civil disobedience, and international criminal tribunals (e.g., Nuremberg) may be addressed. Specific questions considered will include what law is for, how natural law may be known, and what elements of human nature provide a basis for universal morality in law. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Aristotle and Aquinas on Justice (E, P, H)",
      "classCode": "PHIL 125",
      "description": "Exploration of the role of justice in a virtuous society through the lens of Aristotle and Thomas Aquinas. Emphasis will be placed on the study of human nature and its need for the habit of justice for personal perfection within a complete society. Particular questions will include: What is justice and what is its connection to law and society? What does it mean to deprive someone of justice? Are there different types of justice? How can a person practice justice as a virtue? What is the common good and how does it differ from the greater good? (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Utilitarianism (E, P, H)",
      "classCode": "PHIL 126",
      "description": "Philosophical inquiry into utilitarianism as a mode of consequentialist ethics. Particular attention will be given to questions concerning the particular good(s) sought (pleasure, happiness, preferences, avoidance of pain), the vehicles used (acts, rules), as well as the manner of evaluating the theory for a particular case (options and prognoses). Criticisms of consequentialist ethical evaluation will also be considered. Readings may draw from ancient, modern, and contemporary sources. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Marx and Ethics (E, P, H)",
      "classCode": "PHIL 127",
      "description": "Examination of Marx’s ethical thought in the context of traditional ethical theory (Aristotle, Kant) and in relationship to his political views and philosophy of history. Topics may include alienation, the human essence, the individual, community, needs, freedom, equality, rights, and justice. Satisfies the Ethics Core requirement for the bachelor’s degree in all undergraduate colleges except the Business School. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Metaethics (E, P, S)",
      "classCode": "PHIL 128",
      "description": "Examination of the nature, status, and foundations of ethics and morality. Topics explored may include: Are there moral truths? Are there moral facts? Is anything really right or wrong, permissible or impermissible, etc.? What is “the good” and how have different people and peoples conceived of it? Conceptions of ethics discussed may include: moral non-cognitivism, moral relativism, moral nihilism, moral realism, moral naturalism, and non-naturalism. Prerequisites: Recommended: one course in ethics; PHIL 19. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Feminist Political Theory (E, P)",
      "classCode": "PHIL 129",
      "description": "Examination of the nature of equality through the lens of gender and race, especially the intersection of these. Our focus will be the development of feminist political theories, which both influenced and came out of political struggles for equality (especially those dealing with the intersection of gender and race). These theories will provide us with frameworks through which to analyze the pursuit of women’s equality and the way in which this continues to be intertwined with the pursuit of racial justice in the United States. Topics covered include power imbalances and how they shape ethical and legal rights claims, intersectional feminism, justice in the family, workplace discrimination, feminist critiques of group rights arguments, representation and recognition, sexual exploitation, and pornography. Fulfills the Diversity: U.S. Perspectives Core requirement. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ethics of Artificial Intelligence (E,S)",
      "classCode": "PHIL 130",
      "description": "Artificial Intelligence (AI) is developing at breakneck speed and has already begun transforming our way of life. But while advancements in this technology create new opportunities for what we can do, there is also an ethical dimension to be explored in terms of what we should do. In this course, we will cover the philosophical and ethical issues raised by current and future AI systems. In particular, we will consider the ways in which ethics can help guide the responsible design and development of AI systems such that they ultimately promote human values and conceptions of the good life. To accomplish this, we will engage in critical thinking and analysis of real-world applications of AI in education, the criminal justice system, the workplace, the environment, social media platforms, and more. Questions to be considered include (but are not limited to) the following: Can machines be biased? What kind of explanation are we owed from AI decision-support tools? How do we align the values of AI with our own? Should robots be designed to influence human behavior and make us ‘better people’? Will automation prevent humans from developing a virtuous character and leading a flourishing life? (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ancient Philosophy (E, H)",
      "classCode": "PHIL 141",
      "description": "Study of one major philosopher or philosophical issue (such as substance, causation, or virtue) from the ancient period. Specific variations include 141A (Socrates; also listed as CLAS 146), 141B (Plato), 141C (Aristotle), 141D (Love and Relationships in Classical Antiquity; also listed as WGST 133 and CLAS 141), 141E (The Stoics), 141F (Hellenistic and Roman Philosophy) and 141G (Special Topics). Recommended: PHIL 14. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Medieval Philosophy (H)",
      "classCode": "PHIL 142",
      "description": "Study of one major philosopher or philosophical issue (such as universals, existence and the nature of God, or free will) from the medieval period. Specific variations include 142A (Neoplatonism), 142B (Augustine), 142C (Aquinas), 142D (Special Topics). Recommended: PHIL 14. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Modern Philosophy (H)",
      "classCode": "PHIL 143",
      "description": "Study of one major philosopher or issue (such as mind and body, skepticism and knowledge, or causation) from the modern period. Specific variations include 143A (Descartes), 143B (Hume), 143C (Kant), 143D (Hegel), 143E (Kierkegaard), 143F (Nietzsche), and 143G (Special Topics). Recommended: PHIL 15 for 143A, B, and G; PHIL 16 for 143C–F. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Contemporary European Philosophy: Phenomenology (H)",
      "classCode": "PHIL 144",
      "description": "An introduction to the 20th-century phenomenological tradition of philosophy, addressing the foundational works of philosophers such as Husserl, Heidegger, Sartre, Ricoeur, and Merleau-Ponty as well as contemporary developments in the field. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Contemporary European Philosophy: Existentialism (H)",
      "classCode": "PHIL 145",
      "description": "Survey of existentialism, its analysis of the basic structures of human existence, particularly freedom and the experience of living in a broken—even absurd—world, and its major thinkers such as Kierkegaard, Dostoevsky, Nietzsche, Heidegger, Camus, Sartre, and de Beauvoir. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Philosophy As A Way Of Life",
      "classCode": "PHIL 146",
      "description": "This course has an audacious aim to help students live a better life. For philosophers such as Socrates and Confucius, philosophy was concerned with living well. But what does that mean for today? We will attempt to answer that question by examining western and non-western philosophical traditions in order to glean insights into a life that pursues goals such as attaining wisdom, tranquility, harmony, and the like. Whereas many philosophy courses today focus solely on arguments and objections, this class emphasizes other methods such as narrative/story-telling, close observation of exemplars, imitative activities, contemplative or meditative exercises, and immersing oneself in a specific way of living such as Confucianism, Buddhism, Stoicism, Benedictine monasticism, among others. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Wittgenstein (H, S)",
      "classCode": "PHIL 150",
      "description": "A study of the philosophy of the 20th-century philosopher Ludwig Wittgenstein, focusing on his logical theory, metaphysics, epistemology, and works such as Philosophical Investigations and On Certainty. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Analytic Tradition (H, S)",
      "classCode": "PHIL 151",
      "description": "Examination of the major currents in 20th-century Anglo-American philosophy. Philosophers studied may include Frege, Russell, Carnap, Moore, Wittgenstein, and Austin; movements may include logical positivism and ordinary language philosophy. Recommended: PHIL 19. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Problems of Moral Knowledge (E, P, S)",
      "classCode": "PHIL 152",
      "description": "An investigation into the intersection of ethics and epistemology. This course is principally concerned with (1) the nature of ethics and (2) the nature and possibility of moral knowledge. Issues to be discussed may include cognitivism and noncognitivism in ethics, moral relativism, moral realism, moral intuitionism, and moral skepticism. Recommended: PHIL 19 (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Philosophy of Science (S)",
      "classCode": "PHIL 153",
      "description": "Exploration of selected philosophic questions that arise in contemporary science, especially physics. Topics include the nature of scientific knowing, the roles of theory and experiment in scientific progress, the sense in which theoretical entities like quarks and electrons can be said to be “real,” and the paradoxes of quantum mechanics. Special attention will also be given to the complex relationship between science and society, and the role of values in scientific inquiry. Recommended: PHIL 19. Fulfills STS Core requirement. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Problem of Free Will (S)",
      "classCode": "PHIL 154",
      "description": "Philosophical investigation of the free-will problem. Discussion of concepts of freedom, fate, causation, and God. Recommended: PHIL 19. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Skepticism (H, S)",
      "classCode": "PHIL 155",
      "description": "Study of the problem of skepticism from its origins in ancient Greece to the present day. Considers both skeptical positions and views critical of skepticism. Readings may include Sextus Empiricus, Descartes, Hume, and Wittgenstein. Recommended: PHIL 14, 15, or 19. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Knowledge, Truth, and Belief (P, S)",
      "classCode": "PHIL 156",
      "description": "Examination of major issues in the theory of knowledge. Topics may include justification of belief, a priori knowledge, perception, and theories of truth. Recommended: PHIL 19. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Analytical Metaphysics (S)",
      "classCode": "PHIL 157",
      "description": "This course will introduce students to several core topics in contemporary metaphysics, which is roughly the study of the fundamental structure or nature of reality. We will investigate questions such as: What are properties or attributes, and how do we explain the fact that two distinct objects seem to share the same property? What is time, and is time travel possible? How do things persist through time, and what makes a human person remain the same person over time? Is free will and determinism compatible, and how is free will possible if actions are undetermined? Recommended: PHIL 19. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Philosophy of Mind (S)",
      "classCode": "PHIL 158",
      "description": "Examination of issues relating to the existence and nature of mind and its relation to body. Recommended: PHIL 19. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Social Construction of Reality (E, S)",
      "classCode": "PHIL 159",
      "description": "This course is a philosophical examination of the social construction of reality. What does it mean to say that something is socially constructed? What is the relation between social construction and reality? What is the relation between social construction and justice? Topics may include the nature of material objects, facts and scientific inquiry, knowledge, sexuality, gender, and race. Recommended: PHIL 19. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Philosophy of Mental Illness (S)",
      "classCode": "PHIL 160",
      "description": "Examination of issues relating to the existence and nature of mental illness and its relation to the body. Recommended: PHIL 19. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Philosophy of Emotion (S)",
      "classCode": "PHIL 161",
      "description": "Examination of issues relating to the existence and nature of emotions and their relation to the body. Recommended: PHIL 19. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Philosophy of Language (P, S)",
      "classCode": "PHIL 162",
      "description": "Examines the nature of meaning, communication, and language itself, as well as how language and thought relate to the world. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in Metaphysics and Epistemology (S)",
      "classCode": "PHIL 164",
      "description": "Selected philosophical problems in metaphysics and/or epistemology studied at an advanced level. Recommended: PHIL 19. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Philosophical Issues in Virtual Reality (E, S)",
      "classCode": "PHIL 165",
      "description": "An in-depth examination of the psychological, technological, and philosophical issues emerging as a result of virtual reality (VR) technologies. Students will gain competence identifying and using different virtual and augmented reality technologies both theoretically and practically. Psychological questions concerning the nature of “presence” and empathy in VR environments will be explored, along with ethical questions about the permissibility of using VR technology for various purposes. Recommended: PHIL 19. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Uncertainty, Conflict, and Self-Development: Chinese Perspectives (H)",
      "classCode": "PHIL 174",
      "description": "In-depth study of one or more influential classic texts and/or figures of Chinese philosophy, from the ancient through the modern period. Connections to Western and other traditions of philosophy, as well as contemporary issues. Readings may include the Yijing (or Classic of Changes), the Analects of Confucius, the Daodejing, the Zhuangzi, the Sunzi (or Art of War), the Platform Sutra, Zhu Xi, and others. Recommended: PHIL 14, 15, 16, or 19. Fulfills Culture and Ideas 3 Core requirement. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Chinese Philosophy (H)",
      "classCode": "PHIL 175",
      "description": "Study of major philosophical traditions of China, including Confucianism, Daoism, Mohism, Legalism, and Buddhism. Areas of emphasis may include topics in ethics, social and political philosophy, and aesthetics, including the cultivation of self and community, proper governance, liberation, cosmology, and the arts. Fulfills Culture and Ideas 3 Core requirement. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Buddhist Philosophy (H, E)",
      "classCode": "PHIL 176",
      "description": "This course concerns the philosophy of Buddhism. Topics may include the Four Noble Truths, the Eightfold Path, Buddhist metaphysics, including the nature of the self, karma, rebirth, salvation, and dependent origination, and Buddhist ethics. The course may also address the differences between various Buddhist traditions and Buddhism’s impact on Western philosophy. Fulfills Culture and Ideas 3 Core requirement. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Indian Philosophy (H)",
      "classCode": "PHIL 177",
      "description": "This course is a historical and thematic examination of the major orthodox and heterodox philosophical systems of India, including those of the Vedas, Upanishads, Bhagavadgita, Vedanta, Jainism, and Buddhism. Central themes and questions include: What are valid sources of knowledge? What is consciousness? What is the nature of the self? Who is the ethical agent? (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Arabic Philosophy (H)",
      "classCode": "PHIL 178",
      "description": "This course explores the main questions of Islamic philosophy from the great translation movement of ancient Greek texts in the eighth-to-ninth centuries CE until the debates of the 13th-to-14th centuries CE. Philosophers considered may include al-Kindi, al-Farabi, Ibn Sina (Avicenna), al-Ghazali, and Ibn Rushd (Averroes). Particular topics may include debates over the use of Greek thought (Aristotelian and Neoplatonic) in religion, being, eternity, God, freedom, ethics, creation, and law. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Jewish Philosophy (H)",
      "classCode": "PHIL 179",
      "description": "Exploration of ancient, medieval, and modern Jewish philosophy. Particular emphasis will be placed on the combination of Greek and Hebraic thought in understandings and examinations of God, time, freedom, universals, justice, transcendence and immanence, and translation and interpretation of religious texts (allegorical, symbolic, etc.). Further topics may include the role of the Holocaust, personhood, infinity, ethics, politics, and law. Key figures may include Philo, Judah Halevi, Moses Maimonides, Gersonides, Buber, and Levinas. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in Non-Western Philosophy (H)",
      "classCode": "PHIL 180",
      "description": "This course will be an in-depth study of a single topic, philosopher, or philosophy in a non-Western tradition. For example, the course may focus on the works and ideas of a single philosopher such as Confucius, Zhuangzi, or Dogen. Or the course may focus on a theme as treated by various philosophers from a tradition, such as debates about perception in Indian philosophy, ethical cultivation in Chinese philosophy, or the nature of the self in Japanese philosophy. Additionally, this course may include comparative philosophy approaches in which a topic is addressed in more than one non-Western tradition. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Philosophy of Art (E, H)",
      "classCode": "PHIL 181",
      "description": "Philosophical examination of the historical development of the aesthetic concepts of taste and beauty. Specific variations include 181A (Kant and 19th Century Aesthetics), 181B (Contemporary Aesthetics), 181C (Aesthetics and the Avant Garde), 181D (Cross-Cultural Aesthetics), and 181E (Special Topics in Aesthetics). (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Philosophy and Film (E)",
      "classCode": "PHIL 183",
      "description": "This course focuses on the aesthetic and ethical dimensions of English language films, from the silent era to the present. We will discuss at least some of the following topics: What makes a film, screenplay, or novel, “good”? This will include discussion of the aesthetic and ethical values that contribute to the quality of film and literature. What is the role of artistic intention in understanding and evaluating film (including the “auteur theory” account of cinematic creation and the “intentional fallacy”). What role do various types of interpretation and genre play in understanding and evaluating the quality of film and literature? What, if any, is the proper place of various types of censorship, from the “production code” of the 1930s to the Motion Picture Association of America (MPAA) rating system in place today? (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Philosophy of Religion (E, H)",
      "classCode": "PHIL 184",
      "description": "Philosophical inquiry, based on both classical and contemporary views, as to whether the existence of God can be rationally demonstrated, whether it is compatible with evil, how human beings relate to God, the nature of faith, and the nature of religious language. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "University Ethics Bowl Team (E, P)",
      "classCode": "PHIL 185A",
      "description": "Participation in the Santa Clara University Ethics Bowl Team, including in-depth weekly analyses of cases in applied ethics, culminating in a regional or national debate. Students will be required to study background facts, key definitions, relevant moral principles, and methods of applying those principles to answer questions about the applied ethics cases. Field trips required. This course may be repeated as PHIL 185B for 1 unit. 185A fulfills Civic Engagement Core requirement. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "University Ethics Bowl Practicum (E, P)",
      "classCode": "PHIL 185B",
      "description": "See description of PHIL 185A. (1 unit)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Philosophy of Race (E, P)",
      "classCode": "PHIL 186",
      "description": "Examination of scholarship regarding the conceptual, ontological, epistemological, and normative questions pertaining to race. Subjects studied may include the historical origins and development of the concept of race, race as a biological category, contemporary philosophical debates over whether races actually exist, the relationship between the continued use of racial categories and the persistence of racism, the differences between race and ethnicity, debates among moral, political, and legal philosophers over the validity and source of racial identity, racial solidarity, race-based culture, and race-specific public policies such as affirmative action and race-based representation. Fulfills Diversity: US Perspectives Core requirement. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Love, Sex, and Race (E)",
      "classCode": "PHIL 187B",
      "description": "This course investigates how interpersonal romantic love relationships are subject to the same social and political forces that pervade our lives in other domains. Students will investigate questions such as “What is love?”; “Should our understanding of  love be qualified in relation to race, class, sexuality, gender, ability, and their many intersections?”; “What is Black love?”; “Are love and Black love mutually exclusive concepts?” These questions involve not only love, but also justice, marriage, fairness, exploitation, harm & abuse, consent, agency, authenticity, rights (i.e. of adults and children), citizenship, and immigration. Finally, we will also seek to “queer” heteronormative understandings of “Black Love” in America and globally, by unpacking notions of gender and authenticity: namely, we will ask what does it mean to be a “real” Black woman and man, and what defines “real” Black love. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Philosophy of Music (E)",
      "classCode": "PHIL 188",
      "description": "A philosophical inquiry into music and meaning guided by questions concerning music’s relationship to perception, the emotions, and thinking. Further topics may include sound and listening, the spacetime of music, the mutual dynamics between music and its cultural, social, and technological contexts, and the possibility that music is a philosophical practice. The texts and musical examples for the course will draw from global traditions. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Senior Research thesis for Honors in philosophy",
      "classCode": "PHIL 197",
      "description": "Creation of a carefully researched and scholarly paper, under the active direction of a selected member of the department’s faculty. Required of senior majors who wish to qualify for Honors in philosophy. Prerequisite: previous arrangement with instructor and department chair. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Senior Research Thesis",
      "classCode": "PHIL 198",
      "description": "Creation of a carefully researched and scholarly paper, under the active direction of a selected member of the department’s faculty. Of particular value to senior students who intend to pursue graduate studies. Prerequisite: Previous arrangement with instructor and department chair. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Research",
      "classCode": "PHIL 199",
      "description": "Tutorial work with demanding requirements for advanced students in particular problem areas not otherwise accessible through courses. Prerequisite: Previous arrangement with the instructor and department chair. (2–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    }
  ]