[
    {
      "courseName": "Introduction to Public Health",
      "classCode": "PHSC 1",
      "description": "As an introduction to public health, this course examines health at the population level. Topics include common infectious and chronic diseases, how diseases arise in individuals and populations, how diseases are studied, and how health is promoted at the individual and community levels. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to the American Health System",
      "classCode": "PHSC 2",
      "description": "This course examines the fundamental aspects of the U.S. health system including organization, delivery, financing, cost, access, and quality. The focus will be on the current system, but significant attention will be given to its historical roots and to alternative approaches implemented in other developed countries. Potential policy reforms and the interface of the health care system with public health will also be discussed. Prerequisite: PHSC 1. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Community Health",
      "classCode": "PHSC 3",
      "description": "This course is an introduction to community health designed for public health majors and minors. Students will investigate health from a community perspective at multiple levels—governmental, nonprofit organization, activist/member. Students will learn how to define “communities” for public health practice and research, and experience community health work with multiple stakeholders. This is a hybrid between classroom and field-based learning that will allow students to learn theories and frameworks of community health, while examining these principles in practice. Prerequisite: PHSC 1. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Public Health and Ethics",
      "classCode": "PHSC 7",
      "description": "Examination of the ethical and conceptual foundations of public health. Topics studied may include ethical theory and ethical justifications of public health interventions, genetic screening of newborns conducted by the state, prenatal genetic diagnosis, genomic medicine, mandatory vaccinations for children and others, parental responsibility for their children’s health and welfare, public policy and law regarding the use of tobacco, alcohol, and other drugs, the allocation of vital organs for transplantation, health disparities related to race and other social categories, the legal and administrative regulation of pain management, harm reduction (such as needle exchange), health promotion and behavior modification, and defensive medicine. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Women’s Health",
      "classCode": "PHSC 11",
      "description": "This course examines how women’s health over the life course is influenced by biological, psychological, social, and cultural experiences. Topics include menarche and pubertal development, reproductive health and rights, menopausal transition, mental health, and violence. Current, historical, and cross-cultural examples are discussed. Also listed as WGST 32 (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Health and Aging",
      "classCode": "PHSC 21",
      "description": "Analysis of the human aging process, and the biological, medical, social, and ethical issues associated with aging. Topics include theories of aging, diseases and various health care issues associated with aging, and end-of-life issues. Contains an ELSJ component. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Human Sexuality",
      "classCode": "PHSC 28",
      "description": "Integrates the biological foundations of human sexuality with psychological and social aspects of sexuality. Topics include the anatomy, physiology, and neurobiology of sex, gender and sexual orientation, sexually transmitted diseases, conception and pregnancy, contraception and abortion, and sexual dysfunctions. Also listed as WGST 33. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Biostatistics for Public Health",
      "classCode": "PHSC 50",
      "description": "This introductory course uses case studies to present the principles and methods of biostatistics with application to public health, focused on interpretation and communication. Topics include descriptive statistics, probability, probability distributions, point and interval estimation, hypothesis testing, chi-square, correlation, and regression. Through the combination of lectures, readings, critical review of papers, and problem sets, students without prior coursework in biostatistics will acquire the core competencies in biostatistics expected of all public health undergraduates. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Epidemiology",
      "classCode": "PHSC 100",
      "description": "This course provides an introductory overview of epidemiological principles and methods. The course examines patterns of distribution and determinants of health and morbidity in human populations, and application of epidemiologic study designs and analytical methods, focusing on topics of public health importance and questions of health equity. Laboratory 30 hours. The laboratory (computer lab) will provide students with hands-on experience with epidemiologic methods, study design, and data analysis using statistical software. Also listed as BIOL 117. Prerequisite: BIOL 1C or PHSC 1 & 50. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Global Health",
      "classCode": "PHSC 103",
      "description": "Interdisciplinary investigation of topics in public health in a global context, with particular attention to major issues in low and middle-income countries, and the relationships between health status, education, and poverty. Prerequisite: PHSC 1. PHSC 100 or 150 recommended. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Nutrition and Public Health",
      "classCode": "PHSC 105",
      "description": "This course concentrates on the nutrition status of communities and populations, and actions that public health professionals may take to improve it. Students will learn about the connections between social justice, policy, and nutrition programs and how they relate to food access, nutrition status, and health outcomes for specific populations both domestically and internationally. Students will see how public health theories and research are applied in the nutrition context. This course also considers culture and intercultural interactions, and how they influence nutrition. Also listed as BIOL 105 (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Health Education and Promotion",
      "classCode": "PHSC 111",
      "description": "This course examines the fundamental concepts of health education and promotion in a variety of public health contexts. Major theoretical approaches and models related to behavior change, social influence, communication strategies, and community-based change are discussed, as well as multifactorial determinants of health and health-related behaviors. An overview of different research methodologies for health program design, implementation, and evaluation is provided. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Health Consequences of a Western Lifestyle",
      "classCode": "PHSC 124",
      "description": "This course explores the impact of living in a developed country on human health. Topics such as diabetes, obesity, heart disease, hypertension, and cancer will be discussed at the molecular, cellular, physiological, and population levels. Also listed as BIOL 106. Prerequisite: BIOL 1C. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Race, Class, Gender and Public Health",
      "classCode": "PHSC 125",
      "description": "This course introduces students to key theories for studying social difference and health, and examines the ways that categories of social difference—including but not limited to race, class, and gender—are socially constructed and serve as key determinants of health and health inequities. Students will consider how privilege and oppression are patterned by race, class, and gender and study contemporary and historical debates of health inequities perpetuated in institutional and interpersonal contexts, including the state, the labor force, neighborhood, the family, and the criminal justice system. Enrollment during second, junior, or senior year stronglyadvised. Also listed as WGST 131. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Public Health Leadership Seminar",
      "classCode": "PHSC 130",
      "description": "This course is a required component of the Valeriote Goldman Public Health Leadership Program. Enrollment is by permission of instructor. (2 units).",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Community Health",
      "classCode": "PHSC 131",
      "description": "This course examines key health indicators and patterns seen in individuals, families, neighborhoods, schools, and communities. Students will explore social, environmental, political, cultural, and behavioral factors that contribute to health disparities linked to racial, ethnic, socioeconomic, and geographic differences. The course will also examine the design, implementation, and evaluation of social and behavioral interventions and health policies to improve community health. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Human Development and Sexuality",
      "classCode": "PHSC 135",
      "description": "Examination of evolutionary, biocultural aspects of human growth, development, and sexuality throughout the life cycle. Special emphasis on how various cultural, economic, and political factors influence norms of sexual behavior in different societies. Fulfills the Science, Technology & Society requirement. Also listed as ANTH 135. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Public Health Internship",
      "classCode": "PHSC 139",
      "description": "This two-unit course is required for all Public Health majors and must be completed or in process before seeking approval for the required 100-hour internship. This course will guide students through their internship selection process, and through career exploration and professional development in Public Health. Topics include teamwork, communication and networking skills, which are examined through discussion, professional and personal reflection, and vocational discernment. Prerequisites: PHSC 1 and PHSC 2 or PHSC 3 (concurrent enrollment in PHSC 2 and/or PHSC 3 allowed).",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Environment and Health",
      "classCode": "PHSC 142",
      "description": "This course will help students gain a better understanding of environmental factors that affect human health. Topics covered include population growth and urbanization, human ecology, pesticides and environmental toxins, air and water pollution, waste generation and management, and climate change. Particular emphasis will be placed on how these issues affect the global poor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Evidence-Based Public Health",
      "classCode": "PHSC 150",
      "description": "This course focuses on the application of scientific reasoning and epidemiological analysis to public health research and program planning. On the research side, strategies for formulating appropriate research questions, designing studies, collecting and analyzing data, and interpreting and communicating results will be emphasized. Approaches for converting evidence into action will also be covered, including needs assessments, program development and implementation,and evaluation strategies. Students will gain hands-on experience in collecting, analyzing and interpreting, and acting upon empirical evidence in public health. An overview of major theoretical approaches and models related to behavior change, social influence, communication strategies, and community-based change will also be covered. Prerequisite: PHSC 2 or3. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Health Policy",
      "classCode": "PHSC 156",
      "description": "This course will examine the development, implementation, and analysis of policies impacting public health, with particular attention to competing ethics, values, and power. Students will learn to critically appraise historical, contemporary, and possible future health policies and strategies. Prerequisite: PHSC 2. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Substance Use, Addiction, and Treatment",
      "classCode": "PHSC 160",
      "description": "This course explores the nature and consequences of alcohol and drug addiction from biological, psychological, and public health perspectives. Students will study common drugs of addiction, the underlying causes of addiction, and treatment strategies. Societal impacts and responses to substance abuse and addiction will be examined in depth. Also listed as PSYC 163. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Management of Healthcare Organizations",
      "classCode": "PHSC 172",
      "description": "Explores the sociological and practical issues of operations, financing, and management in organizations providing services for people with health problems (organizations such as nursing homes and hospitals) or people with infirmities (organizations such as senior care centers and assisted living facilities). Also listed as SOCI 172. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Qualitative Research Methods in Public Health",
      "classCode": "PHSC 175",
      "description": "This is a hands-on course in which students practice qualitative research methods in public health including ethnography, interviewing, and grounded theory analysis. Qualitative research is how we understand the how and why of public health issues. Students will explore a public health topic through an IRB-approved study and be involved in the development of research questions, conducting interviews/ethnography, coding/analyzing qualitative data in programs like Atlas.TI, and developing theory-driven findings. This course will provide an applied inquiry into qualitative research, and ways to integrate it with quantitative data, to examine public health issues. Prerequisite: PHSC 3 (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Structural Racism: Race, Power and Resistance in the United States",
      "classCode": "PHSC 187",
      "description": "This upper division seminar addresses systems of structural racism in the United States. Systemic and structural racism are defined as “forms of racism that are pervasively and deeply embedded in systems, laws, written or unwritten policies, and entrenched practices and beliefs that produce, condone, and perpetuate widespread unfair treatment and oppression of people of color, with adverse health consequences” (Braveman et al., 2022). Patterns of structural racism work alongside gendered systems of heteronormativity to reinforce white supremacy and the inequitable distribution of social and economic resources. Through in-depth, discussion-based engagement with case studies of structural racism in interconnected systems of education, criminal justice, the law, policing and surveillance, health, housing and employment, the seminar will additionally consider the critical role of anti-Black racism, white supremacy, and the construct of the ‘ally’ in entrenching racial inequality and harm at the systems level. The course integrates cross-disciplinary readings and visual and narrative media material from the growing body of work by scholar activists and racial justice movement leaders, as we consider whose meanings and voices are productive of the knowledge and action necessary to dismantle systems of white supremacy and sustain long-standing movements for racial justice. Also listed as WGST 187. Enrollment by permission of instructor (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Public Health Science Capstone",
      "classCode": "PHSC 190",
      "description": "Integrative course organized around a different public health theme each quarter. Includes lectures, readings, guest speakers, and discussion, culminating in student research projects and presentations. The course is intentionally interdisciplinary, demanding that students address public health issues from diverse scientific and cultural perspectives, and employ a variety of analytical tools. Pre- or corequisite: PHSC 100 and 150, or permission of instructor (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Violence Prevention Educators",
      "classCode": "PHSC 191",
      "description": "In this class, students will be trained extensively on topics related to sexual assault outreach and prevention and will learn how to facilitate interactive presentations to peers in classrooms and residence halls. Through multiple avenues of instruction, students will have the opportunity to be leaders who push the dialogue of gender based violence into mainstream campus life. Enrollment is by permission of the instructor. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Engineering World Health",
      "classCode": "PHSC 193",
      "description": "This course is intended for students with an interest in global health, public health, and medicine. The focus will be on health issues in low-resource contexts globally. Students will work in teams on guided research projects with engineering students working on their Senior Design projects. Enrollment is by permission of instructor. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Undergraduate Research",
      "classCode": "PHSC 195",
      "description": "Research project supervised by Public Health Program faculty. Five hours of research per week is expected per unit. Can be repeated for credit, with a maximum of 5 units per academic year. Must be taken P/NP. Enrollment is by permission of the instructor. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Peer Health Education",
      "classCode": "PHSC 196",
      "description": "Provides students with current information on a variety of health topics, including general wellness, alcohol and substance abuse, nutrition, eating disorders, stress, mental health, sexual health, and sexual assault. Basic listening, counseling, group facilitation, public speaking, and presentation skills are developed and nurtured. Students are challenged to grow as leaders, peer counselors, and educators. Upon completion of this course, students are eligible to become a member of the Peer Health Education (PHE) Program. Enrollment by permission of instructor. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Career Exploration in Public Health",
      "classCode": "PHSC 197",
      "description": "This 2-unit course is required for all Public Health Science majors who are currently engaged in, or recently completed, their pre-approved 100-hour public health internship. Through this course, students will: complete their required reflective essay, ensure documentation and verification of internship completion, and provide an analysis of the internship experience and host organization. This course will continue to build on vocational discernment, communication, teamwork, and networking skills discussed in PHSC 139. Prerequisite: PHSC 139 and completed approved internship. P/NP grading. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Peer Health Educator Practicum",
      "classCode": "PHSC 198",
      "description": "This course is for students who have already completed training as peer health educators through PHSC 196 and who will be actively involved in the Peer Health Education Program during the enrolled quarter. Enrollment by permission of instructor. (1 unit)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    }
  ]