[
    {
      "courseName": "Hands-On Physics!",
      "classCode": "PHYS 1",
      "description": "How do scientists know what they “know?” The course is taught in a “Workshop Physics” style emphasizing hands-on experimentation and timely topics in today’s world. Instrumentation and “learning by doing” are emphasized. Includes student-designed, peer-reviewed group projects. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Astronomy: The Solar System",
      "classCode": "PHYS 2",
      "description": "An introduction to astronomy with a particular focus on the origin and evolution of the solar system, planets, and their satellites. Topics include a brief history of the science of astronomy, telescopes and observational methods, gravitation, spectra and the sun, asteroids, comets, astrobiology, searches for new planetary bodies, and Earth science. Students should be familiar with arithmetic and basic algebra. Evening observational lab meets five times during the quarter. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Astronomy: The Universe",
      "classCode": "PHYS 3",
      "description": "An introduction to astronomy with a particular focus on the origin and evolution of the universe, galaxies, and stars. Topics include a brief history of the science of astronomy, understanding the night sky and phases of the moon, telescopes and observational methods, gravitation, spectra and the sun, the big bang, and the expansion and ultimate fate of the universe. Special emphasis is given to stellar evolution, from the birth of stars to their ultimate demise, and stellar remnants such as neutron stars and black holes. Students should be familiar with arithmetic and basic algebra. Evening observational lab meets five times during the quarter. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Physics of Dance",
      "classCode": "PHYS 4",
      "description": "An exploration of the connection between the art of dance and the science of motion with both lecture/discussion sessions and movement laboratories. Topics include mass, force, equilibrium, acceleration, energy, momentum, torque, rotation, and angular momentum. Movement laboratory combines personal experience of movement with scientific measurements and analysis, in other words: “dance it” and “measure it.” This is a lab science course, not a dance technique course. Also listed as DANC 4. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Physics and Technology for Future Leaders",
      "classCode": "PHYS 5",
      "description": "Examples of how science and technology impact daily life are ubiquitous. Each day brings new comforts and challenges to communities around the world. Leaders in government, industry, finance, and elsewhere are expected to make important and impactful decisions every day on issues related to power consumption, new materials technology, transportation, terrorism, global resources, radiation, climate change, energy sources, conservation, and more. To make the best decisions, leaders must be literate in modern science and technology. This course aims to help students understand the need-to-know physics behind many of the debates impacting our world today. Most importantly, the course aims to give students, the future leaders of our world, the basic tools needed to independently and critically analyze technologically relevant material presented in the media everyday. Assumes basic algebra only.  (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Physics of Music",
      "classCode": "PHYS 7",
      "description": "The course explores the physical foundations underlying the production, propagation, and perception of music. No prior knowledge of either physics or music is expected, and math will be restricted to basic algebra and trigonometry. At the end of this course, students should possess a basic understanding of the nature of sound; the basic workings of string, wind, and brass instruments, as well as the human voice and ear; knowledge of basic musical notation; and a familiarity with some acoustical problems and their solutions. Through laboratory investigations, students will become familiar with methods of scientific exploration and gain an appreciation of the experimental method. Also listed as MUSC 19 (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Space Sciences",
      "classCode": "PHYS 8",
      "description": "An introduction to space exploration and how observations from space have influenced our knowledge of Earth and of the other planets in our solar system. This is synthesized within the context of the field of astrobiology, an interdisciplinary study of the origin of the universe, and the evolution and future of life on Earth. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "General Physics I",
      "classCode": "PHYS 11",
      "description": "One-dimensional motion. Vectors. Two-dimensional motion. Newtonian laws of motion. Law of gravitation. Planetary motion. Work. Kinetic and potential energy. Linear momentum and impulse. Torque and rotational motion. Rotational energy and momentum. Equilibrium. Elastic deformation of solids. Density and pressure of fluids. Bernoulli’s principle. Buoyant forces. Surface tension. Includes weekly laboratory. Prerequisite: MATH 11, or 35,or permission of the instructor. The PHYS 31/32/33 sequence and the PHYS 11/12/13 sequence cannot both be taken for credit. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "General Physics II",
      "classCode": "PHYS 12",
      "description": "Temperature. Thermal expansion of solids and liquids. Thermal energy. Heat transfer. Specific heat. Mechanical equivalent of heat. Work and heat. Laws of thermodynamics. Kinetic theory of gases. Ideal gas law. Entropy. Vibration and wave motion. Hooke’s Law. Sound. Electric charges, fields, and potential. Gauss’s Law. Ohm’s Law. Potential difference. Electric potential. Capacitors. Electric current. Resistance and resistivity. Electric energy and power. Kirchhoff’s Rules. RC circuits. Magnetic fields and forces. Ampere’s Law. Induced EMF. Faraday’s Law. Lenz’s Law. Self-inductance. Includes weekly laboratory. Prerequisite: PHYS 11. The PHYS 31/32/33 sequence and the PHYS 11/12/13 sequence cannot both be taken for credit. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "General Physics III",
      "classCode": "PHYS 13",
      "description": "RCL series circuit. Power in an AC circuit. Resonance. Transformers. Optics: reflection, refraction, mirrors, and lenses. Total internal reflection. Diffraction. Young’s double slit interference. Polarization. Optical Instruments. Relativity. Wave-particle duality. Photoelectric effect. X-rays. Pair production and annihilation. Bohr Atom. Spectra. Uncertainty principle. Quantum numbers. Radioactivity. Nuclear particles and reactions. Subnuclear particles. Includes weekly laboratory. Prerequisite: PHYS 12. The PHYS 31/32/33 sequence and the PHYS 11/12/13 sequence cannot both be taken for credit. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Physics for Scientists and Engineers I",
      "classCode": "PHYS 31",
      "description": "Measurement. Vectors. Straight-line kinematics. Kinematics in two dimensions. Laws of inertia, mass conservation, and momentum conservation. Center-of-mass and reference frames. Force. Newtonian mechanics and its applications. Work and kinetic energy. Potential energy and energy conservation. Rotational dynamics. Statics. Includes weekly laboratory.  The PHYS 31/32/33 sequence and the PHYS 11/12/13 sequence cannot both be taken for credit. Prerequisite: MATH 11. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Physics 31H Honors Supplement",
      "classCode": "PHYS 31H",
      "description": "Weekly seminar for 15–20 students that extends the treatment of PHYS 31 topics to more challenging/thought-provoking problems. The seminar is being offered so that PHYS 31 can count for Honors credit. Students who are not in the Honors Program but who have a strong math background and some physics experience, and who want the added fun of working on intriguing problems and solution techniques, may also enroll. (1 unit).",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Physics for Scientists and Engineers II",
      "classCode": "PHYS 32",
      "description": "Simple harmonic motion. Gravitation. Kepler’s Laws. Fluids. Waves. Sound. Interference, diffraction, and polarization. Thermodynamics. Includes weekly laboratory.  The PHYS 31/32/33 sequence and the PHYS 11/12/13 sequence cannot both be taken for credit. Prerequisites: PHYS 31 and MATH 12 or by permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Physics 32H Honors Supplement",
      "classCode": "PHYS 32H",
      "description": "Weekly seminar for 15–20 students that extends the treatment of PHYS 32 topics to more challenging/thought-provoking problems. The seminar is being offered so that PHYS 32 can count for Honors credit. Students who are not in the SCU Honors Program but have a strong interest in physics or math, and who want the added fun of working on intriguing problems and solutions techniques, may also enroll. (1 unit)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Physics for Scientists and Engineers III",
      "classCode": "PHYS 33",
      "description": "Electrostatics. Gauss’s Law. Potential. Capacitance. Electric current. Resistance. Kirchhoff’s rules. DC circuits. AC circuits. Magnetic force. Ampere’s Law. Electromagnetic induction. Includes weekly laboratory.  The PHYS 31/32/33 sequence and the PHYS 11/12/13 sequence cannot both be taken for credit. Prerequisites: PHYS 32 and MATH 13 or by permission of instructor.(5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Physics for Scientists and Engineers IV",
      "classCode": "PHYS 34",
      "description": "Special relativity. Historical development of modern physics: black body radiation, photoelectric effect, Compton scattering, X-rays, Bohr atom, DeBroglie wavelength, Heisenberg uncertainty principle. Quantum waves and particles. Schrödinger equation. Nuclear structure and decay. Particle physics. Introduction to semiconductors. Includes weekly laboratory. Prerequisite: PHYS 33. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Electronic Circuits for Scientists",
      "classCode": "PHYS 70",
      "description": "Linear electric circuits. DC analysis, network theorems, phasor AC analysis. Diode circuits. Physics of p-n junction. Junction diodes, field-effect devices, bipolar junction transistors. Elementary amplifiers. Small-signal device models. Logic gates, digital integrated circuits, Boolean algebra, registers, counters, memory. Operational amplifier circuits. Linear amplifier bias circuits. Includes weekly laboratory. Prerequisite: PHYS 33. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Numerical Methods in Physics",
      "classCode": "PHYS 103",
      "description": "Basic elements of programming in MATLAB. Ordinary and partial differential equations. Fourier transforms and spectral analysis. Linear regression and curve fitting. Numerical integration. Stochastic methods. Selected applications include planetary motion, diffusion, Laplace and Poisson equations, and waves. Weekly computer lab. Prior exposure to basic linear algebra will be helpful but is not required. Prerequisite: MATH 22 or MATH 23 or AMTH 106. Strongly recommended prerequisite: CSCI 10 or COEN 10 or COEN 44 or COEN 45 or MECH 45. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Analytical Mechanics",
      "classCode": "PHYS 104",
      "description": "Calculus of variations. Hamilton’s principle. Lagrangian and Hamiltonian approaches to classical dynamics. Central force motion. Noninertial reference frames. Dynamics of rigid bodies. Selected topics in classical dynamics such as coupled oscillators, special relativity, and chaos theory. Prerequisites: PHYS 31 and MATH 22 or MATH 23 or AMTH 106. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Electromagnetic Theory I",
      "classCode": "PHYS 111",
      "description": "Review of vector calculus. Dirac delta function. Electrostatic fields. Work and energy. Laplace and Poisson equations. Separation of variables. Fourier’s trick. Legendre equation. Multipole expansion. Computational problems. Prerequisites: PHYS 33 and MATH 22 or MATH 23 or AMTH 106. Co-requisite: PHYS 103. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Electromagnetic Theory II",
      "classCode": "PHYS 112",
      "description": "Magnetostatics. Induced electromotive forces. Maxwell’s equations. Energy and momentum in electrodynamics. Electromagnetic stress tensor. Electromagnetic waves. Potential formulation. Computational problems. Dipole radiation. Prerequisite: PHYS 111 or ELEN 104. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Electromagnetism and Optics",
      "classCode": "PHYS 113",
      "description": "Geometric optics. Polarization and optically active media. Interferometry. Optical signal and noise in detection and communication. Interaction of light with metals, dielectrics, and atoms. Thermal radiation. Laser operation. Most students will take 113 and 113L simultaneously. Prerequisite: PHYS 112 or consent of instructor. Also listed without lab as ELEN 725. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Electromagnetism and Optics Lab",
      "classCode": "PHYS 113L",
      "description": "Weekly lab to accompany PHYS 113. Most students will take PHYS 113 and PHYS 113L simultaneously. Corequisite: PHYS 113 OR consent of instructor. (1 unit)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Physics of Solids",
      "classCode": "PHYS 116",
      "description": "Crystal structure. Phonons. Free electron theory of metals. Band theory of solids. Semiconductors. Electrical and thermal transport properties of materials. Magnetism. Superconductivity. Topics from current research literature. PHYS 116 is taught as a capstone course. Prerequisites: PHYS 120, 121, and senior standing. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Thermal Physics",
      "classCode": "PHYS 120",
      "description": "Laws of thermodynamics with applications to ideal and non-ideal systems. Kinetic theory of gases. Entropy. Classical and quantum statistical mechanics. Bose and Fermi systems. Selected topics from magnetism, materials,  and low-temperature physics. Prerequisites: PHYS 34 and PHYS 103 or AMTH 118. Recommended prerequisite: PHYS 121. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Quantum Mechanics I",
      "classCode": "PHYS 121",
      "description": "The Schrödinger equation. The wave-function and its interpretation. One dimensional potentials. Harmonic oscillator. Methods in linear algebra including matrix operations, unitary transformations and rotations, eigenvalue problems and diagonalization. Hilbert space, observables, operators, and Dirac notation. The hydrogen atom. Angular momentum. Prerequisites: PHYS 34 and PHYS 103 or AMTH 118. Recommended prerequisite: MATH 53. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Quantum Mechanics II",
      "classCode": "PHYS 122",
      "description": "Angular momentum and spin. Electrons in EM field. Addition of angular momenta. Identical particles. Time-independent perturbation theory. Fine and hyperfine structure. Time-dependent perturbation theory and its application to light-matter interaction. Fermi’s golden rule. Prerequisite: PHYS 121. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Quantum Mechanics III",
      "classCode": "PHYS 123",
      "description": "Variational principle. WKB approximation. Scattering theory. Single-particle relativistic quantum theories. Quantum paradoxes. Introduction to quantum electrodynamics and/or quantum computation: qubits, quantum gates and circuits, quantum teleportation, quantum algorithms, error correction codes. Quantum computer implementations. Most students will take PHYS 123 and PHYS 123L simultaneously.  Prerequisite: PHYS 122. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Quantum Mechanics III Lab",
      "classCode": "PHYS 123L",
      "description": "Weekly lab to accompany PHYS 123. Most students will take PHYS 123 and PHYS 123L simultaneously. Prerequisite: PHYS 121 and consent of instructor. (1 unit)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Modern Topics in Physics",
      "classCode": "PHYS 141",
      "description": "A course focused on a topic in current physics research selected by junior and senior Physics majors in consultation with department faculty. Recent topics have included quantum information and quantum computation, quantum paradoxes, and high-energy physics. May be repeated for credit. (4–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Laboratory",
      "classCode": "PHYS 151",
      "description": "Students conduct intensive laboratory-based experiments in the areas of atomic, nuclear, quantum and condensed matter physics, RF detection, signal processing and more. Emphasis on in-depth understanding of underlying physics, experimental techniques, data analysis, and dissemination of results. Additional design and implementation of independent table-top project also required. Introduction to LabVIEW programming and LaTeX. Written and oral presentations. Prerequisite: Senior standing in physics or consent of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Astrophysics",
      "classCode": "PHYS 161",
      "description": "A survey of astronomy for science majors focused on the physics and mathematics that astronomers use to interpret observations of planets, stars, and galaxies. Topics include the kinematics of objects in the solar system, the nature of stars and their evolution, and the evolution and formation of galaxies. Prerequisite: PHYS 33. PHYS 34 recommended but not required. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Cosmology",
      "classCode": "PHYS 162",
      "description": "A survey of cosmology for science majors. Much of the course will focus on the properties of an idealized, perfectly smooth, model universe. Topics include the formation of galaxies and clusters in an evolving universe, the Benchmark Model of the universe, dark matter and dark energy, the cosmic microwave background and its fluctuation spectrum, recent results from such experiments as WMAP and Planck, Big Bang nucleosynthesis, and problems with the standard Big Bang models and inflation theory. Prerequisites: PHYS 34 or PHYS 161. Knowledge of calculus through differential equations is assumed. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Biophysics",
      "classCode": "PHYS 171",
      "description": "Diffusion and dissipation in cells. Friction and inertia in biological systems. Entropic and chemical forces. Macromolecules. Molecular machines. Ion pumps. Nerve impulses. Prerequisite: PHYS 33 or consent of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Senior Seminar",
      "classCode": "PHYS 190",
      "description": "Advanced topics in selected areas of physics. Enrollment by permission of instructor. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Physics and Society",
      "classCode": "PHYS 192",
      "description": "Colloquium course that focuses on Physics research topics with significant societal impact. Weekly speakers come from academia, the private sector, industry, non-profits, and government laboratories. Students participate in weekly discussions and write short reflection papers. Prerequisite: PHYS 34. (1 unit)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Undergraduate Physics Research",
      "classCode": "PHYS 198",
      "description": "Departmental work under close professorial direction on research in progress. Permission of the professor directing the research must be secured before registering for this course. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Reading in Physics",
      "classCode": "PHYS 199",
      "description": "Detailed investigation of some area or topic in physics not covered in the regular courses; supervised by a faculty member. Permission of the professor directing the study must be secured before registering for this course. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    }
  ]