[
    {
      "courseName": "Introduction to U.S. Politics",
      "classCode": "POLI 1",
      "description": "Critical analysis of U.S. political values, institutions, and processes. The U.S. political tradition, the Constitution, the presidency, Congress, the bureaucracy, Supreme Court, elections, political parties, interest groups, mass media, political opinion and participation, domestic policies, and foreign policy are examined in depth. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Comparative Politics",
      "classCode": "POLI 2",
      "description": "Government and politics in several states. Emphasis on the development of analytical abilities and critical skills in the evaluation of political culture, processes, and institutions. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to International Relations",
      "classCode": "POLI 25",
      "description": "Conceptual models used to analyze international relations, contemporary problems of world politics, and the methods states employ to provide peace and security. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Political Philosophy",
      "classCode": "POLI 30",
      "description": "An exploration of some of the principal themes and questions of political philosophy through the writings of authors such as Plato, Machiavelli, Marx, and Mill. Prominent themes include theory and practice, individual liberty, morality and politics, freedom, obligation, and justice. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Politics of U.S. Economic Policies",
      "classCode": "POLI 40",
      "description": "Covers basic concepts in microeconomics, macroeconomics, and international economics in order to demonstrate the relationship between the science of economics and the politics of U.S. economic policies. Case studies such as poverty issues, agricultural policies, and immigration and international trade dynamics will demonstrate how economic and political issues, as well as domestic and international policies, are interrelated. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Criminal Justice System",
      "classCode": "POLI 45",
      "description": "Basic understanding of the U.S. criminal justice system: police, courts, probation, imprisonment, parole, and relations with other governmental agencies. Goals, successes, and failures of the system, and possible remedies. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Racial and Ethnic Politics in the U.S.",
      "classCode": "POLI 55",
      "description": "Also listed as ETHN 55. For course description see ETHN 55.. Does not satisfy any major requirement. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Practice of Politics",
      "classCode": "POLI 71",
      "description": "An occasional course taught by a political practitioner with an insider’s perspective on policy issues, e.g. a city, county, or state official; a U.S. Foreign Service Officer; or a representative from a Non-Governmental Organization. Open to qualified students with sophomore standing or above. Does not satisfy any major requirement. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Political Science Research",
      "classCode": "POLI 99",
      "description": "This course provides the necessary tools to understand, critically evaluate, and perform political science research. Students will learn how to conduct a literature review, produce an annotated bibliography, and propose a theoretically informed research design. Topics include case selection; measurement of variables; hypothesis testing; qualitative research methods including interviews, content analysis, and ethnography; survey research; and interpretation and presentation of charts and tables. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Applied Quantitative Methods",
      "classCode": "POLI 101",
      "description": "An applied introduction to statistical techniques that are especially relevant to data from the social sciences. Note: POLI 99 is a required prerequisite for POLI 101. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in Political Philosophy",
      "classCode": "POLI 105",
      "description": "Selected topics in political philosophy. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "American Political Thought",
      "classCode": "POLI 107",
      "description": "Selected topics and themes in the history of American political thought. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Liberty and Diversity",
      "classCode": "POLI 109",
      "description": "Examination of the relationship between liberty and diversity. Beginning with pioneering “classics”—particularly Locke’s Letter on Toleration and Mill’s On Liberty—that extolled both, the course will proceed to explore the contemporary tensions between them, especially regarding free speech. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "History of Political Philosophy I: Greek and Christian",
      "classCode": "POLI 111",
      "description": "Development of Western political thought from its Greek origins in the work of Plato and Aristotle through the work of Aquinas. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "History of Political Philosophy II: Liberalism and Its Roots",
      "classCode": "POLI 112",
      "description": "Western political thought from Machiavelli through the origins of liberalism in the writings of Hobbes, Locke, and Rousseau. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "History of Political Philosophy III: Post-Liberal Theories",
      "classCode": "POLI 113",
      "description": "Writers and themes in political thought from the 19th century to the present, including those offered by Friedrich Nietzche, Simone de Beauvoir, Herbert Marcuse, Isaiah Berlin, Catharine MacKinnon, and Allan Bloom. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Model United Nations Prep",
      "classCode": "POLI 116A",
      "description": "Model United Nations (UN) is a simulation program in which students participate in mock sessions of the United Nations. POLI 116A is a preparatory course for the Model UN conference in spring quarter. Students will learn about the principles of international law and conflict resolution. Note: This course does not meet the upper-division major requirement for International Relations. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Model United Nations: International Conflict Simulation",
      "classCode": "POLI 116B",
      "description": "Simulated United Nations sessions, representing member-nations, debating and preparing resolutions, and engaging in other aspects of diplomacy. Prerequisite: POLI 116A. Note: This course does not meet the upper-division major requirement for International Relations. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The European Union",
      "classCode": "POLI 119",
      "description": "Evolution of European political, social, and economic integration in the postwar period. Emphasis on the institutions and politics of the European Union since the Maastricht treaty, and current issues of European integration, such as the addition of new members, monetary union, and internal democratization. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Politics of the Global Economy",
      "classCode": "POLI 121",
      "description": "An introduction to the politics and institutions of the global economy. Topics include: liberal, realist, and structuralist theories of the global economy; the international trading system and economic regionalism; the international financial system and financial crises; multinational corporations; and economic development in the Global South. Prerequisite: POLI 40 or ECON 1. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Asia-Pacific International Relations",
      "classCode": "POLI 122",
      "description": "An overview of the political, economic, and security dimensions of international relations in the Asia-Pacific  with a focus on the foreign policies of the United States, China, and Japan. The course examines regional flashpoints such as the Korean Peninsula; the role of emerging players such as India and ASEAN; and developments in the  regional economy. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Global Environmental Politics",
      "classCode": "POLI 123",
      "description": "Explores the political, social, scientific, and economic challenges in the pursuit of a just and sustainable global environment. Case studies include climate change, the environmental effects of war, sustainable development, environmental racism, and cross-border pollution which are studied through the lenses of national, intergovernmental, nongovernmental actors and social forces. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Law, Security, and Force",
      "classCode": "POLI 124",
      "description": "An examination of traditional international legal principles involving the use of force in self-defense with case studies to understand how the justification of armed conflict is changing. Discussion of the international community’s adjustment to the evolving nature of sovereignty, increasing globalization, and national defense. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "International Law",
      "classCode": "POLI 125",
      "description": "Sources, nature, and function of international law in world politics. Special attention to the subjects of international law, international transactions, and the rules of war. Viewpoints presented from Western and non-Western perspectives. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "International Organization",
      "classCode": "POLI 126",
      "description": "International organization in world affairs. Political, economic, and social role of the United Nations, regional organizations, specialized agencies, and nonstate transnational actors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in International Relations",
      "classCode": "POLI 127",
      "description": "Selected topics in international relations.(5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "U.S. Foreign Policy",
      "classCode": "POLI 128",
      "description": "Aims, formulation, and implementation of U.S. foreign policy since World War II, focusing on diplomacy, war, security, and trade. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Military and Politics",
      "classCode": "POLI 131",
      "description": "Introduction to concepts and issues in civil-military relations. Historical and comparative analysis of different patterns of military participation in politics, defense policy making and national development. Introduces alternative models for structuring civil-military relations, and examines the problems associated with the models adopted by the United States and other nations. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Race and Ethnicity in the Politics of Developed States",
      "classCode": "POLI 134",
      "description": "An examination of the role of and attempts to deal with racial/ethnic identity and conflict in the politics of the United States, South Africa, the former Soviet Union, Yugoslavia, and Western Europe. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Politics in Latin America",
      "classCode": "POLI 137",
      "description": "Political cultures, processes, and institutions of selected Latin American countries. Dictatorship and revolution, democratization, economic development, and social movements. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Politics and Development in the Global South",
      "classCode": "POLI 140",
      "description": "Multidisciplinary study of politics and political culture in selected states in Africa, Asia, and/or Latin America. Comparisons within and across regions exploring democratization, economic development, racism, diversity and inclusion, sustainability, and environmental justice. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Politics in the Middle East",
      "classCode": "POLI 142",
      "description": "Designed to give students an understanding of the complexities of Middle East politics, the importance of the region to the world, and the role history and religion have played in the political and social development of the various countries in the region. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Democracy and Democracy Building",
      "classCode": "POLI 143",
      "description": "Designed to give students an understanding of theories of democracy and how democracies are built out of military defeat (Germany and Iraq) and internal change either by leaders relinquishing power or popular uprising. Course includes reports of participants about decision making in democratizing processes. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "European Politics",
      "classCode": "POLI 144",
      "description": "An examination of European politics in the postwar era through political parties and institutions. Evaluation of current challenges facing European governments such as immigration, changing welfare states, regional diversity, and an expanding European Union, using national comparisons. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Politics of Former Communist States",
      "classCode": "POLI 145",
      "description": "An examination of transitions of the diverse states of the former Soviet Union and East Europe, with a focus on differences in transitions, progress toward democracy, and the impact on people’s attitudes and lives. Students will work with their peers from these countries. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "African Environment and Development",
      "classCode": "POLI 146",
      "description": "Also listed as ENVS 149. For course description see ENVS 149. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in Comparative Politics",
      "classCode": "POLI 149",
      "description": "Selected topics in comparative politics. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The U.S. Presidency",
      "classCode": "POLI 150",
      "description": "Analysis of the presidency as it has evolved throughout U.S. history. Comparison of presidential powers with those of Congress, the courts, the bureaucracy, the press, political parties, and the public. Prerequisites: POLI 1 and CTW 1&2 for POLI 150AW, which has an Advanced Writing component. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The U.S. Presidency",
      "classCode": "POLI 150AW",
      "description": "Analysis of the presidency as it has evolved throughout U.S. history. Comparison of presidential powers with those of Congress, the courts, the bureaucracy, the press, political parties, and the public. Prerequisites: POLI 1 and CTW 1&2 for POLI 150AW, which has an Advanced Writing component. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The U.S. Congress",
      "classCode": "POLI 151",
      "description": "An examination of the structure, functions, and evolution of the U.S. Congress as both a national lawmaking body and a collection of constituent representatives. Topics include the development of Congress; elections; representation; parties and leaders; the committee system; the lawmaking process; interaction with the presidency, the bureaucracy, the courts, and interest groups; and Congress’s role in making public policies. Prerequisite: POLI 1.  (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Political Participation",
      "classCode": "POLI 152",
      "description": "An examination of who participates in U.S. politics and the various forms of political participation. Elections, political parties, interest groups, community organizing, and political protest. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Minority Politics in the United States",
      "classCode": "POLI 153",
      "description": "Survey course with a focus on the historical and contemporary struggles of minority groups in the United States. The following minority groups are analyzed comparatively within a political and institutional context: African Americans, Latinx, Asian Americans, Native Americans, minority women, gays, and the disabled. This course examines various issues including theories of race, ethnicity, gender, and class to understand how these variables serve as a basis for identification and political mobilization in American politics. Also listed as ETHN 153. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Women and Politics",
      "classCode": "POLI 154",
      "description": "A consideration of the various ways women have changed “politics as usual.” Examination of the status of women today, varieties of feminist thought, women as voters and as an interest group, women in public office, and public policy issues. Also listed as WGST 180. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Political Psychology",
      "classCode": "POLI 155",
      "description": "This course serves as an introduction to the interdisciplinary field of political psychology, which applies theoretical ideas from psychology to understand political processes. Political psychology tends to focus on how politics works at the individual (micro) level. This course will focus on the psychological roots of public opinion and the political behavior of ordinary citizens through an application of psychological theories about personality, learning, cognition, emotion, social influence, and group dynamics to individuals’ political attitudes and behaviors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Politics and Mass Media",
      "classCode": "POLI 156",
      "description": "An examination of the politics of the mass media, interactions between politicians and the media, the effects of mass media, and social media on political life and public opinion, concerns of racial and ethnic minorities, and the ethics of media work. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Environmental Politics and Policy",
      "classCode": "POLI 157",
      "description": "Also listed as ENVS 122. For course description see ENVS 122. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Equality and the U.S. Constitution",
      "classCode": "POLI 160",
      "description": "Constitutional law doctrines and decisions regarding the 14th Amendment’s guarantee of equal protection. Topics include race discrimination (particularly school desegregation and affirmative action), sex discrimination, discrimination against the poor, and discrimination based on sexual orientation and gender identity.(5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Law and Politics in the United States",
      "classCode": "POLI 161",
      "description": "Examination of the U.S. legal system. Topics include legal culture, the adversary system and its alternatives, system participants (litigants, lawyers, and judges), judicial selection, and legal versus political influences on judicial decision making. Special attention to the question of the capacity of courts to serve as agents of social change. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "State and Local Politics",
      "classCode": "POLI 163",
      "description": "A consideration of the politics and processes of state and local governments, with particular attention given to California state, county, and municipal politics. Topics include federalism, executives, legislatures, courts, interest groups, parties, elections, financing, and issues such as education, welfare, criminal justice, transportation, housing, and urban growth. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Studies in Public Policy",
      "classCode": "POLI 164",
      "description": "Selected topics and problems in public policy as viewed from a political insider’s perspective. Taught by a political practitioner. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Public Administration",
      "classCode": "POLI 165",
      "description": "Administration of public policies in terms of broad questions of democratic theory. Organizational theory, public employees, budget making, policy evaluation, and public finance. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "California Politics",
      "classCode": "POLI 166",
      "description": "An examination of the structures and processes of California politics: the state’s constitution, legislature, governor, courts, and executive agencies. Special attention to democratic dilemmas of citizen participation (elections, ballot initiatives), legislative gridlock (redistricting, budget), and crucial policies (education, health and welfare, immigration, criminal justice, energy, and environment). (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Making Public Policy",
      "classCode": "POLI 167",
      "description": "An examination of the nature of U.S. public policy and policy analysis through the use of texts and case studies. Stages of policy development (how an idea becomes a policy, agenda setting, implementation, analysis, and evaluation). Ethical issues in public policy. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in Public Policy",
      "classCode": "POLI 168",
      "description": "Substantive in-depth study of selected issues in U.S. public policy such as health care, criminal justice, housing, and homelessness. Emphasis on the intersection of policy areas. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in U.S. Politics",
      "classCode": "POLI 169",
      "description": "Selected topics in U.S. politics. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Campaigns and Elections",
      "classCode": "POLI 170",
      "description": "Campaigns and elections form the backbone of American democracy. In this course we will explore what political science can tell us about electoral politics at the federal level, including how campaigns develop strategies, how voters make decisions, and the roles parties and interest groups play in shaping the outcomes of elections.  (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Gender and Law in the U.S.",
      "classCode": "POLI 171",
      "description": "Also listed as WGST 118. For course description see WGST 118. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Money in Politics",
      "classCode": "POLI 172",
      "description": "In politics, money talks. In this course, we will consider whether political money and the involvement of monied-interests in politics serve to advance or undermine democratic elections, political equality, freedom of speech, representation, and the production of sound public policies. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Sports and Politics in the U.S.",
      "classCode": "POLI 173",
      "description": "This course is a survey of issues at the intersections of sports and politics in the United States. Topics include the development of sports culture in the United States, race and integration, gender and sexuality, protest and resistance, nationalism and sports diplomacy, the NCAA and college athletics, antitrust and labor law in professional sports, the politics of stadium finance, regulating sports gambling, and a variety of current controversies and ethical issues facing American sports leagues and institutions of government. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Seminar in Comparative Politics",
      "classCode": "POLI 192",
      "description": "Selected topics in comparative politics in various states and regions. Prerequisite: CTW 1&2 for POLI 192AW, which has an Advanced Writing component. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Seminar in Comparative Politics",
      "classCode": "POLI 192AW",
      "description": "Selected topics in comparative politics in various states and regions. Prerequisite: CTW 1&2 for POLI 192AW, which has an Advanced Writing component. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Seminar in Political Philosophy",
      "classCode": "POLI 193",
      "description": "Selected topics in political philosophy. Prerequisite: CTW 1&2 for POLI 193AW, which has an Advanced Writing component. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Seminar in Political Philosophy",
      "classCode": "POLI 193AW",
      "description": "Selected topics in political philosophy. Prerequisite: CTW 1&2 for POLI 193AW, which has an Advanced Writing component. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Seminar in U.S. Politics",
      "classCode": "POLI 195",
      "description": "Selected topics in U.S. politics. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Seminar in U.S. Politics",
      "classCode": "POLI 195DW",
      "description": "Selected topics in U.S. politics. This course has Diversity and Advanced Writing components. Prerequisites: POLI 153; CTW 1&2 for the Advanced Writing component. Also listed as ETHN 185. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Seminar in U.S. Politics",
      "classCode": "POLI 195L",
      "description": "Selected topics in U.S. politics and law. This course satisfies the Pre-Law requirement. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Seminar in International Relations",
      "classCode": "POLI 196",
      "description": "Selected aspects of international political behavior. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Honors Research Projects",
      "classCode": "POLI 197",
      "description": "Independent research and writing on a selected topic or problem. Enrollment restricted to students in the Political Science Honors Program. This course does not satisfy any upper-division requirement for the major.  (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Public Service Internship",
      "classCode": "POLI 198",
      "description": "Directed internships in government agencies, legislative bodies, political parties, or interest groups, public or government affairs departments of corporations, or nonprofit organizations. Open to qualified juniors or seniors with permission of the instructor. (2 units; P/NP)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Public Sector Study and Internship",
      "classCode": "POLI 198A",
      "description": "Directed internships in local government agencies, legislative bodies, political parties, interest groups, public or government affairs departments of corporations, or nonprofit organizations, integrated with classroom analyses of professions in the public sector, frequent guest speakers, and research projects. Open to qualified second-year students and above with permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Public Sector Study and Internship",
      "classCode": "POLI 198B",
      "description": "Directed internships in local government agencies, legislative bodies, political parties, interest groups, public or government affairs departments of corporations, or nonprofit organizations, integrated with classroom analyses of professions in the public sector, frequent guest speakers, and research projects. Open to qualified second-year students and above with permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Public Sector Study and Internship",
      "classCode": "POLI 198EL",
      "description": "Directed internships in local government agencies, legislative bodies, political parties, interest groups, public or government affairs departments of corporations, or nonprofit organizations, integrated with classroom analyses of professions in the public sector, frequent guest speakers, and research projects. Open to qualified juniors and seniors. Note: This course requires participation in community-based learning (CBL) experiences off campus. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Reading",
      "classCode": "POLI 199",
      "description": "Independent study. Intensive work in areas not fully covered in upper-division courses. Prerequisite: A written outline of the proposed course, with required forms and all necessary signatures, must be submitted at least one week prior to registration. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    }
  ]