[
    {
      "courseName": "General Psychology I",
      "classCode": "PSYC 1",
      "description": "The scientific study of behavior. Topics include the biological basis of behavior, sensation and perception, learning, memory, language, problem solving, intelligence, sleep and dreaming, consciousness, and examines research methods and critical analysis of research. Prerequisites: None. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "General Psychology I Honors",
      "classCode": "PSYC 1H",
      "description": "The honors version of PSYC 1. Restricted to students in the University Honors Program and students entering with AP Psychology credit. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "General Psychology II",
      "classCode": "PSYC 2",
      "description": "The scientific study of behavior. Topics include human development, personality, abnormal psychology, clinical intervention, social psychology, psychological assessment, motivation and emotion, cross-cultural psychology, and examines research methods and critical analysis of research. Prerequisites: None. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ways of Knowing",
      "classCode": "PSYC 50",
      "description": "Personal experience, the scientific method, journalistic techniques, anthropological observation methods, intuition, and faith (religious, paranormal) are just a few of the ways of knowing that people use. This course explores each of these ways of knowing with the goal of answering the following questions: What are the strengths of each way of knowing? What are the limitations? Which method of inquiry is best for answering different types of questions? Prerequisites: None. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Statistics and Methods I",
      "classCode": "PSYC 51",
      "description": "An introduction to statistical and research methods used in psychological research. This is the first course in a required three-course statistics and research methods sequence for the psychology major. Prerequisites: Declared psychology major, PSYC 1 or 2. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Statistics and Methods II",
      "classCode": "PSYC 52",
      "description": "A further examination of the statistical and research methods used in psychological research. This is the second course in a required three-course statistics and research methods sequence for the psychology major. Prerequisites: PSYC 1, 2, and PSYC 51. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Statistics and Methods Practicum",
      "classCode": "PSYC 53",
      "description": "This is the third course in a required three-course statistics and research methods sequence for the psychology major. In this course, more advanced statistics and research methods are discussed and then applied to student research projects developed and presented at the end of the course. Psychology majors must complete either Psyc 53 or Psyc 53L to fulfill lower division major requirements. Prerequisite: PSYC 52 and MATH 8. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Foundations of Behavioral Neuroscience",
      "classCode": "PSYC 65",
      "description": "A basic introduction to brain structure and function. The course has standard lecture hours but integrates hands-on laboratory experiential exercises during the class sessions. Prerequisite: None. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Honors Colloquium",
      "classCode": "PSYC 99",
      "description": "Skill development (including practice with data management software, public speaking, writing, and/or ethics) and career development (e.g., preparing applications for graduate programs and/or jobs after college). Students must be accepted into the psychology honors program to enroll in this course. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Writing in Psychology",
      "classCode": "PSYC 102",
      "description": "Development of writing, reading, critical thinking, and literature search skills within traditional formats for communicating scholarship in psychology. Covers the use of the American Psychological Association (APA) style for experimental reports and literature reviews. In addition to developing communication skills, assignments emphasize how to interpret experimental findings and evaluate support for hypotheses. Other assignments will require students to synthesize findings from several published studies and draw conclusions about a body of research. Prerequisites: ENGL 1 and 2, all lower-division psychology requirements or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Topics in Motivation",
      "classCode": "PSYC 111",
      "description": "Seminar exploring theories and research in motivation and emotion. Students will read, discuss, and critically analyze current empirical research and review articles in these areas. Topics emphasized will include cultural and individual variation in motivation and emotion, development of motivation and emotion, and the social, cognitive, and biological bases of motivation and emotion. Prerequisites: Senior standing and all lower-division psychology requirements. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Motivation and Emotion",
      "classCode": "PSYC 112",
      "description": "Scientific study of the various motivational and emotional processes of people and higher animals. Biological drives, psychological survival needs, altered states of consciousness, social motives, and theories of emotion. Prerequisites: All lower-division psychology requirements or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ethics in Psychology",
      "classCode": "PSYC 114",
      "description": "The role of ethical behavior and decision making in the field of psychology and related behavioral, medical, and social sciences. Topics include approaches to moral issues and related to competence; integrity; professional, scientific, and social responsibility; respect for others’ rights and dignity; and concern for others’ welfare. Prerequisite: PSYC 1 or 2, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Psychopathology (formerly Abnormal Psychology)",
      "classCode": "PSYC 115",
      "description": "The study of psychology and human behavior in understanding the etiology, nature, development, and treatment of mental disorders. Topics include models of psychopathology, research, diagnosis, assessment, and treatment of emotional and behavioral disorders, such as affective disorders, personality disorders, sexual disorders, substance abuse disorders, and childhood disorders. Prerequisite: PSYC 1 or 2, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Topics in Psychopathology (formerly Abnormal Psychology)",
      "classCode": "PSYC 116",
      "description": "Advanced topics in psychopathology involve the discipline and principles of psychopathology in understanding the etiology, nature, development, and treatment of behavior and emotional problems and issues. Class topics include the history of psychiatric illness, theoretical models, assessment and intervention approaches, specialization, consultation, ethics, and current trends in the field. The course is designed for senior psychology majors interested in a career in clinical or counseling psychology or related fields. Prerequisites: Senior standing, lower-division psychology requirements, and PSYC 115, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Health Psychology",
      "classCode": "PSYC 117",
      "description": "Health psychology involves the discipline and principles of psychology and human behavior in understanding how the mind and body interact in health and disease. Topics include health promotion and primary prevention of illness, health enhancing and health damaging behaviors, psychosomatic illness, stress and coping, pain management, and a variety of specific behavior-related medical illnesses (e.g., heart disease, eating disorders, cancer, and AIDS). Prerequisite: PSYC 1 or 2, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Topics in Health Psychology",
      "classCode": "PSYC 118",
      "description": "Advanced topics in health psychology that involve the discipline and principles of health psychology in understanding the etiology, nature, development, and treatment of health damaging and health enhancing topics.  Class topics include theoretical models, assessment and intervention approaches, ethics, and current trends in the field.  The course is designed for senior psychology majors interested in a career in health psychology or related fields.  Senior standing (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Sensation and Perception",
      "classCode": "PSYC 120",
      "description": "A theoretical and empirical investigation of human perceptual processes, with an emphasis on both theories and methods. Topics include sensory and perceptual processes of all sensory modalities, with more focus on the vision. We will also explore multisensory integration, the relationship between perception and high-level cognition (memory, language, social cognition, etc.,), applications to real-life problems. Also, we will develop methodological skills and make connections to your knowledge and skills learned from research methods. Prerequisites: all lower-division psychology requirements, or permission of instructor. Psychology Majors: Psyc 53 or 53L; Neuroscience Majors: Neur 1 and Neur 10. (5 Units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Psychology of Learning",
      "classCode": "PSYC 130",
      "description": "A scientific investigation of the principles of learning focused on both experimental and theoretical aspects of the experimental analysis of behavior. Topics include basic behavioral processes (e.g., habituation), classical conditioning, and operant conditioning. Prerequisites: All lower-division psychology requirements or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Cognitive Psychology",
      "classCode": "PSYC 131",
      "description": "A theoretical, empirical, and experiential investigation of human information processing. Topics include the history of cognitive psychology and the following research areas: pattern perception, attention, working memory, long-term memory, memory distortions, imagery, language processes, problem solving and decision-making. Prerequisites: All lower-division psychology requirements or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Topics in Learning",
      "classCode": "PSYC 132",
      "description": "Seminar examines contemporary topics in learning theory and research. This course may emphasize theory and/or application. Original research and current trends will be highlighted. Prerequisites: Senior standing and all lower-division psychology requirements. Recommended but not required: PSYC 130 or 140. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Topics in Cognitive Psychology",
      "classCode": "PSYC 133",
      "description": "Seminar explores contemporary theories and research in cognitive psychology and cognitive neuroscience. Class topics include consciousness, attention, memory, metacognition, and the relationship between imagery and perception. Prerequisites: Senior standing, lower-division psychology requirements, or permission of instructor. Recommended, but not required: PSYC 120, 131, or 166. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Psychology of Education",
      "classCode": "PSYC 134",
      "description": "The role of educational psychology is to understand and improve educational practice through the study of learning and teaching. Students enrolled in this course will be exposed to a variety of topics that relate to the study of learning and teaching. Such topics include cognitive development and language; personal, moral, and social development; learner differences and learner needs; culture and community; behavioral views of learning; motivation in learning and teaching; creating learning environments and evaluation, measurement, and success. Students in this course will be asked to apply what we read about and discuss in class to solve real-world problems related to education. Prerequisites: Junior or Senior standing. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Psychology of Sleep and Dreaming",
      "classCode": "PSYC 135",
      "description": "A theoretical, empirical, and experiential exploration of sleep, sleep disorders, and dreaming. Considers physiological, cognitive, neurocognitive, and functional approaches. Topics include psychophysiology of sleep and dreaming; purported functions of sleep and dreaming; personal and public health consequences of sleep disorders, sleep deprivation, and sleep debt; continuity in mental processes across the sleep/wake cycle; memory for dreams; approaches to working with dreams; and consciousness and dreaming, including lucid dreaming. Prerequisites: All lower-division psychology requirements or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Psycholinguistics",
      "classCode": "PSYC 137",
      "description": "This course examines human language as it is studied from a psychological perspective. Psycholinguistics focuses on understanding how spoken and written language can be dissected into smaller units of sound, meaning, and structure; how language skill develops; how language is used in the social world; and what the causes and consequences are when language breaks down. This course will cover major perspectives and controversies in the field, a variety of experimental techniques that are used to test theories and investigate language use, and how psycholinguistic research can be applied to our everyday experience. Prerequisite: PSYC 1 or 2, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Human Memory",
      "classCode": "PSYC 138",
      "description": "A theoretical, empirical, and experiential exploration of human memory. Emphasizes theory and research, including recent developments in cognitive neuroscience. Topics include historical and contemporary approaches to the scientific study of memory, attention and memory, working memory, long term memory, prospective memory, autobiographical memory, eyewitness memory, age-related changes in memory, what happens when memory fails, and strategies for improving memory. Prerequisites: For Psychology Majors--PSYC 1, 2, 51, 52, and 53. For Neuroscience majors-- NEUR 10, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Behavior Analysis",
      "classCode": "PSYC 140",
      "description": "A scientific investigation of the principles of learning using experimental work focused on the application of behavior analysis. Prerequisites: Psyc 1 or 2 and declared Psychology or Public Health major. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Topics in Culture and Emotion",
      "classCode": "PSYC 141",
      "description": "Seminar examines contemporary topics in the cross-cultural study of emotion. Topics include the structure and categorization of affect and emotion across cultures (e.g., are there culture-specific emotions?), cultural similarities and differences in views of emotions and in different aspects of emotions (e.g., subjective experience, expressive behavior, and physiology). Prerequisites: Senior standing, all lower-division psychology requirements, and either PSYC 150 or 160, or 162, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Psychological Assessment",
      "classCode": "PSYC 144",
      "description": "Principles and issues related to testing and measurement in psychology. Topics include test construction, reliability, validity, and the professional and ethical use of psychological tests and test scores. Prerequisites: All lower-division psychology requirements or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Social Psychology",
      "classCode": "PSYC 150",
      "description": "The scientific investigation of how people influence each other. Students will learn social psychological theories about the causes of human behavior, as well as how these theories can be scientifically tested and applied to solve real-world problems. Topics include social cognition, the self, attitude change, conformity, compliance, group processes, helping, stereotyping, prejudice, discrimination, intergroup relations, aggression, and attraction. Prerequisites:PSYC 1, 2, 51, and 52, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Topics in Social Psychology",
      "classCode": "PSYC 151",
      "description": "Seminar examines contemporary topics in social psychology with a focus on the self and identity. Topics of discussion include self-concept development, social comparison, social identity, and self-affirmation. Original research and current trends, and special focus on ongoing research and applied programs, will be highlighted. Prerequisites: Senior standing, all lower-division psychology requirements, and PSYC 150, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Psychology of Close Relationships",
      "classCode": "PSYC 153",
      "description": "This course is an introduction to the scientific investigation of intimate relationships. Book chapters and journal articles will be drawn from clinical psychology and social psychology. Topics include research methods for studying intimate relationships; theories of attraction, love, and marriage; how we think about and behave in relationships; and interventions for distressed relationships. Prerequisites: PSYC 1, 2, 51 and 52. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Topics in Close Relationships",
      "classCode": "PSYC 154",
      "description": "Seminar examines contemporary topics in the psychology of intimate relationships. The focus will be on original basic and applied research from social psychology and clinical psychology. Topics will include contemporary dating relationships, the use of technology to initiate and maintain relationships, and predictors of outcomes in long-term intimate relationships such as marriage. Prerequisites: Senior standing; all lower-division psychology requirements; and PSYC 153. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Industrial/Organizational Psychology",
      "classCode": "PSYC 157",
      "description": "An introduction to the broad field of Industrial/Organizational (I/O) psychology, which includes science and practice related to personnel selection and placement, training, and development; organizational development; occupational health and safety; work motivation; and other areas concerned with human behavior in organizational contexts. Prerequisites: PSYC 1 or 2, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "User Experience Research",
      "classCode": "PSYC 158",
      "description": "In this course, we will seek to understand users’ needs and experiences, focusing on the practicalities of conducting impactful UX research. We’ll approach this holistically, covering both quantitative and qualitative approaches to research equally and learn all about defining research questions, selecting research approaches and methods, making and executing research plans, analyses, reporting, and implementing findings. There is an emphasis on hands-on practices that are anchored in psychological knowledge and theory and can be used immediately in real-world settings. Prerequisites: PSYC 53, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Personality and Affective Science",
      "classCode": "PSYC 160",
      "description": "The study of individual differences and personality processes. Discussion of major theories of personality and emotion. Current challenges and controversies in personality and affective science. Different methods for assessing personality and emotion. Applications of personality and affective science to everyday life. Prerequisites: PSYC 1, 2 and 52, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Cultural Psychology",
      "classCode": "PSYC 162",
      "description": "Introduction to the perspective and methodology of cultural psychology, which focuses on the cultural constitution of psychological phenomena. This course alternates between abstract discussions (of culture, evolution, and psychology) and more concrete examples of human cultural variation. This course will help students recognize and challenge their assumptions about \"human nature,\" the \"person,\" and what is \"natural, good, and moral.\" Prerequisites: PSYC 1, 2, 51 and 52, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Substance Abuse and Addiction",
      "classCode": "PSYC 163",
      "description": "This course will explore the nature and consequences of alcohol and drug addiction from biological, psychological, and public health perspectives. Students will study common drugs of addiction, the underlying causes of addiction, and treatment strategies. Societal impacts and responses to substance abuse and addiction will be examined in depth. Also listed as PHSC 160. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Behavioral Neuroscience",
      "classCode": "PSYC 165",
      "description": "Emphasis on the neural correlates of motivation, emotion, learning, and memory. May include topics such as: mechanisms of drug action, neural circuit function and dysfunction, and empirical investigation into neural modulation of behavior. Prerequisites: For Psychology Majors: PSYC 1 and 2 required; 51 and 52 preferred. For Neuroscience majors: PSYC 1, NEUR 1 and 10 required. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Human Neuropsychology",
      "classCode": "PSYC 166",
      "description": "Study of human brain function from an experimental perspective. Addresses questions such as: What are the brain mechanisms that lie at the basis of perception and memory, of speech and thought, of movement and action? What happens to these processes when individual parts of the brain are destroyed by disease? Prerequisite: For Psychology Majors--PSYC 1, 2, 51, and 52. For Neuroscience majors--PSYC 1, NEUR 1 and 10. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Psychopharmacology",
      "classCode": "PSYC 167",
      "description": "Examination of the effects of various drugs on the brain and behavior. Topics include various drugs of abuse including legal drugs (e.g., nicotine, alcohol) and illegal drugs (e.g., cocaine, heroin). Prerequisite: For Psychology Majors--PSYC 1, 2, 51, and 52. For Neuroscience majors--PSYC 1, NEUR 1 and 10. (5 Units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Topics in Neuroscience",
      "classCode": "PSYC 168",
      "description": "An integration from various sub-disciplines in psychology with an emphasis on the brain and behavior. Topics may include stress effects on neural development, reward and aversion processing, mental health, memory and/or the effects of drugs on brain and behavior. Prerequisites: Senior standing, all lower-division psychology requirements, or permission of instructor. Recommended but not required: PSYC 165, 166 or 167. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Cognitive Neuroscience",
      "classCode": "PSYC 169",
      "description": "The scientific study of the biological processes and aspects that underlie cognition, with a specific focus on the neural connections in the brain which are involved in mental processes. The class will focus on the neurophysiological and neuroscientific evidence for psychological theories of higher mental function, including attention, memory, perception, consciousness and emotion. We will also discuss how the research in cognitive neuroscience relates to various aspects of our daily life, including topics on AI, neuro-ethics, decision-making, morality, culture, and law. Prerequisite: For Psychology Majors--PSYC 1, 2, 51, and 52. Prerequisite: For Neuroscience majors--PSYC 1, NEUR 1 and 10. (5 Units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Truth and Consequences: Challenging What and How We Know",
      "classCode": "PSYC 170",
      "description": "How do you know something to be true? We explore that fundamental question by examining different ways of knowing, pursuing a more nuanced and sophisticated understanding. We question how we come to construct and accept existing beliefs in psychology, communication, and the general public by challenging what we believe we know to be true. Drawing on humanities, arts, and sciences we will pursue developing critical thinking with the goal of enhanced decision-making reflecting cura personalis. Cross-listed with COMM 169. Prerequisite: upper-division standing. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Adolescent Development",
      "classCode": "PSYC 172",
      "description": "A focus on development during the second decade of life, from puberty through early adulthood. Topics include physical, intellectual, and social development; identity; sexuality; changing social contexts; and life transitions. Prerequisite: PSYC 1 or 2, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Topics in Applied Data Science for Psychologists",
      "classCode": "PSYC 175",
      "description": "In this class, we will explore a few advanced methods to study human behaviors and cognition. Statistical techniques such as Structural Equation Modeling (SEM) and generalized linear models (GLM) will be introduced to analyze complicated cross-sectional and longitudinal datasets, and some state-of-art machine learning methods such as classification, clustering, and neural network models will be explained and introduced. Students will learn some theoretical backgrounds as well as practice examples of these methods with a heavy emphasis on hands-on practices (YES, you need to get your hands dirty!!). In addition, some basic data science skills such as data management and coding in R/RStudio will be practiced. Prereq: Senior Standing and Psyc 53 or 53L. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Topics in Developmental Psychology",
      "classCode": "PSYC 178",
      "description": "Seminar examines contemporary topics in developmental psychology. Original research, current trends, and special focus on ongoing research and applied programs will be highlighted. Focus of seminar can be children and adolescent development or young adult development. Prerequisites: Senior standing; all lower-division psychology requirements; and PSYC 172, 184, 185, or 196. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Identity",
      "classCode": "PSYC 181",
      "description": "Identity is a prominent construct in several sub-disciplines within psychology, including developmental, social, personality, gender, and cross-cultural. In addition, issues of identity increasingly are recognized as an important factor affecting our behavior and beliefs. Identity politics, ethnic and racial biases, and the #TimesUp movement are but three examples of the central role of identity in current events.  The purpose of this class is to understand the multifaceted nature of identity and how it has been examined in psychology. Prerequisites: All Lower-division Psychology requirements (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Psychology of Gender",
      "classCode": "PSYC 182",
      "description": "This course examines research on the psychological gender differences and similarities, the theories behind these differences, and the application of this research to the real world. Topics include gender roles, stereotypes, relationships, the gender pay gap, and objectification. Prerequisite: PSYC 1 or 2, or permission of instructor (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Infancy",
      "classCode": "PSYC 184",
      "description": "This course will investigate the psychological development of humans from conception through toddlerhood to age three. It will include relevant genetic theory, physical, perceptual, and motor development, neurological and cognitive development, early temperament and social development, and individual differences. We will explore how these areas of growth interact within individuals as they build on their earliest foundations during the most rapidly unfolding period of life. We will unpack the unique research methods used to understand and assess these areas of development. And, students will learn first-hand about the practical applications of understanding how typical developmental progresses. Prerequisites: Psyc 1 or 2 and Psyc 51 and 52, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Developmental Psychology",
      "classCode": "PSYC 185",
      "description": "An upper-division survey of child development, including infancy, early childhood, middle childhood, and a brief introduction to adolescent issues. Major developmental theories and methods of studying development are introduced. Principal findings regarding social-emotional, cognitive, and physical development in the different stages of childhood are included, as well as findings about the impact on development of the societal context in which development occurs. Prerequisite: PSYC 1 or 2, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ecopsychology",
      "classCode": "PSYC 192",
      "description": "This course integrates psychological, philosophical (phenomenological), and ecological systems approaches in the study of human-nature relationships. We will explore and apply both first-generation and second-generation ecopsychology paradigms. First-gen ecopsychology is human-centric and emphasizes the benefits to humans of interacting with nature (e.g., experience in nature as ‘therapeutic’); second gen ecopsychology views humans as but one aspect of a complex, bio-dynamic system wherein the human and more-than-human worlds are interdependent and synergistic. This course is rigorous in content and in practice: students' final projects will evaluate and apply theoretical, empirical, and experiential ways of knowing to a contemporary issue in ecopsychology. We also consider our individual and collective responsibilities to foster environmental justice. Pre-requisites: Declared major in Psychology or Environmental Studies, with upper-division standing; completion of at least one research methods course and at least two upper division courses in the student's major, or permission of instructor. This course fulfills an elective requirement in the Psychology and Environmental Studies majors.  (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Psychology of Religion and Spirituality",
      "classCode": "PSYC 193",
      "description": "The discipline and principles of psychology and human behavior in understanding religion and spirituality. Topics include empirical research and theory on religious and spiritual behavior and transformation from the various religious, spiritual, and historical wisdom traditions. Contemplative practices and spiritual tools from the various religious/spiritual wisdom traditions for psychological and physical health will be highlighted. A spiritual formation project will help students experience a hands-on activity to examine their own spiritual formation and development. This course is inclusive in that no particular religious/spiritual tradition or any tradition affiliation is assumed or required, and also highlights evidence-based empirical approaches. Prerequisites: PSYC 1 or 2, and a RTC 1 class. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Research Practicum",
      "classCode": "PSYC 195",
      "description": "Advanced methodological issues taught primarily through direct involvement in an experimental research project. Activities include reviewing the literature, formulating a research question, developing a design and procedure, collecting and analyzing data, and writing a professional research report. Prerequisites: Two upper-division psychology courses. Restricted to psychology majors only or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Psychology of Aging",
      "classCode": "PSYC 196",
      "description": "Development in later life. Topics include theories of aging and development; cognition, perceptual, and social changes in aging; mental health issues in the elderly; and abnormal aging, such as Alzheimer’s disease. Prerequisites: PSYC 1 or 2, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Psychology Labs",
      "classCode": "PSYC 197",
      "description": "Psychology labs vary by topic. Lab assistants will work on projects up to 10 hours per week, as determined by the faculty research supervisor. Students accepted to a lab will register via permission number with their supervisor. (1 unit)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Internship/Practicum",
      "classCode": "PSYC 198",
      "description": "A course where students can learn how they can best apply classroom instruction to their career objectives through academically supported work experience. Internships at Santa Clara University are closely monitored for appropriateness and practical application. Internships should encourage career skills and professional growth. Internships serve to introduce the student to the range of opportunities afforded a degree in the discipline. Students are expected to represent the University in a professional manner and to act responsibly with the client and the assignments. Selected readings. Open to upper-division students with a GPA of 3.0 or higher who have received permission from a faculty sponsor. (2-5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Reading/Directed Research",
      "classCode": "PSYC 199",
      "description": "Independent projects undertaken by upper-division students with a faculty sponsor. To receive course credit, the student must submit a formal written proposal and have it approved by the sponsoring faculty member and the department chair. The proposal must be submitted before the end of the previous quarter and must meet University requirements for independent study credit. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Topics for Directed Reading/Directed Research",
      "classCode": "PSYC 199A",
      "description": "Advanced topic independent projects undertaken by upper-division students with a faculty sponsor. To receive course credit, the student must submit a formal written proposal and have it approved by the sponsoring faculty member and the department chair. The proposal must be submitted before the end of the previous quarter and must meet University requirements for independent study credit and requirements for a psychology Advanced Topic course. Prerequisites: Senior standing, all lower-division psychology requirements or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    }
  ]