[
    {
      "courseName": "Principles of Sociology",
      "classCode": "SOCI 1",
      "description": "Introduces students to the field of sociology. Emphasis on the major sociological perspectives and the basic elements of sociological analysis. Introductory exposure to research methodology. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "11A. and 12A. Cultures & Ideas I and II",
      "classCode": "SOCI 11A",
      "description": "This two-course sequence focuses on a major theme in human experience and culture over a significant period of time. Courses emphasize either broad global interconnections or the construction of Western culture in its global context. Soci 11A will cover disruption of global cultures in the context of transformative shift, andSoci 12A will cover emerging global cultures in the age of the internet. Successful completion of C&I I (SOCI 11A) is a prerequisite for C&I II (SOCI 12A). (4 units each quarter)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "11A. and 12A. Cultures & Ideas I and II",
      "classCode": "SOCI 12A",
      "description": "This two-course sequence focuses on a major theme in human experience and culture over a significant period of time. Courses emphasize either broad global interconnections or the construction of Western culture in its global context. Soci 11A will cover disruption of global cultures in the context of transformative shift, andSoci 12A will cover emerging global cultures in the age of the internet. Successful completion of C&I I (SOCI 11A) is a prerequisite for C&I II (SOCI 12A). (4 units each quarter)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Self, Community, and Society",
      "classCode": "SOCI 30",
      "description": "Explores a specific topic related to the self, community, and society. Use of sociological theories, research, community-based learning, and civic engagement activities to help students analyze and explore the role of the individual in influencing community and society as well as how the individual is shaped by these entities. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Social Problems in the United States",
      "classCode": "SOCI 33",
      "description": "Provides an overview of contemporary social problems in the United States from a sociological perspective with a major emphasis on the ways race, class, and gender shape the development of specific social problems and the public policies offered to address them. Topics may include the economy, economic dislocation, resource deprivation,and social inequalities. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Research Design and Methods",
      "classCode": "SOCI 35",
      "description": "zIntroduces students to the logic and basic methods of sociological research. The focus is on research methods used regularly by sociologists such as participant observation, interviewing, and surveys/statistical analysis. Through a combination of readings and exercises, students will be exposed to a few of sociology’s best practices using each of these methods, as well as how to collect data appropriateto the nature of a project. We will reflect on research ethics and on opportunities for integrating quantitative and qualitative methods throughout the course. Students will gain an understanding of research design, earn IRB Certification, and learn to write a research proposal. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Media, Tech, and Society",
      "classCode": "SOCI 49",
      "description": "Examines the reciprocal impacts of media, tech, and  society, as well as the roles of individuals, groups, institutions, and/or culture on the development, reception, use, and/or deployment of media and technology. Looks at the transforming or potentially transforming effects of media and tech on society . (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Social Entrepreneurship—Leading Change",
      "classCode": "SOCI 60",
      "description": "This interdisciplinary course examines social entrepreneurship and innovation in the context of global and local social issues. . Students learn to apply designthinking to innovate solutions to social problems with an emphasis on grassroots or community-centered problem solving. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Crime and Delinquency",
      "classCode": "SOCI 65",
      "description": "Broadly surveys major issues surrounding the causes and nature of, and solutions to, the problem of crime and delinquency in the United States. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Lower-Division Seminar in Sociology",
      "classCode": "SOCI 91",
      "description": "Seminar for first-year students and sophomores on selected issues in sociology. May be repeated once for credit if the topic changes. Prerequisite: By permission of the instructor and sociology chair only. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Sociology of Religion",
      "classCode": "SOCI 99",
      "description": "Using early and American Christianity as examples, this class examines how various social forces shape the religious beliefs and practices of people of faith. In particular it draws on a number of sociological perspectives, looking both at their historical and philosophical underpinnings and at what they can tell us about religious growth, faith in the modern world, and religiously inspired social action. (4 Units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Qualitative Methods",
      "classCode": "SOCI 118",
      "description": "Provides students with an understanding of qualitative methods for social research by focusing on (1) classical and contemporary sociological works employing qualitative methods, and (2) a selection of qualitative methods and techniques in sociology. Students gain hands-on experience by producing qualitative research. Prerequisite: SOCI 35. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Sociological Theory",
      "classCode": "SOCI 119",
      "description": "Students will engage with sociological theories, concepts, and perspectives drawn from classic and contemporary work to examine foci such as power, inequality, social change, collective action, cooperation, and other key sociological themes with an eye to creating positive change. Required of all majors and minors. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Survey Research and Statistical Analysis",
      "classCode": "SOCI 120",
      "description": "Applies quantitative research designs and statistics to examine sociologically relevant research questions empirically, with attention to the scientific reasoning behind quantitative methodology. Statistical analyses conducted using a statistical package such as SPSS. Prerequisites: SOCI 1, 35. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Research Capstone",
      "classCode": "SOCI 121",
      "description": "Using social science expertise gained in their sociology methods classes, students implement a sociological research project that brings together theoretical and research perspectives. This course is restricted to sociology majors and minors. Prerequisites: SOCI 1, 35, 118, 119, and 120. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Applied Capstone",
      "classCode": "SOCI 122",
      "description": "Using skills gained in their methods classes, students implement an applied research project and learn about the use of applied research in a variety of settings (such as workplaces, non-profits, or other organizations). Students learn to identify problems and generate solutions in varied functional areas (such as policy, interventions, user-focused design, and/or human service provision etc.) Sociology majors only. Prerequisites: SOCI 1, 35, 118, 119, and 120. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Silicon Valley Seminar",
      "classCode": "SOCI 195",
      "description": "Students will be professionalized to disseminate their work in a scholarly venue such as a conference and/or publication. Prerequisites: SOCI 118, SOCI 119, SOCI 120, SOCI 121 or SOCI 122 and recommendation of faculty. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Public Sociology",
      "classCode": "SOCI 198",
      "description": "Presents an opportunity for students with junior or senior standing to reflect on their sociological insights gained as a public sociologists. Public sociology experiences will be curated by the instructor and may include public sociology internships in which students engage in professional development working on projects, individual internships obtained by students, etc. Students will participate in a range of civic engagement assignments and experiences to learn to act as public sociologists using their sociological imagination to enact positive social change in the world and their own professional futures. The course may be repeated to earn upper division credits with a maximum of 10 units counted towards the major/minor as two elective courses. . (5 Units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Sociology of Education",
      "classCode": "SOCI 109",
      "description": "Introduces students to the main issues in the sociology of education, including the role of individuals, different types of schools and organizations, community, and policy. Students will analyze their own educational trajectories and understand the experiences of others by engaging in a community-based learning placement and reflecting on their observations and by analyzing data from schools and neighborhoods. The education system in the United States will be the main focus, with some opportunities for cross-cultural analysis. This course requires that students meet all the qualifications for enrolling in and completing an Arrupe placement. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Honors Thesis",
      "classCode": "SOCI 125",
      "description": "Ordinarily requires an overall GPA of 3.3, a GPA of 3.5 in the major, completion of SOCI 121, and approval of a thesis proposal defining a topic, outlining a theoretically driven research design, and having a timetable for conducting various stages of the research. May be taken only with special permission of the sociology chair. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Intersectionality: Principles and Praxis",
      "classCode": "SOCI 126",
      "description": "How do categorical identities, including race, gender, class, sexuality, disability, etc., work together to create our lived experiences? What is the use of intersectionality as a buzzword, or public concept, in contemporary struggles for social recognition, integration, and equity? This course is an introduction to thinking about intersectionality, as a theoretical frame, a description of lived experience, and method of praxis. It will examine the history and application of intersectionality from black women's movements of the 1970s, to its codification in legal theory, to current scholarship and activism that have intersectionality and intersectional experiences at their core. Also listed as WGST 125 . (5 Units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Group Dynamics",
      "classCode": "SOCI 127",
      "description": "Explores the structure and social processes of socialization in small and large groups. Concepts such as power and prestige, leadership, communication networks, collaboration and conflict, game theory, and distributive justice are examined. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Leadership4Good: Ethics and Social Justice",
      "classCode": "SOCI 127A",
      "description": "Students examine sociological approaches to ethics and social issues. Students practice being \"public sociologists\" by enlisting research to encourage individual and societal decisions that are ethical and justice-oriented when considering potential solutions to social problems. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Spirituality and Ethics in the Digital Age",
      "classCode": "SOCI 128",
      "description": "In this course, students learn about religion, science, and technology from a social scientific perspective. Social scientific theory and data about human behavior and societies will enable us to make more well-informed decisions about our civic and professional lives. In this course, students will develop an understanding of how the social sciences produce knowledge in distinctive ways and gain experiences in assessing theory and evidence with a specific focus on the intersection between religion, science, and technology. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Research Teams and Professional Futures",
      "classCode": "SOCI 129",
      "description": "Involves intensive professionalization opportunities to work in project teams with faculty on research projects of the instructors’ choosing. May be taken multiple times for credit. If taken twice for two quarters for four units total it may count as one sociology elective towards the major or minor. Written instructor approval necessary for registration. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Design Thinking for Sustainable Social Justice",
      "classCode": "SOCI 130",
      "description": "This course examines social entrepreneurship and innovation in the context of global and local social issues. It engages skills including creativity, critical and ethical thinking, reflection, leadership, empathy, and teamwork. Students learn design thinking skills to become innovators and problem solvers. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Sociology of Gender",
      "classCode": "SOCI 131",
      "description": "Gender is a central organizing principle in social relations, giving rise to institutional and social practices that distinguish between men and women on the basis of apparent difference and inequality. This course develops the sociological analysis of gender systems in contemporary American society. In this course, we will critically examine the multiple ways that gender (and connections between gender, race, and sexuality) structures the social world in which we live, and the way that race and sexuality interact with gender. Also listed as WGST 132 (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Inequality and the American Dream",
      "classCode": "SOCI 132",
      "description": "This course examines how inequality has emerged and is sustained in American society, and how it has contributed to the creation of a social hierarchy—that is, the process of social stratification. We will specifically examine this phenomena through the lenses of economic class, which is the root of social stratification theory, as well as gender and race. Students will gain tools to critically examine the historical and contemporary operation of social inequality broadly defined and how it relates to the American dream. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Politics and Society in Developing Societies",
      "classCode": "SOCI 133",
      "description": "Explores social order and political change in developing nations. Content includes the relationship between economic and social development and the emergence of democratic, authoritarian, or revolutionary regimes in Africa, Asia, and Latin America. Emphasis is on ways in which the international system influences development through investigation of theories of interdependence, dependency, and globalization. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Globalization and Inequality",
      "classCode": "SOCI 134",
      "description": "Explores globalization as a historical process through examination of global cases from diverse international settings. Foci may include but are not limited to: innovation as a process that may create new opportunities for some and new forms of disadvantage for others; social change associated with different kinds and periods of globalization; and technologies as drivers of change that may have unintended consequences.  (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Social Change in Latin America",
      "classCode": "SOCI 135",
      "description": "Examines processes of social change in Latin America such as gendered participation in cultural production, politics, national development etc. .. Case studies are chosen by the instructor ). Also listed as WGST 128. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Sociology of Sexualities",
      "classCode": "SOCI 136",
      "description": "This course examines sexuality and the various theoretical and methodological approaches that have been used in sociological studies of sexuality, including those that guide sexuality-related analyses of identities, practices, and behaviors; power and politics; sexual interaction and social relations (at the micro and macro levels); morality and social control; and intersectionality. Such explorations include examining the history of sexuality in the West, and social and academic debates on sexuality, including the types of evidence used to support various theoretical and/or political conclusions that impact particular groups of people differently. (5 units).",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Global Development and Social Change",
      "classCode": "SOCI 137",
      "description": "Examines how conflicts and significant social, economic, and political trends and issues in contemporary United States society and in the world contribute to social change and global migration. The course discusses contemporary sociological concepts, principles, theories, and applications for understanding population movements as they search for social justice around the world. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "International Sociology",
      "classCode": "SOCI 138",
      "description": "Using international case studies, students will understand historical and current trends such as popular culture and media, global population growth, as well as critical social, cultural, economic, and environmental factors. They will also critically learn about local, global, and glocal processes. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Sports and Society: Controversies and Issues",
      "classCode": "SOCI 139",
      "description": "This course introduces the sociological study of sports in society by considering the following questions: 1) How do culture and values influence sports, 2) How do sports influence culture and values, and 3) What is the relationship between sports and the media, politics, economics, race, social class, sexual orientation, and other critical variables sociologists use to understand society. This course will also include discussion of student questions related to sports and society, which will be integrated throughout the course.The course is thus interested in social change in sports as well as social change through sports.(5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Urban Sociology",
      "classCode": "SOCI 140",
      "description": "Involves critical inquiry into urban sociology and theoretical and practical exposure to urban issues. Explores unresolved paradoxes in how we understand urban life and the role of structural and cultural conditions in creating or adding to urban problems such as marginalization, gentrification, displacement, crime, housing, and the social organization of urban America. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Climate Justice",
      "classCode": "SOCI 141",
      "description": "How does climate change affect people differently across the U.S. and the world and what can we do about it? Sociology can help us understand the challenges of climate change and its disproportionate burdens on marginalized communities. We will briefly review climate science, but the core themes of the course concern questions about economics and social justice, power and institutions, and the possibility of creating new, more sustainable ways of living on earth. By incorporating principles of sustainability, we will learn to understand the interrelated spheres of social, environmental, and economic research and action that compose climate justice. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Change Agents and Tech4Good",
      "classCode": "SOCI 142",
      "description": "This course will examine how students can become change agents and work in leadership positions and/or effective teams. Examining different case studies, students will probe the transformation enacted by using frugal technologies, design thinking, social entrepreneurship, and other vehicles for positive social change. Topical areas of inquiry may include but are not limited to sustainability, innovation, social mobility, wellbeing, and/or diverse costs/benefits of varied technologies. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Spirituality in Diversified Societies",
      "classCode": "SOCI 143",
      "description": "Robust social scientific understandings of religion will enable students to critically and comprehensively understand the role that religion plays in the current U.S. society. In this course, equipped by robust methodological tools, students will explore how social inequalities and the lack of diversity may be reproduced through certain religious practices. Students will also develop understandings on how religion may enable us to combat with social inequalities (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Sociology of Belonging and Community",
      "classCode": "SOCI 144",
      "description": "Students consider the current research on belonging and loneliness, specifically how the combination of identity, social context and connections, and communities influence belonging. The role of community service, policy, and civic-engagement as individual pursuits and collective contributors to belonging will also be explored. As part of the course, students will engage in a community-based learning placement to learn from others the role that communities and community-based organizations play in helping members and participants feel part of communities and design a participatory program to build community. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Popular Culture in the Era of Mass Imprisonment",
      "classCode": "SOCI 145",
      "description": "In this class students will examine how popular culture in the era of mass imprisonment (approximately 1970-present) has socialized, reflected, and resisted the discourses central to driving and legitimizing the expansion of carceral control. We will discuss how particular tropes and narratives about crime and justice have been used to justify increasing police budgets and legal powers, as well as magnify restrictions and penalties against criminalized communities. Students will explore the ways that these stories and images have been represented in various forms of media (particularly film and television), and learn to connect these representations to the politics of carceral expansion prevalent at the time. Throughout this course we will discuss how storytelling, evolving technology, and cultural/artistic movements have been essential for convincing the public to see criminal threats as real and restrictive social control as necessary; at the same time, these have also been key for artists and organizers seeking to challenge the logic of law-and-order politics, reflect the experiences of those most impacted by these politics, or defend their communities from carceral state violence. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Diversity Issues in Contemporary American Organizations",
      "classCode": "SOCI 148",
      "description": "Offers a serious exploration of both the ethical and practical challenges posed by the diversity of stakeholder interests in organizations. Critical reflection on the implications of client-centered approaches to organizational activity for people working in organizations, and also for structure, culture, communication, and process in those organizations. Requires a community-based learning placement working alongside and/or in the service of persons who are marginalized in the local community. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Tech, Innovation, and Culture",
      "classCode": "SOCI 149",
      "description": "Examines the interplay between tech, innovation, and culture. Explores the impact of society on the development of science/technology and the potential reciprocal influences of scientific and technological innovation on culture and society. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Immigrant Entrepreneurship and Experiences",
      "classCode": "SOCI 150",
      "description": "Immigrant businesses represent a growing sector within the United States economy and contribute to social, political, and cultural changes in the United States. Examines the development and significance of immigrant business owners and the communities clusters within which these businesses are located including Silicon Valley. Also listed as ETHN 170. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Work, Culture,  and Society in the 21st Century",
      "classCode": "SOCI 152",
      "description": "This course examines socioeconomic variation in work, culture, and society.  Foci may include mobility and opportunity, wealth and wage gaps, labor markets and unions, and family and gender dynamics. Also listed as WGST 181. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Race, Class, and Gender in the United States",
      "classCode": "SOCI 153",
      "description": "Examines the sociological nature of the intersectionality of race/ethnicity, social class, and gender by focusing on the interrelationships among social institutions, power relationships, and cultural patterns. May also focus on the impact of popular culture on the social construction of social identities. Also listed as ETHN 151 and WGST 115. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Inequality, Poverty, and Social Policy in the United States",
      "classCode": "SOCI 154",
      "description": "Over the last several decades, inequality in the U.S. has increased substantially. Why has this happened, and what can be done about it? This course examines the causes and consequences of U.S. poverty and inequality, and explores strategies for addressing it. The course will begin by surveying the basic features of poverty, income and wealth inequality, and economic mobility in the 21st century. We cover the major theoretical explanations scholars have advanced to explain the persistence of poverty and inequality including labor markets, healthcare, and education, housing and neighborhoods, and more. Students will engage in different forms of policy-relevant writing and discussion, including debates, policy proposals, and letters to policymakers. (5 Units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Children, Youth, & Society",
      "classCode": "SOCI 155",
      "description": "This course examines the complexities associated with being a young person in America today from a sociological perspective. Course begins by examining the meanings of childhood and adolescence from a historical perspective, and how and why these meanings have changed over time. Then, the course is organized around the primary structures of inequality and how these axes intersect to inform diverse experiences of childhood in America today. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Sociology of Family",
      "classCode": "SOCI 157",
      "description": "Examines patterns in partnering and family from a sociological perspective. Examines the socio-historical development of the family as a complex and dynamic social institution, including the macro causes and consequences of different family structures and role expectations. Foci may include dating, family formation, child-rearing, divorce, and extended family support systems. Also listed as WGST 182. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Deviance and Social Control",
      "classCode": "SOCI 158",
      "description": "Examines how the designation of communities and behaviors as deviant reinforces power hierarchies and forms of social control. Topics may include eating disorders, relationship abuse, child abuse, sexual harassment, substance abuse, and others. Theoretical perspectives could include classical and contemporary, critical theory, feminist theory, critical race theory, etc. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Crime and Punishment",
      "classCode": "SOCI 159",
      "description": "Examines criminal behavior on the aggregate level and its effects in the United States and other societies. Topics may include violent and nonviolent forms of criminality, as well as political violence and terrorism or corporate crimes etc.. Theoretical emphases may include classical,contemporary, critical, and social justice perspectives. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Law and Society",
      "classCode": "SOCI 160",
      "description": "Surveys classical and contemporary sociological theories of law and society. Topics typically include the social construction of law; law and capitalism; law and social solidarity; gender, race, and class inequality and the law; and private/public divisions and the law. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Criminal Justice Systems",
      "classCode": "SOCI 161",
      "description": "Examines criminal justice systems in the United States and other countries from a comparative perspective. Topics typically include law enforcement, the courts, corrections (prisons and probation), and juvenile criminal justice systems. Theoretical emphasis on classical and contemporary critical and social justice perspectives. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Gender and Justice",
      "classCode": "SOCI 162",
      "description": "Includes topics relevant to gender and justice related to criminology and criminal justice systems, with a particular emphasis on the experiences of women and justice. Also listed as WGST 188. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Leisure, Culture, and Work",
      "classCode": "SOCI 163",
      "description": "Examines the evolution of leisure and work in industrial and postindustrial societies. Foci may include work motivation models, group influences, and cultural shifts. The course also covers how new technologies and flexible work schedules impact relationships and personal leisure. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Social Movements",
      "classCode": "SOCI 164",
      "description": "The course studies social movements, collectives, activism, intentional communities, religious and secular advocates, and groups promoting social change. Examples could include environmental, religious, racial/ethnic, political, economic, scientific, artistic, cultural, social justice movements, etc. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Human Services",
      "classCode": "SOCI 165",
      "description": "Provides an introduction to the field of human services. Topics include the connections between societal understanding of social problems, programs, and policies; work and management issues in public and nonprofit human service agencies; human services in a multicultural context; and opportunities to learn through community-based placements serving marginalized communities and from human service professionals. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Democracy, Populism, Authoritarianism",
      "classCode": "SOCI 168",
      "description": "Involves analysis of power relations in the United States and examination of different dimensions of power and popular participation. Particular emphasis is on the development of state-society relations, legitimation, strategies of resistance, and civil society. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Management of Health Care Organizations",
      "classCode": "SOCI 172",
      "description": "Explores the sociological and practical issues of operations, financing, and management in organizations providing services for people with health problems (organizations such as nursing homes and hospitals) or people with infirmities (organizations such as senior care centers and assisted living facilities). Also listed as PHSC 172. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Race and Inequality",
      "classCode": "SOCI 175",
      "description": "Examines the racial/ethnic inequality that African, Asian, Hispanic, and Native Americans and other groups experience in contemporary United States society. This course covers theories of race and ethnicity, examines empirical research on a range of topics (poverty, social class, assimilation, identity, segregation, stereotyping), and explores the meaning and consequences for racial/ethnic inequality in the future. Also listed as ETHN 167. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Care and Dignity Across the Lifecourse",
      "classCode": "SOCI 176",
      "description": "A survey of public policy issues particularly care and care work. Includes consideration of the legal aspects of death and dying, involuntary commitment, guardianship and conservatorship, age discrimination, public benefit programs, and nursing homes. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Immigrant Communities",
      "classCode": "SOCI 180",
      "description": "Explores the impact of immigration to the United States, particularly the effect of the immigration reform law of 1965 that resulted in large increases in immigration to the United States, particularly from Latin America and Asia. This wave of immigrants and their U.S.–born children has significantly changed the fabric of American society. Examines case studies of immigrants and the second generation from Cuba, Mexico, Nicaragua, Vietnam, and Haiti using comparative sociological perspectives and theories of community formation . Also listed as ETHN 171. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Power of Pop Culture and Innovation",
      "classCode": "SOCI 181",
      "description": "From social media to major sporting events to music festivals and beyond, this course unpacks the power of popular culture in our everyday lives with attention to key sociological themes such as status, identity, and power. Students will explore how diverse forms of popular culture depend on technological innovation and diffusion, as well as how popular culture can initiate societal change. From influencers to athletes to musicians, topics may include but are not limited to music, movies and TV, art, fashion, dance, cyberculture, sports, etc. Current phenomena chosen by instructor with case studies such as TikTok, Super Bowl, and Coachella (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Entrepreneurship, Consumer Culture, and Social Change",
      "classCode": "SOCI 182",
      "description": "This course uses the sociological imagination to consider how shopping and consumption have the power to reflect and channel social and cultural change. Considering key case studies (such as Amazon,Shark Tank, and Fast Fashion) students will explore how shopping and consumption are driven by technological change and innovation to consider how shopping, buying, and selling are deeply rooted social practices that tell us much about culture, values, and the influence between society and technology. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Research in Social Entrepreneurship",
      "classCode": "SOCI 184",
      "description": "Introduces keywords and concepts in social entrepreneurship; business plans and technology strategies used in this field; three economic sectors in which social entrepreneurship has been applied; and tools for reflection upon personal vocation. Prepares students for a summer immersion experience with social entrepreneurs, and for conducting ethnographic research overseas by developing the social and technical skills they will need to work with these enterprises. Enrollment restricted to those selected as Global Social Benefit Fellows. Also listed as ELSJ 184. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Seminar in Social Entrepreneurship",
      "classCode": "SOCI 185",
      "description": "This course draws upon field experiences as global social benefit fellows to mentor students in reflection on their own personal development as leaders, and in the art and science of research. Weekly seminars will consist of fellows presenting their own research and reflections upon their vocation. Research projects will analyze the social impact of the entrepreneurs' work and the role technology plays in providing social benefit. Students will reflect upon their experience of engaging with the communities served by social entrepreneurs, and the implications for their own vocation. Also listed as ELSJ 135. Required prerequisite: ELSJ 134 or SOCI 184 (Research in Social Entrepreneurship). ( 5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Seminars in Sociology",
      "classCode": "SOCI 190",
      "description": "Seminars for juniors and seniors in which selected issues in sociology or current problems of social relevance are investigated in depth. Like in any seminar, students who enroll in the course are expected to actively contribute to the examination of the topics at hand. May be repeated once for credit if the topic changes. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Peer Educators",
      "classCode": "SOCI 194",
      "description": "Peer educators in sociology work closely with a faculty member to help students in a course understand course material, think more deeply about course material, benefit from collaborative learning, enhance student confidence in the materials, , and/or to help students enjoy learning. Enrollment is by permission of the instructor. (1 or 2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Reading/Directed Research",
      "classCode": "SOCI 199",
      "description": "Involves intensive reading in areas not emphasized by the department or independent research on specific topics not fully covered in departmental courses. May be repeated once for credit under certain circumstances and with the approval of the sociology chair. Written departmental approval necessary prior to registration. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    }
  ]