[
    {
      "courseName": "1A. and 2A. Critical Thinking and Writing I & II",
      "classCode": "THTR 1A",
      "description": "A two-course themed sequence featuring study and practice of academic discourse, with emphasis on critical reading and writing, composing processes, and rhetorical situations. The second course will feature more advanced study and practice of academic discourse, with additional emphasis on information literacy and skills related to developing and organizing longer and more complex documents. Themes address a variety of contemporary topics. Successful completion of CTW I (THTR 1A) is a prerequisite for CTW II (THTR 2A).(4 units each quarter)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "1A. and 2A. Critical Thinking and Writing I & II",
      "classCode": "THTR 2A",
      "description": "A two-course themed sequence featuring study and practice of academic discourse, with emphasis on critical reading and writing, composing processes, and rhetorical situations. The second course will feature more advanced study and practice of academic discourse, with additional emphasis on information literacy and skills related to developing and organizing longer and more complex documents. Themes address a variety of contemporary topics. Successful completion of CTW I (THTR 1A) is a prerequisite for CTW II (THTR 2A).(4 units each quarter)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Improv",
      "classCode": "THTR 7",
      "description": "Designed for majors and nonmajors, Improv seeks to expand the participant’s capability for spontaneity, flexibility of thought, creativity, communication, and teamwork through the use of theatre games and specifically structured improvisation exercises. No previous acting experience is necessary for this course. Every level of performer or non-performer will have something to contribute and learn from this experience. Topics such as the impact of status on relationships, nonverbal communication, staying positive, building on ideas offered by others, and developing narratives will be explored throughout this class. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Acting for Nonmajors",
      "classCode": "THTR 8",
      "description": "Through standard theatre exercises, monologues, and scenes, students will explore basic principles and the process of acting. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Defining the Performing Artist",
      "classCode": "THTR 9",
      "description": "Being in tune as a performing artist means being aware of the connection between body, mind, and spirit. Topics include discussion of professional résumés, head shots, auditions, and career choices. Also, the implications of being a performing artist, body image and awareness, self-esteem, lifestyle/health choices, nutrition and diet, and stress management strategies. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Performance Collaboration",
      "classCode": "THTR 10",
      "description": "This class introduces basic acting (character development, concept analysis) and dance concepts (dynamics, rhythm, shape) to explore creativity and performance with an emphasis on the collaborative process. The class culminates with a student-devised original work. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "11A. and 12A. Cultures and Ideas I & II",
      "classCode": "THTR 11A",
      "description": "A two-course sequence focusing on a major theme in human experience and culture over a significant period of time. Courses emphasize either broad global interconnections or the construction of Western culture in its global context. Courses may address creativity and the use of space, the performing arts as reflections and constructions of culture, and other topics. Successful completion of C&I I (THTR 11A) is a prerequisite for C&I II (THTR 12A). (4 units each quarter)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "11A. and 12A. Cultures and Ideas I & II",
      "classCode": "THTR 12A",
      "description": "A two-course sequence focusing on a major theme in human experience and culture over a significant period of time. Courses emphasize either broad global interconnections or the construction of Western culture in its global context. Courses may address creativity and the use of space, the performing arts as reflections and constructions of culture, and other topics. Successful completion of C&I I (THTR 11A) is a prerequisite for C&I II (THTR 12A). (4 units each quarter)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Voice I: Voice, Speech, and Presentation Skills",
      "classCode": "THTR 21",
      "description": "Using physical exercises, breath work, speech, and resonance exercises, students will expand their knowledge of the mechanics of speech and increase their vocal potential and health onstage or in any public speaking environment. Though not required of majors, it is HIGHLY recommended for all majors to take this class. Priority given to theatre arts majors/minors. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Intermediate Acting",
      "classCode": "THTR 24",
      "description": "Advancing the acting curriculum begun in THTR 8 and THTR 10; improv, open scenes, monologues, and scripted scenes are used to explore and acquire a comprehensive process by which to create and sustain a truthful, imaginative, and physical character on stage. Application of the concepts of “objective/intention, actions, and qualities of action” are applied to scripted material. Students rehearse and perform scenes from plays in the global theatrical canon. Priority given to theatre arts majors, then to minors. Designed to follow THTR 8 and 10. Prerequisites: THTR 8 or permission of instructor. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Stage Combat",
      "classCode": "THTR 25",
      "description": "Learn the fundamental techniques of pre-planned, safely executed moves for unarmed, and rapier and dagger combat for the stage. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Theatre to Go",
      "classCode": "THTR 28",
      "description": "The development and production of a 40- to 45-minute play from various genres. Topics may include children’s theatre, Shakespeare, social justice, and documentary theatre. Plays will be taken out into the community for performance. Projects may be extended into a second quarter, in which case students may re-enroll for additional units. (2–4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Rehearsal and Performance",
      "classCode": "THTR 29",
      "description": "Active participation in the preparation and performance of departmental productions as actors, assistants to the director, dancers, and choreographers. Individual design/technical assignments. May be repeated for a total of 8 units. Prerequisite: Approval of director of production. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Design",
      "classCode": "THTR 30",
      "description": "Explores the role of design as a part of the production process. Includes a study of the elements and principles of design as they apply to scenic, lighting, and costume design. Also included: design development and the role of each designer in the production. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Production",
      "classCode": "THTR 31",
      "description": "Overview of the organization, concepts, terminology, and skills involved in technical theatre. Hands-on work in the scene shop. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Costume Construction",
      "classCode": "THTR 32",
      "description": "Introduction to making costumes: fabric/textile studies, sewing techniques, dyeing and ornamentation, and costume crafts. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Stage Lighting",
      "classCode": "THTR 33",
      "description": "Principles and practice. Color, instrumentation, basic electricity, and electronics. Elementary design theory and practice. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Technical Theater I",
      "classCode": "THTR 35",
      "description": "Through hands-on experience, we will explore technology used in theatrical effects. Offered in alternate years. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Scene Painting",
      "classCode": "THTR 36",
      "description": "Introduction to the styles, techniques, and application of scenic art as it relates to the theater.  Projects include interpreting painter's elevations and research, and applying various skills and textures to in-class assignments and practical application for department productions. Offered in alternate years. Prerequisite: THTR 30 or permission of instructor. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Graphics & Rendering for Theatre Design",
      "classCode": "THTR 37",
      "description": "Learn the skills and techniques used to communicate a set design.  Topics include drafting (both by hand and CAD), mechanical perspective, painter's elevations, and white model development.Offered in alternate years.Prerequisite: THTR 30 or permission of instructor. Prerequisite: THTR 30 or permission of instructor. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Makeup for Stage",
      "classCode": "THTR 38",
      "description": "Basic principles of makeup for the stage. Focus placed on the techniques of makeup with specific design for character:Youth, old age, fantasy and special problems. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Production Workshop",
      "classCode": "THTR 39",
      "description": "Training in development of technical skills for stage production. Directed work in scenery and costume construction, lighting, sound, and stage management. May be repeated for a total of 8 units. Not applicable to paid work hours or to laboratory hours connected with stagecraft courses. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Critical Perspectives in Performance A",
      "classCode": "THTR 41A",
      "description": "Explores the dynamic relationships among theatrical space, acting styles, dramatic texts, and audience reception. This course will engage these perspectives with a special focus on performing faith, staging power, and dramatizing identity. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Critical Perspectives in Performance B",
      "classCode": "THTR 42B",
      "description": "Explores the dynamic relationships among theatrical space, acting styles, dramatic texts, and audience reception. This course will engage these perspectives with a special focus on staging spectacle, characterizing style, and playing on the global stage. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Modern American Theatre History: Censorship, Arts Funding, and Theatre Unions",
      "classCode": "THTR 44",
      "description": "Relationship between the theatre arts and society. Through the study of significant cultural history as well as theatre literature, this course tackles important social justice issues involving censorship, arts funding, theatre unions, and the shaping of American values. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Drama in Ethics, The Ethics in Drama",
      "classCode": "THTR 60",
      "description": "An examination of philosophical ethics both in theory and in the dramatic portrayal of characters struggling with particular ethical problems. Also an exercise in writing original dialogue for characters contending with ethical decisions and in acting dramatic dialogue taken from published plays and student scene writing. Students’ attention and efforts will be directed not only to the cognitive, but also to the affective and bodily dimensions of ethical decision-making in particular circumstances. This course is intended to be a melding of philosophical reflection and inquiry with theatrical artistic expression in order to better understand what it means to be a virtuous person who lives a good life in an ambiguous world. Also listed as ETHN 33. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Drama of Diversity",
      "classCode": "THTR 65",
      "description": "Addresses issues of race, ethnicity, class, gender, and sexuality through the lens of American theatre by several groups outside of the dominant culture including, but not limited to, works from the African-American, Asian-American, Chicana/o, Native American, and lesbian, gay, bisexual, and transgender (LGBT) perspectives. Also listed as ETHN 65. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Devised Theater Workshop",
      "classCode": "THTR 75",
      "description": "This class will become an ensemble that collaboratively creates an original devised theater piece. Methods of working will include writing, research, movement explorations, improvisation, the sequencing of material, weekly working notes, and class discussion. The new piece will then go into rehearsal and be performed the following quarter. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Musical Theatre Production Workshop",
      "classCode": "THTR 80",
      "description": "Gives students the opportunity to perform in a musical theatre production workshop that covers the study of songs and scenes from a wide variety of musicals. The class presents an original musical review at the end of the quarter. Offered in alternate years. Prerequisites for majors and minors: THTR 8 or 10 or 24, MUSC 34 or 3 quarters of private voice instruction, DANC 40 or 46. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Incarnating the Word: Theology and Theatre",
      "classCode": "THTR 109",
      "description": "Despite the often anxious relationship between Christianity and the performing arts, Jesuit education has long emphasized the importance of performance in forming integral human beings conscious of their place in the universe and competent to assume their roles on the stage of the world ad maiorem Dei gloriam. This interdisciplinary course aims at reverencing this educational tradition by exploring the dynamic relationship between fundamental theology and theatrical performance. By reading and considering theological texts alongside plays from a variety of historical periods, students will develop a deeper understanding and appreciation of theology as theatrical and theatre as theological. Also listed as TESP 52. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics: Theatre and Performance",
      "classCode": "THTR 112",
      "description": "In-depth exploration of specific genres, periods, playwrights, or themes. Also listed as ENGL 166. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Seminar: Theatre and Performance",
      "classCode": "THTR 113",
      "description": "In-depth exploration of a specific genre, period, playwright, or theme. Also listed as ENGL 166. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Shakespeare’s Plays in Performance",
      "classCode": "THTR 119",
      "description": "An exploration of a selection of Shakespeare’s plays in performance with particular attention to an important topic chosen for focus and specified in the course description subtitle—for example, Shakespeare and Gender, Intercultural Shakespeare, Shakespeare in Production, Shakespeare and Justice, Shakespeare and Film, Shakespeare and the Contemporary World. May be taken more than once when topics differ. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Acting Styles I: Shakespeare",
      "classCode": "THTR 120",
      "description": "Techniques for performing the works of William Shakespeare and other Elizabethan playwrights. Learn scansion and perform sonnets, monologues, and scenes from plays. Prerequisites: THTR 8 or10 and 24,or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Acting Styles II: Acting for the Camera",
      "classCode": "THTR 122",
      "description": "Specific techniques of acting in commercials, television, industrials, and film. Perform scenes in front of the camera to achieve understanding of the differences and similarities of acting in this media and theatre. Prerequisites: THTR 8 or 10 and 24, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Acting Styles III: Musical Theatre",
      "classCode": "THTR 123",
      "description": "Study of the techniques of acting in this special genre including phrasing, interpretation of lyrics, and auditioning. Prerequisites: THTR 8 or 10 and 24, MUSC 34or 3 quarters of private voice instruction, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Acting Styles IV: Scene Study with Dialects",
      "classCode": "THTR 124",
      "description": "Building on the skill sets obtained in THTR 10 and 24, students will continue to deepen the application of their acting and vocal techniques in the study of texts that require a region-specific sound. Students will learn to research and reproduce at least four major dialects used on the stage and screen. Combined with vocal flexibility work, students will apply their dialect research to at least four different monologues or scenes. Prerequisites: THTR 8 or 10, 21 and 24, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Acting Styles V: Special Topics",
      "classCode": "THTR 125",
      "description": "An upper level Acting course that may include acting styles or techniques relative to specific themes or authors - i.e. Stage Combat, Physical Acting with Ann Bogart's Viewpoints, Intimacy and Theatre, Global Acting Styles, etc.  Special Topics often respond to Department Production needs by training actors in the special skills needed for a particular production.  Prerequisites: THTR 8 or 10 and 24, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Theatre to Go",
      "classCode": "THTR 128",
      "description": "For course description see THTR 28. (2–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Rehearsal and Performance",
      "classCode": "THTR 129",
      "description": "For course description see THTR 29. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Technical Design",
      "classCode": "THTR 130",
      "description": "The process of taking scenery from designer drawings to actual set pieces. Transformation of scene designs to carpenter drawings, standard building methods, stage machinery solutions, and budget-regulated design options. Offered in alternate years. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Sound Design",
      "classCode": "THTR 131",
      "description": "Principles of the use of sound in theatre production. Emphasis on practical applications and equipment use. Digital audio and playback automation. Offered in alternate years. Prerequisite: THTR 30 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Lighting Design",
      "classCode": "THTR 132",
      "description": "Application of lighting skills to production design. Offered in alternate years. Prerequisite: THTR 33 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Scene Design",
      "classCode": "THTR 133",
      "description": "Application of graphic skills to scenic design. Topics include period research, color rendering, finished color model, and portfolio presentation. Offered in alternate years. Prerequisite: THTR 30 and THTR 37 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Costume Design",
      "classCode": "THTR 134",
      "description": "Principles of costume design for the stage. Application of design elements to convey character and production concepts. Period research, style, and rendering techniques. Offered in alternate years. Prerequisite: THTR 30 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Scene Painting",
      "classCode": "THTR 136",
      "description": "This course is an advanced level continuation of THTR 36.  Students in the upper division course complete an additional detailed assignment combining skills learned in THTR 36.Prerequisite: THTR 36 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Pattern Drafting and Draping",
      "classCode": "THTR 137",
      "description": "Drafting and draping techniques for a basic bodice, skirt, sleeve, and collars, and techniques for developing variations. Emphasis on drafting and seeing fabric manipulation in light ofperiod garments. Offered in alternate years. Prerequisite: THTR 32 or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Production Management",
      "classCode": "THTR 138",
      "description": "Designed to acquaint students with the complexities of managing productions from the audition process to final performance. Directing, lighting, scenic production, sound, cueing, budgets, and personnel management are aspects that will be touched upon in class. Offered in alternate years. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Production Workshop",
      "classCode": "THTR 139",
      "description": "For course description see THTR 39. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Fashion, Politics, and Issues of Gender",
      "classCode": "THTR 151",
      "description": "Historical exploration of fashion not merely as a matter of personal taste, but as a sight for examining the interconnections of power, politics, gender, class and ethnicity. The course will consider the role of fashion in constructing gender and ethnic identities, social and political structures, and fomenting revolution. Also listed as WGST 183. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Black Theater",
      "classCode": "THTR 161",
      "description": "An exploration of the contributions Black artists have made to enrich the American theatre as playwrights, actors, designers,directors, and theorists. Also listed as ENGL 129and ETHN 136. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Theatre of Dissent: Social Movements, Migration, and Revolution in the Americas",
      "classCode": "THTR 163",
      "description": "This course explores artistic reactions to political dissent in the United States and Latin America through an intersectional, praxis-based, and feminist approach to Performance Studies. To this end, students will analyze works of cultural representation such as dramatic literature, theatre/performance, poetry, and aesthetic methodologies, alongside relevant scholarly writing. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "History of American Musical Theatre",
      "classCode": "THTR 165",
      "description": "A cultural look at musical theatre as an American art form, which has its roots in vaudeville, burlesque, and minstrel shows. Offered in alternate years. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Performing Identities: Staging Gender, Race, and Class",
      "classCode": "THTR 167",
      "description": "Because of the transporting and sometimes even transforming spaces they create in society, the performing arts prove particularly useful in examining enactments of human identity. Performing Identities will consider how fundamental aspects of “American” self-understanding are reflected, magnified, fractured, and constructed in and through the performing arts. The course will consider gender, race, and sexuality as performance and in performance. Paying particular attention to the ways in which these prominent categories cross paths on a variety of formal and informal stages, we will explore the role of the performing arts in defending human dignity and promoting a more just society.Also listed as WGST 139. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics: Playwrights Workshop",
      "classCode": "THTR 168",
      "description": "For course description see THTR 68. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Playwriting",
      "classCode": "THTR 170",
      "description": "In this introductory class we begin by studying the various craft elements of the dramatic form. Balancing this study will be an ongoing exploration of your own idiosyncratic imagination. What grabs your attention? What characters or stories are you compelled to write? We will explore, expand, and explode this dialogue between craft and imagination through a series of generative writing assignments and close reading of a group of contemporary plays. Also listed as ENGL 179W. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Advanced Playwriting",
      "classCode": "THTR 171",
      "description": "In this advanced class we will step, move, and push forward our study of playwriting. We’ll tackle this process through the close reading of a group of contemporary plays and essays; in depth class discussions; weekly writing assignments; sharing of our own writing; and an ongoing investigation of our individual writing practices.  How we are writing will take its place alongside What we are writing. Continuation of THTR 170. Also listed as ENGL 179. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Literature and Performance",
      "classCode": "THTR 172",
      "description": "In this introductory class we will begin by studying the various craft elements of the dramatic form. Then we’ll focus our studies on a group of plays that have been ‘adapted.’ We will tackle this notion of adaptation in a variety of ways: through the close reading of a set of contemporary plays; class discussion; the writing of short scenes; and the writing of short ‘adapted’ plays. Also listed as ENGL163. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Screenwriting",
      "classCode": "THTR 173",
      "description": "Also listed as ENGL 173. For course description see ENGL 173. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Screenwriting",
      "classCode": "THTR 173B",
      "description": "Also listed as COMM 130B. For course description see COMM 130B. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Devised Theater Workshop",
      "classCode": "THTR 175",
      "description": "For course description see THTR 75. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Musical Theatre Production Workshop",
      "classCode": "THTR 180",
      "description": "For course description see THTR 80. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Classical Tragedy",
      "classCode": "THTR 181",
      "description": "Also listed as CLAS 181. For course description see CLAS 181. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Laughter & The Shape of Comedy",
      "classCode": "THTR 181A",
      "description": "Also listed as CLAS 180. For course description see CLAS 180. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Dramaturgy",
      "classCode": "THTR 185",
      "description": "Play analysis, research and audience reception in the context of theatrical genres and historic period cultures. Also listed as ENGL 167. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Stage Directing",
      "classCode": "THTR 186",
      "description": "Fundamental study of the tools, techniques, and theory of directing plays for the live theatre. Prerequisites: THTR 8 or 10 or 185, or COMM 30. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Social Justice and the Arts",
      "classCode": "THTR 189",
      "description": "How do artists engage with the world? What are the questions propelling an artist’s work? What can we learn from an artist’s process? In this Experiential Learning class we will explore these questions through a co-mingling of a variety of activities: reading and classroom discussions, community based learning activities, a critical paper, an investigation paper, and engagement with a wide variety of art and artists. Note: This course requires participation in community-based learning (CBL) experiences off campus. Formerly listed as DANC 189. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "New Playwrights Festival",
      "classCode": "THTR 190",
      "description": "In this workshop course, we will engage with the process of moving a play from the “page to the stage.” Students will engage with a series of generative dramaturgical exercises. Then, working with student actors and directors in a collaborative rehearsal period, students will interact with their play in motion, gaining information for further entry into the work. The class culminates in a festival of staged readings. Prerequisites: THTR 170 or 172, and 171, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Senior Project: Performance",
      "classCode": "THTR 192",
      "description": "Showcases performance in theatre. May be fulfilled through performance in a department production with the required journal, reflection and evaluation of process and project in light of department learning goals. May also be satisfied through a collaboratively produced performance piece following the same guidelines. Prerequisite: Must be registered with a faculty advisor. (2–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Senior Project: Playwriting",
      "classCode": "THTR 193",
      "description": "Project in playwriting. An original one act or full length play. Successful completion includes: workshop of the play in the New Playwrights Festival class, a staged reading of the play during the festival, and written and oral reflection and evaluation of the process and project. Prerequisites: THTR 170 or THTR 172, THTR 171, and approval of Playwriting faculty. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Peer Educator in Theatre",
      "classCode": "THTR 194",
      "description": "Students will assist instructors in theatre classes. Prerequisite: Mandatory training workshop. (1–2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Senior Project: Design/Technical",
      "classCode": "THTR 195",
      "description": "Students serve as designers for sets, costumes, lights, or sound, or as technical directors for a departmental production. Prerequisite: Approval of design faculty. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Senior Project: Directing",
      "classCode": "THTR 196",
      "description": "Project in directing. A short play, fully staged. Prerequisites: THTR 8, 10 or 24, 30, 41A, 42B, 185, 186, and permission of the head of the directing program and stage manager for a one-act play or departmental production. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Senior Thesis",
      "classCode": "THTR 197",
      "description": "A senior thesis in history/literature/dramaturgy. Written for the advisor in consultation with other committee members. Upon completion of the thesis, an oral defense will take place before a selected committee. Prerequisite: Faculty approval. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Practicum",
      "classCode": "THTR 198",
      "description": "Reserved for projects with recognized institutions outside the University. Prerequisite: Written proposal must be approved by instructor and department chair one week prior to registration. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Independent Study/Directed Reading/Directed Research",
      "classCode": "THTR 199",
      "description": "Two areas of directed study: creative projects in directing, choreography, technical production, design, playwriting, administration, or directed reading and/or research. Prerequisite: Written proposal must be approved by the instructor and department chair one week prior to registration. (2–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "The Physics of Dance",
      "classCode": "DANC 4",
      "description": "Explores the connection between the art of dance and the science of motion with both lecture/discussion sessions and movement laboratories. Topics include mass, force, equilibrium, acceleration, energy, momentum, torque, rotation, and angular momentum. Movement laboratory will combine personal experience of movement with scientific measurements and analysis, in other words: “dance it”—“measure it.” This is a lab science course, not a dance technique course. Also listed as PHYS 4. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Rehearsal and Performance",
      "classCode": "DANC 29",
      "description": "Active participation in the preparation and performance of departmental productions as actors, assistants to the director, dancers, and choreographers. Individual design/technical assignments. May be repeated for a total of 8 units. Prerequisite: Approval of director of production. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Dance Cinematography",
      "classCode": "DANC 36",
      "description": "This course is an introduction to dance cinematography. Through a project-based workflow, participants will work from dance source material, from ballet to hip hop, and video techniques to achieve a marriage of the moving body, camera, audio landscape, and visual images. The course will emphasize collaboration in creative research, choreography, and video production. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Hip Hop-Modern/Contemporary Dance Fusion",
      "classCode": "DANC 37",
      "description": "Introductory course that fuses and draws on hip hop street dance style and expressive modern/contemporary dance with no previous training required. The course introduces the body to strong isolated movement and coordination while building flexibility, strength, and alignment. Emphasis on floor work and building dance combinations performed to hip-hop music and contemporary sounds. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Movement for Athletes",
      "classCode": "DANC 38",
      "description": "Focuses on flexibility, agility, body awareness, and strength building. Class exercises will draw from Pilates’ core strengthening mat work, introductory ballet barre, and center work to enhance balance and coordination. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Hip-Hop",
      "classCode": "DANC 39",
      "description": "Introductory course to street dance style performed to hip-hop music. Introduces the body to strong isolated movement, coordination, and dance combinations that will include floor work. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Jazz Dance I",
      "classCode": "DANC 40",
      "description": "Introductory course in jazz dance with no previous training required. Introduces body isolation, rhythmic awareness, movement coordination, and dance styles from social dances of the 30’s to contemporary street jazz dance.  (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Jazz Dance II",
      "classCode": "DANC 41",
      "description": "Continuation of jazz fundamentals introduced in DANC 40 with emphasis on learning and retaining longer combinations through dance progressions and choreography. Styles include authentic jazz to lyrical jazz.(2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Jazz Dance III",
      "classCode": "DANC 42",
      "description": "Continued study of jazz dance at an intermediate level with emphasis on technique, flexibility, balance, control, muscle tone, and retaining longer and challenging combinations in a variety of jazz styles ranging from authentic jazz to commercial dance. Students also work on improvisational skills as well as performance technique through unit presentations.  (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ballet I",
      "classCode": "DANC 43",
      "description": "Introductory course in ballet with no previous experience necessary. Develops individual strength, flexibility, and coordination through classical ballet technique. Includes barre and floor combinations. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ballet II",
      "classCode": "DANC 44",
      "description": "Continuation of ballet fundamentals introduced in DANC 43 with emphasis on discipline, coordination, and developing practical performing skills in classical ballet technique. Includes barre and floor combinations. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ballet III",
      "classCode": "DANC 45",
      "description": "Continued study of ballet at intermediate level, encouraging technical and performing proficiency. Focus on correct alignment and developing artistic expression. Includes barre exercises and intermediate-level floor combinations. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Modern/Contemporary Dance I",
      "classCode": "DANC 46",
      "description": "Introductory course in modern/contemporary dance with no previous training required. Introduces the expressive potential of dance through modern/contemporary dance technique. Emphasis on flexibility, strength, and alignment practiced through standing and floor exercises. Movement improvisation explores qualities of motion. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Modern/Contemporary Dance II",
      "classCode": "DANC 47",
      "description": "Continuation of modern/contemporary dance fundamentals introduced in DANC 46 with emphasis on technique, flexibility, coordination, and creativity. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Modern/Contemporary Dance III",
      "classCode": "DANC 48",
      "description": "Continued study of modern/contemporary dance at an intermediate level. Emphasis on release techniques, rhythmic precision, and spatial principles through extended combinations and movement improvisation. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Dance Composition",
      "classCode": "DANC 49",
      "description": "Traditional approaches to compositional problems of form and design, time and rhythm, and energy flow and force in dance as an art form. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Tap I",
      "classCode": "DANC 50",
      "description": "An introductory level technique class building on basic tap dance vocabulary through drills and choreographic sequences.  (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Beginning Intermediate Tap",
      "classCode": "DANC 51",
      "description": "Continuation of tap fundamentals introduced in DANC 50. Increasing rhythm and coordination through intermediate level steps and technique in Broadway and Rhythm styles. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Afro-Haitian Dance",
      "classCode": "DANC 52",
      "description": "Introductory course in Afro-Haitian dance with no previous training required. Basic technique class that introduces the subtleties of the dance, proper body placement, and the rhythmic structure between the dance and the music. Offered in alternate years. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Mexican Folklorico Dance",
      "classCode": "DANC 54",
      "description": "Introductory course in Mexican folklórico dance with no previous training required. Course introduces steps and moves from various regional forms of dance from Mexico including Azteca, Quebradita, Danzón, and Salsa Mexican style; plus a very structured form of exercise for footwork called “tecnica” drills to enable the dancer to pick up more intricate and challenging material. Offered in alternate years. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Musical Theatre Dance Styles",
      "classCode": "DANC 55",
      "description": "Exploration of contemporary musical theatre dance styles based on American musical theatre. This course will introduce the musical performer to the process of auditioning for shows, through mock auditions. Choreographic styles range from theatre jazz to Broadway tap dance. Offered in alternate years. Prerequisite: DANC 41, or 44, or 47, or permission of instructor. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Pilates Private Instruction",
      "classCode": "DANC 56",
      "description": "Pilates is the latest technology for conditioning the human body. Pilates is excellent for building a deep internal strength and an integrated, aligned body for anyone with an active lifestyle, as well as for injury prevention and recovery. One-on-one Pilates instruction using the reformer and another apparatus. Prerequisite: Permission of instructor. (1 unit)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Dance to Go",
      "classCode": "DANC 57",
      "description": "The development and production of creative dances designed for outreach. Focus on improvisation and sharing the art of dance through interactive performance. Touring production. (2–4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Pilates Mat Class",
      "classCode": "DANC 58",
      "description": "Pilates mat classes, based on the pioneering work of Joseph Pilates, are designed to condition the body. Mat classes focus on alignment and breathing. Strengthens the core of the body while freeing up the joints to aid in flexibility, improving posture, and all around quality of life. Prerequisite: Permission of instructor. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Teaching the Performing Arts",
      "classCode": "DANC 59",
      "description": "Immersion course in artistic process, practices, principles, pedagogies, and public policy. This course covers the fundamentals of teaching dance, theatre, music, and art to children in public and private settings with a focus on marginalized communities, and is important preparation for any student considering teaching at any point in his/her career. Note: This course requires participation in community-based learning (CBL) experiences off campus. Some arts experience, interest in teaching in low-income communities, and instructor permission are required. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Anima CollectiveDevised Performance and tUrn",
      "classCode": "DANC 61",
      "description": "Anima Collective is a student-directedcreative ensemble of dancers, musicians and theatre artists who research, engage with, and respond to contemporary issues (environmental, racial, socio-political, spiritual, etc.) all within the framework of the global climate crisis and its just solutions. Activities include an off-campus artists' retreat, mentoring by visiting artists, scholars, and activists, and the local and international events of tUrn climate action week. Anima Collective produces critical arts-based research, and culminates in a live performance in winter quarter. Prerequisites: one theatre, dance, or music course, or stage/production experience, and permission of instructor. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "African-American Dance History",
      "classCode": "DANC 62",
      "description": "Exploration of African-American dance’s artists’ contribution to U.S. culture from slavery through the present. How minstrel stereotypes, jazz dance sources, black concert dance, and hip-hop reflect racial and social realities in America. Offered in alternate years. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Women in Dance History",
      "classCode": "DANC 66",
      "description": "Introduction to significant European and American women dance artists from the 1830s to the present with a focus on their achievements as dancers, choreographers, critics, and scholars within their social context. Views dance through feminist theoretical perspectives to address issues of power, agency, and personal expression in ballet, modern, jazz, and ethnic dance forms. Offered in alternate years. Also listed as WGST 62. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Dance History",
      "classCode": "DANC 67",
      "description": "Survey of Western concert dance that explores the Italian and French origins of ballet through the 20th-century emergence of modern and jazz dance, and culminates with the new directions of postmodern dance late in that century. Investigates the key contributing artists, significant developments, and overall growth of dance as a performing art integrated into the changing society to which it belongs. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Cultures on the Move: Theatre and Dance as Dialogue of Transition",
      "classCode": "DANC 68",
      "description": "Explores the historical circumstances of migration to the United States by populations and cultures from West Africa and China as well as the Cherokee nation within the United States. Focuses on how performance traditions, especially dance, functioned to process the inevitable conflicts, struggles, and ultimate transformations into blended cultures. Considers the legacy and current vitality of these cultural migrations in the present. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Walk Across California",
      "classCode": "DANC 69",
      "description": "This course will create learning experiences that draw upon interactions with the diverse California human and natural environments by walking across California from San Francisco to Yosemite National Park immediately following spring quarter. Both written and aesthetic reflections through various art forms will enhance students’ understanding of human and environmental sustainability and social injustices in contemporary society. The class will nurture a “sense of wonder” and focus on sustainability, environmental justice, and social activism addressed through scheduled talks with community members including farmers, activists, teachers, park rangers, artists, shop owners, and Native Americans. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Rehearsal and Performance",
      "classCode": "DANC 129",
      "description": "For course description see DANC 29. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Movement for Athletes",
      "classCode": "DANC 138",
      "description": "For course description see DANC 38. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ballet IV",
      "classCode": "DANC 140",
      "description": "Advanced level study of classical ballet with focus on American and European styles. Includes ballet barre exercises, center adagio, and allegro combinations at intermediate/advanced level. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Ballet V",
      "classCode": "DANC 141",
      "description": "Continuation of DANC 140. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "IJazz Dance IV",
      "classCode": "DANC 142",
      "description": "Builds from an assumed intermediate level of jazz dance technique. Emphasis on personal style and performance techniques in advanced jazz dance combinationscovering the span of jazz dance styles. This course prepares the dancer for expectations in the professional industry. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Choreography",
      "classCode": "DANC 143",
      "description": "Emphasis on the creative process, dynamics, phrasing, and thematic development through choreographing and performing an original group dance. Exploration of aesthetic and stylistic approaches to choreography. Prerequisite: DANC 49 or equivalent. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Jazz Dance V",
      "classCode": "DANC 145",
      "description": "Continuation of DANC 142. Emphasis on fluency of the various styles of dance and technique at the  pre-professional level. Designed for the more serious dancer. Students will participate in various mock auditions in preparation for the professional dance industry and will have the opportunity to meet and network with industry professionals. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Modern/Contemporary Dance IV",
      "classCode": "DANC 146",
      "description": "Intermediate/advanced level study of modern/contemporary dance technique. Emphasis on release principles, breath control, phrasing, clarity of line, and movement qualities. Improvisation and extended combinations develop performance commitment. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Modern/Contemporary Dance V",
      "classCode": "DANC 147",
      "description": "Continuation of DANC 146. Emphasis, through improvisation and combinations, on the temporal component of dance: rhythm, tempo, time signatures, and polyrhythms. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics: Dance",
      "classCode": "DANC 148",
      "description": "A rotating offering based on faculty expertise and subject matter deemed best suited to student interest or specialty production demands. Occasionally taught by Guest Instructors or as Master Classes. Topics may include: Movement Improvisation, Somatics, Franklin Method, Tumbling/Lifting/Throwing, World Dance, Dance and Text, Dance and Activism, among other topics. Prerequisites: Two dance classes, any style, with at least one technique course at level III or IV. Or permission of instructor.(2-5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Dance Outreach",
      "classCode": "DANC 149",
      "description": "A performance of original creative student work both on and off campus as a representative of the department. Certain outreach venues will be coordinated with the Arrupe Center. Prerequisite: Permission of instructor. (2–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Musical Theatre Dance Styles",
      "classCode": "DANC 155",
      "description": "For course description see DANC 55. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Pilates Private Instruction",
      "classCode": "DANC 156",
      "description": "For course description see DANC 56. (1 unit)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Dance to Go",
      "classCode": "DANC 157",
      "description": "For course description see DANC 57. (2–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Pilates Mat Class",
      "classCode": "DANC 158",
      "description": "For course description see DANC 58. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Teaching the Performing Arts",
      "classCode": "DANC 159",
      "description": "For course description see DANC 59. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Anima CollectiveDevised Performance and tUrn",
      "classCode": "DANC 161",
      "description": "For course description see DANC 61. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "African-American Dance History",
      "classCode": "DANC 162",
      "description": "For course description see DANC 62. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Women in Dance History",
      "classCode": "DANC 166",
      "description": "For course description see DANC 66. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Walk Across California",
      "classCode": "DANC 169",
      "description": "For course description see DANC 69. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Senior Project: Performance",
      "classCode": "DANC 192",
      "description": "Showcases performance in dance. May be fulfilled through performance in Images, the department production, with the required journal, reflection and evaluation of process and project in light of department learning goals. Prerequisite: Must be supervised by a faculty choreographer. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Senior Project: Dance",
      "classCode": "DANC 193",
      "description": "A recital for theatre arts majors with dance emphasis, showcasing their choreographic and performance abilities. Prerequisites: DANC 49 and 143, and approval of dance faculty; successful completion of stage crew assignments that include stage manager for a senior dance recital or another department production. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Peer Educator in Dance",
      "classCode": "DANC 194",
      "description": "Students will assist instructors in dance classes. Prerequisite: Mandatory training workshop. (1–2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Dance Practicum",
      "classCode": "DANC 198",
      "description": "Reserved for projects/internships with recognized institutions outside of the University. Prerequisite: Written proposal must be approved by the instructor and the department chair one week prior to registration. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Independent Study",
      "classCode": "DANC 199",
      "description": "Various areas of directed study: creative projects inchoreography,teaching assistants, focused participation in a special project, or directed reading and/or research in dance history. Prerequisite: Written proposal must be approved by the instructor and department chair one week prior to registration. (2–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    }
  ]