[
    {
      "courseName": "Contemporary Business Issues",
      "classCode": "BUSN 70",
      "description": "An introduction to the nature, forms, and objectives of the contemporary business firm and its relationship to the modern business environment. Text learning is augmented by classroom discussion, connecting learning points to current events and a comprehensive business simulation. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Foundations of Leadership",
      "classCode": "BUSN 71",
      "description": "Presents an introduction to specific practices of effective leadership through a series of speakers, directed readings, and reflective writing assignments. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Business Leadership Skills",
      "classCode": "BUSN 72",
      "description": "Designed to continue learning from BUSN 71 by focusing on leadership skills specific to a business environment. Course integrates group discussion, selected readings, experiential learning, and reflective engagement experiences. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Business Law",
      "classCode": "BUSN 85",
      "description": "This course provides the student with an overview of the legal system and primary substantive areas of law affecting business transactions including the law of contracts, torts, property, employment, business associations, securities, and white collar crime. Students exercise critical thinking and writing skills through the application of fundamental legal principles in the business context. Prerequisites: BUSN 70 and completion of 45 units, or permission of instructor. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Contemplative Leadership and Sustainability Program (CLASP)",
      "classCode": "BUSN 132",
      "description": "This course is designed to provide students with opportunities to learn and rehearse contemplative leadership practices and explore the relationship between personal values, business, and sustainability. CLASP introduces students to issues of sustainability in industry, provides face-to-face encounters with professionals and companies/organizations already “doing the work” of sustainability, and immerses students in the region’s natural and social environments via daylong weekend excursions. Assignments include keeping a weekly journal, weekly readings, small and large group discussions, writing a short paper, and completing a group project. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Feeding the World",
      "classCode": "BUSN 150",
      "description": "In this course, students examine the global system for the production and distribution of food, assess the ability of the system to satisfy the human demand for food, and evaluate the impact of the system on the natural environment. Students will employ tools from statistics, operations, and economics to describe, analyze, and forecast imbalances between food supply and food demand. Through a term project, students use their new skills to examine the food system in a developing nation experiencing chronic hunger. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "151A. and B. Food, Hunger, Poverty, Environment Immersion",
      "classCode": "BUSN 151A",
      "description": "This course is designed to help students meet their social justice-oriented experiential learning requirements (ELSJ) while learning about issues related to food production and consumption, hunger, poverty, and the environment. The course blends short lectures, guided discussions and reflections, and a 11- to 14 day  immersion in a selected country interacting with local people of diverse backgrounds for experiential active learning. The goal is to increase students’ understanding of the role of business in the developing world and to explore the role of business in alleviating poverty through economic development and the pursuit of social justice. Both quarters are required to participate in the immersion program. (2 units before immersion, 2 units after immersion)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "151A. and B. Food, Hunger, Poverty, Environment Immersion",
      "classCode": "BUSN 151B",
      "description": "This course is designed to help students meet their social justice-oriented experiential learning requirements (ELSJ) while learning about issues related to food production and consumption, hunger, poverty, and the environment. The course blends short lectures, guided discussions and reflections, and a 11- to 14 day  immersion in a selected country interacting with local people of diverse backgrounds for experiential active learning. The goal is to increase students’ understanding of the role of business in the developing world and to explore the role of business in alleviating poverty through economic development and the pursuit of social justice. Both quarters are required to participate in the immersion program. (2 units before immersion, 2 units after immersion)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Contemporary Business for Nonmajors",
      "classCode": "BUSN 170",
      "description": "This course is specifically designed for upper-division (junior and senior), non-business majors who are interested in learning about business firms and their relation to both the global and local environment in which they operate. Course will use a business simulation as a key learning method, in addition to lectures and small group discussion. This course is not open to students who have completed BUSN 70. Prerequisite: Must have completed 87.5 units or more. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Effective Communication in Business",
      "classCode": "BUSN 179",
      "description": "In this pragmatic professional development course, students will learn the following business communication skills: business writing, informal and formal presentations, networking, and personal brand. Students will produce quantitative and qualitative analyses and evaluations and create professional multimedia projects, proposals, and presentations. Students will also develop skills in formal and informal business writing and discourse (briefings, reports, emails, memos, interviews, social media, infographics, etc.). Prerequisites: CTW1 & CTW2. Must have completed at least 60 units.  Also listed as MKTG 179. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Effective Communication in Business",
      "classCode": "BUSN 179S",
      "description": "In this pragmatic professional development course, students will learn the following business communication skills: business writing, informal and formal presentations, networking, and personal brand. Students will produce quantitative and qualitative analyses and evaluations, and create professional multimedia projects, proposals, and presentations. Students will also develop skills in formal and informal business writing and discourse (briefings, reports, emails, memos, interviews, social media, infographics, etc.).Prerequisites: Enrollment restricted to students in the Leavey Scholars Program. CTW1 & CTW2.  Must have completed at least 60 units. Also listed as MKTG 179S. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Global Experience Practicum",
      "classCode": "BUSN 182",
      "description": "Opportunity for business students to study global business issues in specific countries or regions around the world. The practicum includes selected readings, several special lectures on topics related to the target country or region, and an in-country learning session, typically two weeks after the end of spring quarter. Each practicum is led by a Leavey School of Business faculty member who travels with the students to the country to lead integration sessions, guide discussions, and generally enhance the student’s learning experience. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "183A. B. and C.  LSB Community Fellows Seminar",
      "classCode": "BUSN 183A",
      "description": "This seminar is completed in tandem with a community organization internship through the LSB Community Fellows program. Participants study the  context of economic opportunity in the nonprofit/government sector, reflect on internship experiences, and develop professional skills. This course fulfills the ELSJ University Core requirement.Prerequisite: Must be a Leavey School of Business Community Fellow. (1 unit for each course segment)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "183A. B. and C.  LSB Community Fellows Seminar",
      "classCode": "BUSN 183B",
      "description": "This seminar is completed in tandem with a community organization internship through the LSB Community Fellows program. Participants study the  context of economic opportunity in the nonprofit/government sector, reflect on internship experiences, and develop professional skills. This course fulfills the ELSJ University Core requirement.Prerequisite: Must be a Leavey School of Business Community Fellow. (1 unit for each course segment)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "183A. B. and C.  LSB Community Fellows Seminar",
      "classCode": "BUSN 183C",
      "description": "This seminar is completed in tandem with a community organization internship through the LSB Community Fellows program. Participants study the  context of economic opportunity in the nonprofit/government sector, reflect on internship experiences, and develop professional skills. This course fulfills the ELSJ University Core requirement.Prerequisite: Must be a Leavey School of Business Community Fellow. (1 unit for each course segment)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Field Studies: NPI Small Business Improvement Project",
      "classCode": "BUSN 188",
      "description": "In this two-quarter course, students work directly with a small business in a local, economicallydisadvantaged neighborhood. Students conduct an analysis of the business owner’s goals, develop an action plan, and implement the plan to improve business performance. The purpose of the Neighborhood Prosperity Initiative is to provide a unique learning opportunity for undergraduatestudents and to contribute to the economic growth and prosperity of a local neighborhood in a sustainable, ethical, and effective way. This course fulfills the ELSJ University Core requirement. This course requires participation in community-based learning (CBL) experiences off campus. Students must complete two consecutive quarters in winter and spring. (2 units per quarter)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "LSB Peer Advising Practicum",
      "classCode": "BUSN 190",
      "description": "A practicum experience for Leavey School of Business Peer Advisors, which provides the opportunity to learn, apply, and integrate training and experience to provide prescriptive advising for undergraduate business students. Course includes 5 quarterly class meetings plus 1-4 hours per week of direct advising experience. Graded P/NP only. Prerequisite: Must be a Leavey School of Business Peer Advisor. (1 unit)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "195A. and B. The Global Fellow Experience",
      "classCode": "BUSN 195A",
      "description": "This course is designed for students involved in the Global Fellows program. The introductory course introduces students to the macro issues and challenges faced by the underserved populations of the world and provides a context for evaluating the global costs of injustice. Through the framework of business and organizational operations, students develop the tools to evaluate best practices as applied to living a civic life. Students will be exposed to academic research, guest speakers, interactive exercises, and readings in preparation for their summer fellowship, where the course learning will be applied to a work experience. The reflection course segment is designed for students who spent time during the summer as Global Fellows. The primary goal of the course is to allow each student to reflect upon their experience and deepen their lessons learned. The secondary goal is to have the Global Fellows share their experience with the SCU community, thus bringing awareness of global issues to a wider audience. In certain cases, the reflection segment course will fulfill the core requirement for ELSJ. Must be a Global Fellows participant. (2 units for each course segment)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "195A. and B. The Global Fellow Experience",
      "classCode": "BUSN 195B",
      "description": "This course is designed for students involved in the Global Fellows program. The introductory course introduces students to the macro issues and challenges faced by the underserved populations of the world and provides a context for evaluating the global costs of injustice. Through the framework of business and organizational operations, students develop the tools to evaluate best practices as applied to living a civic life. Students will be exposed to academic research, guest speakers, interactive exercises, and readings in preparation for their summer fellowship, where the course learning will be applied to a work experience. The reflection course segment is designed for students who spent time during the summer as Global Fellows. The primary goal of the course is to allow each student to reflect upon their experience and deepen their lessons learned. The secondary goal is to have the Global Fellows share their experience with the SCU community, thus bringing awareness of global issues to a wider audience. In certain cases, the reflection segment course will fulfill the core requirement for ELSJ. Must be a Global Fellows participant. (2 units for each course segment)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Leadership Practicum",
      "classCode": "BUSN 196",
      "description": "Opportunity for business students to obtain advanced experience in leading, facilitating, directing, evaluating, and advising within a Leavey School of Business schoolwide or interdisciplinary project, class, or initiative. This practicum generally includes selected readings, reflective engagement activity, personal leadership assessment, and writing assignments. Requires approval of the assistant dean. (1-5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Internship/Practicum",
      "classCode": "BUSN 198",
      "description": "Opportunity for upper-division students—typically involved with schoolwide or interdisciplinary programs, projects, or initiatives—to work and study in or with for-profit and nonprofit organizations. This practicum generally includes selected readings, a reflective engagement activity, and a written report. Requires approval of the senior assistant dean or associate dean. May be included as fulfilling a requirement for a major only with permission of that department chair. (1-5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    }
  ]