[
    {
      "courseName": "Business Ethics",
      "classCode": "MGMT 6",
      "description": "A normative inquiry into the ethical issues that arise in business and how they should be managed. Attention is given to current moral issues in business and ethical theories or ethical frameworks, and their implications for these issues, and to the managerial implications. Topics may include truth in advertising, corporate social responsibility, stakeholder theory, sustainability, affirmative action, government regulation of business, quality of work-life, environmental and resource issues, and ethical codes of conduct. Students who take PHIL 26 may not take this course for credit. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Business Ethics",
      "classCode": "MGMT 6H",
      "description": "Honors section. A normative inquiry into the ethical issues that arise in business and how they should be managed. Attention is given to current moral issues in business, and ethical theories or ethical frameworks, and their implications for these issues, and to the managerial implications. Topics may include truth in advertising, corporate social responsibility, stakeholder theory, sustainability, affirmative action, government regulation of business, quality of work-life, environmental and resource issues, and ethical codes of conduct. Students who take PHIL 26 may not take this course for credit. Prerequisite:Enrollment restricted to students in the University Honors or Leavey Scholars programs. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Foundational Knowledge of Managing for Sustainability",
      "classCode": "MGMT 40",
      "description": "This course examines the foundational knowledge required of individuals who seek to effectively manage organizations that meet the triple bottom line: social, economic, and environmental sustainability. Students will learn the concepts critical for understanding sustainability from biological, economic, and social perspectives. Students will learn how to justify the pursuit of sustainable business practices, illustrate the role of businesses in building a just and equitable future, and demonstrate how systems thinking helps to illustrate the interdependent nature of our world. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Foundational Skills of Managing for Sustainability",
      "classCode": "MGMT 41",
      "description": "The main focus of this course is to share the core skills found to be necessary for professionals who work to successfully advance sustainability in organizations and communities. Students will learn how to assess an organization’s sustainability practices and make appropriate strategy recommendations. Students will be able to illustrate the role of businesses in building a just and equitable future, as well as articulate how change agents can inspire action at multiple levels to build a more sustainable world. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Leading from the Triple Bottom Line",
      "classCode": "MGMT 42",
      "description": "This course provides an opportunity for students to apply the theoretical skills they have learned in previous classes to a real-world organization, or “client”, and gain valuable business skills they can apply to future internships or full-time roles.  Students will learn foundational principles of sustainable business and explore the  challenges of leadership to advance social and environmental objectives within the context of an actual business or organization. The course counts toward credit in the Design Thinking, Paradigm Shift and Sustainability pathways.  (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Professional Development Skills and Strategies Seminar",
      "classCode": "MGMT 50",
      "description": "This one-unit seminar is an introduction to the foundational professional development skills necessary to plan and implement internship and career search strategies. By the end of the seminar students will create a career action plan for launching an internship search and building their lifelong network. Prerequisite: Must be a Leavey School of Business major and sophomore standing.  (1 unit)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Global and Cultural Environment of Business",
      "classCode": "MGMT 80",
      "description": "An examination of the basic conceptual vocabulary and theories regarding the economic, political, and social influences on international business today. Topics may include international trade, financial systems, political institutions, cultural factors, corporate structure, and market entry. Students who take this class may not receive credit for MGMT 80L taken in the Santa Clara London Program, or any equivalent course taken in a study abroad program. Prerequisites: BUSN 70 or 170, and ECON 3. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Global Microfinance for Entrepreneurial Development",
      "classCode": "MGMT 110",
      "description": "This course introduces students to the theories, practices, and issues of microfinance — a social enterprise movement that serves entrepreneurs who lack access to traditional banking services. Grounded and enhanced by systems thinking and design thinking, students will understand structural constraints, trade-offs, and paradoxes in problem-solving the current challenges facing microfinance operations. In engaging with stakeholders in microfinance, students will employ global business and management skills to empower the world’s unbanked entrepreneurs. Prerequisite: MGMT 80 and ACTG 11. This course also satisfies the ELSJ requirement. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Management of Organizations",
      "classCode": "MGMT 160",
      "description": "Introduction to organization theory and practice with an emphasis on organizational behavior, inclusive of the contexts of the individual, the group, and the organization as a whole. Prerequisite: Students must have completed 60 units. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Management of Organizations",
      "classCode": "MGMT 160S",
      "description": "Introduction to organization theory and practice with an emphasis on organizational behavior, inclusive of the contexts of the individual, the group, and the organization as a whole. Prerequisites: Open only to students in the Leavey Scholars Program. Students must have completed 60 units. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Strategic Analysis—The Business Capstone",
      "classCode": "MGMT 162",
      "description": "Focuses on the processes by which managers position their businesses or assets to maximize long-term value creation and value capture in the face of uncertainty, rapid change, and competition. Covers various frameworks for analyzing an industry’s structure and a firm’s competitive position, and for developing a coherent and viable firm strategy. Requires students to integrate and extend the knowledge and skills that they have developed throughout their coursework (e.g., marketing, finance, economics, organizational behavior, ethics, information systems, statistical analysis, operations management, accounting, etc.) into a “total” business perspective. Prerequisites: ECON 41 and 42 or OMIS 41; FNCE 121 or 121S; MGMT 80, 160, or 160S; MKTG 181 or 181S; and senior standing. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Strategic Analysis—The Business Capstone",
      "classCode": "MGMT 162S",
      "description": "Focuses on the processes by which managers position their businesses or assets to maximize long-term value creation and value captures in the face of uncertainty, rapid change, and competition. Covers various frameworks for analyzing an industry’s structure and a firm’s competitive position and for developing a coherent and viablee firm strategy. Requires students to integrate and extend the knowledge and skills that they have developed throughout their coursework (e.g., marketing, finance, economics, organizational behavior, ethics, information systems, statistical analysis, operations management, accounting, etc.) into a “total” business perspective. Enrollment restricted to students in the Leavey Scholars Program. Prerequisites: ECON 41 and 42 or OMIS 41; FNCE 121 or 121S; MGMT 80, 160, or 160S; MKTG 181 or 181S; senior standing; and a minimum 3.5 cumulative GPA. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Entrepreneurship",
      "classCode": "MGMT 164",
      "description": "The course looks at the practice of business innovation and entrepreneurship with an emphasis on how entrepreneurs identify opportunities, evaluate resources, build organizations, and understand the phenomena of entrepreneurship.  MGMT 164 is an introductory course intended to provide a foundation regarding the role of entrepreneurship, discussing ideas about entrepreneurship, and entrepreneurs in society and the economy.Prerequisites: ACTG 11 and MKTG 181. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Building a Business",
      "classCode": "MGMT 165",
      "description": "This course integrates many of the concepts, tools and practices of entrepreneurship.  This course is a systematic and practical study of business creation and evaluation for new ventures and entrepreneurial projects.  Students will learn to assess and shape venture ideas, convert these ideas into viable businesses, and present these businesses to external stakeholders.  Topics include new venture execution plans, alternatives and trade-offs in financing, feasibility, resource acquisition, venture growth and harvesting.  The course includes discussion of cases, lectures, and presentations by guest lecturers who have played a role in starting new enterprises.  The course builds on foundation concepts from the Introductory Entrepreneurship course. It is designed for students seriously considering launching a new venture in a variety of contexts, and for students planning to work in an early stage venture. Prerequisite: MGMT 164. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Human Resource Management",
      "classCode": "MGMT 166",
      "description": "Comprehensive review of the role and functions of human resource management departments in business organizations, with particular emphasis on selection and placement, training and development, and compensation systems. Prerequisite: MGMT 160 or 160S, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Venture Capitalist Essentials",
      "classCode": "MGMT 167",
      "description": "This course provides insight into the thought processes of Venture Capitalists. It will cover all aspects of deal flow including sourcing opportunities, performing due diligence, determining valuation and constructing term sheets. While inspired as a way to prepare students for the Venture Capital Investment Competition (held in the Winter quarter), it offers an introduction to the VC world for students interested in becoming investors as well as those hoping to obtain VC funds as entrepreneurs. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Entrepreneurship and the Public Sector: Challenges and Opportunities",
      "classCode": "MGMT 168",
      "description": "Cities and local governments face many challenges as cities continue to grow and expand. This can be both a hub for innovation and catalyst for economic growth if entrepreneurs can understand how to build and sell solutions to these problems to governments. This course will help students to attain a fuller understanding of conducting business within various types of governments. Student(s) will interview city leaders, attend meetings, and conduct research to be able to identify traits of successful business leaders who engage in business with a variety of different governments. This class will uncover how city officials prioritize and evaluate projects and will gauge the economical effects of those decisions. This course looks at innovation and social entrepreneurship within the public sector. In addition, students have an opportunity to learn how to do business as an entrepreneur with a local government and learn what resources are available to entrepreneurs through those local governments. Not only will students learn how to become a successful entrepreneur selling a product or idea to a local government, but they will learn how to be change agents of innovation within public sector organizations. Prerequisite: MGMT 160 or 160S and MGMT 164. (5 units).",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Business and Public Policy",
      "classCode": "MGMT 169",
      "description": "The impact of public policy on business and how businesses adapt to and influence public policies. Includes ideology, corporate social responsibility, government regulations, and business political activity. Lectures/discussions; case analyses. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "International Management",
      "classCode": "MGMT 170",
      "description": "Today’s business managers are challenged to set strategy, develop organizations, lead people, and control performance in a local context. They also need to understand and lead within a complex global context.  This course is designed to help students: 1) develop an understanding of multinational management; 2) recognize the challenges and opportunities presented by global markets; 3) implement a global strategy by means of organizational design, human resources management and leadership development. Prerequisite: MGMT 80. MGMT 160 or 160S recommended. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Managerial Communication",
      "classCode": "MGMT 171",
      "description": "Interpersonal and small-group communication. Negotiating behavior. Oral and written communication. Integrates theory and skill-building through reading, case analysis, and practice. Prerequisite: MGMT 160 or 160S, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Social Entrepreneurship",
      "classCode": "MGMT 172",
      "description": "This course focuses on emerging models of enterprise at the interface of the public, private, and nonprofit sectors. It examines theories of change and the dynamics of social innovation and develops both conceptual and practical tools for creating high performance organizations that are capable of addressing seemingly intractable problems in a financially sustainable manner. Analysis of exemplary social business ventures will illustrate how the discipline of business planning can contribute to the development of social ventures that are economically viable at scale. Students will apply this knowledge to the writing and analysis of a case on—and/or service learning for—an actual social business. Prerequisite: students must have completed 87.5 units or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Resources, Food, and the Environment",
      "classCode": "MGMT 173",
      "description": "Exploration of relationships among food production, resource use, and the environment. Topics include food innovation, biotechnology, the green revolution, resource depletion, environmental degradation, and food safety. Also listed as ECON 101. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Social Psychology of Leadership",
      "classCode": "MGMT 174",
      "description": "A conceptual framework for understanding leadership and opportunities for developing leadership skills. This interactive course requires personal reflection into leadership experiences. Prerequisite: students must have completed 87.5 units or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Flourishing at Work",
      "classCode": "MGMT 175",
      "description": "We spend a large portion of our waking lives at work. It follows that what goes on in the workplace has the potential to significantly impact our ability to flourish – to be in an optimal state of mental and social well-being. Throughout this interactive course, we will explore a variety of Positive Organizational Scholarship topics from the fields of Organizational Behavior and Psychology that contribute to flourishing individuals, relationships, and systems. The first half of the course focuses on how to promote flourishing at the individual level, including topics such as mindsets, values, identity, authenticity, and meaning at work. The second half of the course will focus on how to promote flourishing interpersonal relationships and systems, including topics such as creating high-quality connections, psychological safety in teams, positive interpersonal emotions, networks, culture, and change. Prerequisite: MGMT 160 or 160S. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Sustainable Food Systems",
      "classCode": "MGMT 176",
      "description": "In this course, you will study the existing food system, issues of food access, justice and sovereignty as well as opportunities to use technology and innovation to create a more just and sustainable food system. We will examine how food policy and lobbying affect food production and consumption and the role of food policy in food insecurity, health risks tied to food, and climate change. The first third of the class focuses on agricultural production, food policy, and issues of access and affordability. The second third analyzes the role of food production in climate change, supply chains and opportunities for creating more sustainable, traceable and transparent supply chains. In the final third of the course, we will discuss opportunities for disruptive innovation in the agricultural technology and food technology fields as an agent of change. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Globalization and the Cultures of Innovation and Entrepreneurship",
      "classCode": "MGMT 177",
      "description": "This course introduces students to the skills, practices and processes for understanding and managing innovation and entrepreneurship activities that span cultures throughout the world. These culture challenges include development of an entrepreneurial mindset and adoption of new organizational forms (e.g., open innovation, crowdsourcing).  (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Business and Human Rights",
      "classCode": "MGMT 178",
      "description": "More and more companies are adopting human rights policies, conducting human rights due diligence, reporting on their human rights performance, and employing teams of human rights experts. Through interactive exercises, debates, case studies, and role- play, this course will provide you with the knowledge, skills and tools to identify and address a company’ s human rights risks and to leverage the power of business to advance human rights around the world. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Risk Management",
      "classCode": "MGMT 179",
      "description": "A comprehensive examination of corporate risk, including history, current practices, and the impact of risk appetites on culture (and vice versa). Coverage of risk classification, organizational risk structures, and enterprise risk management.  Students will engage in identification, prioritization, mitigation, and reporting of risks, via a hypothetical company with analysis of actual risks impacting our global corporate landscape. Students will gain familiarity with heat maps and other planning tools, as well as engage in drafting business continuity and disaster recovery plans. Overview of professional risk roles and responsibilities, as well as skills required to obtain these compelling jobs. Focus on understanding of risk management roles and honing relevant skills. Prerequisite: MGMT 80, MGMT 6 and ECON 3 (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Negotiation Skills in Business",
      "classCode": "MGMT 180",
      "description": "We negotiate every day, both at work and in our personal lives. The overall goal of this course is to create a learning community where we can all improve our understanding of both the art and the science of negotiation. By learning about the research-based theories of negotiation, students will gain analytic skills in understanding negotiation principles. In preparing for the role plays assigned, students will practice selecting appropriate negotiation strategies for different contexts. By practicing negotiation in a number of different behavioral simulations, and reflecting critically on simulation outcomes, students will gain practical skills in influencing others to secure productive agreements through negotiation. Prerequisite: MGMT 160 or 160S, may be taken concurrently with instructor permission. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Conscientious Capitalism",
      "classCode": "MGMT 181",
      "description": "The foundation of Conscientious Capitalism is: “To lead others, I will first learn to lead myself.” The course is designed to inspire and teach students the role of purpose, virtue, intentionality, tenacity, and accountability in their leadership journey. The course uses three distinct but related activities to achieve this goal. Nationally renowned business, military, and civic leaders share the experiences and challenges that shaped them, their careers, and major decisions. The goal of having iconic leaders share with honesty and vulnerability is to inspire students to do the same in the course and their lives. Harvard Business School cases give students the opportunity to learn from the most critical business and policy decisions of our times. Putting students in the role of decision-maker challenges them to understand the complexity of decision making and leadership, and begins to train them for their careers post SCU. Leadership Development Teams (LDTs) are small, mentored groups. The goal is for students to explore and share their authentic selves and develop the courage to live as their authentic selves in their careers and lives. Note: We seek evidence of a student’s ambition to make an impact and the hunger and maturity to pursue the journey of self-awareness, authenticity, and courageous action. Enrollment based upon permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Peer Educator in Management",
      "classCode": "MGMT 191",
      "description": "Work closely with the department to help students in core management classes to understand course material, think more deeply about the material, and feel less anxious about testing situations. Prerequisites: Declared management major and permission of instructor and chair required prior to enrollment. (1 or 2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in Management",
      "classCode": "MGMT 197",
      "description": "Offered occasionally to introduce new topics not covered by existing electives. Topics generally reflect the research interests of the faculty teaching the course. Prerequisite: MGMT 160 or 160S, and MGMT 174 and a written proposal must be approved by instructor and chair one week prior to registration. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Internship/Practicum",
      "classCode": "MGMT 198",
      "description": "Opportunity for students to apply managerial knowledge and skills as well as leadership skills through their internship in local organizations. Prerequisites: MGMT 160 or 160S and MGMT 174 (can be taken concurrently) and two courses from the following list: MGMT 166, MGMT 169, 170, 171, 172, 173, 176, 177, 178, 180. Students must have completed 60 units and have the approval of the undergraduate committee one week prior to registration. MGMT 198 is for the Management Major. Students cannot take both MGMT 198 and MGMT 198E. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Entrepreneurship Internship",
      "classCode": "MGMT 198E",
      "description": "This course brings together your academic studies with real-world start-up experience. As such, the class has two segments: An on-site internship, along with an academic segment. The internship must be at least 10 hours per week, (80 hours for the quarter, starting by the first week of class). During the internship, you will help a Silicon Valley entrepreneurial organization (start-up) develop and build a new venture. Here, you will observe a new venture during its formative years. The academic component entails the application of your business studies to a genuine new firm setting. You will examine and analyze your internship experiences with your academic learning. The ultimate product of this class is an in-depth case study of the firm and its founders.Prerequisites: MGMT 164 and must have a declared entrepreneurship minor. MGMT 165 may be taken concurrently. Students cannot take both MGMT 198 and MGMT 198E. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Reading/Directed Research",
      "classCode": "MGMT 199",
      "description": "Independent projects undertaken by upper-division students with a faculty sponsor. Prerequisites: MGMT 160 or 160S, and MGMT 174 and a written proposal must be approved by instructor and chair one week prior to registration. (1-5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    }
  ]