[
    {
      "courseName": "Customer-Centric Retailing",
      "classCode": "MKTG 165",
      "description": "The design and management of store, catalog, and Internet-based retail channels. Topics include how retailers create value for the producer and the end user, the financial and marketing strategies that underlie retailing formats, target marketing decisions, merchandise management, how retail price promotions work, managing customer service, and the execution of retail marketing decisions. Mini cases, video cases, an applied project, and guest speakers from industry will be utilized to provide practical illustration of various concepts and stimulate class discussion. Prerequisites: ACTG 11 and MKTG 181 or 181S. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "168. and 169. Advanced Retail Seminars",
      "classCode": "MKTG 168",
      "description": "In-depth examination of a number of topics critical to future executive roles in a retailing environment. Topics include consumer trends, multichannel retail models, analysis of high-performance retailers, building information-centric organizations, category management, arts and science in merchandising decisions, data-driven sales promotion, and supply chain management. Prerequisites: MKTG 165, 181, or 181S, and declared retail studies minor. MKTG 168 must be taken prior to 169. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "168. and 169. Advanced Retail Seminars",
      "classCode": "MKTG 169",
      "description": "In-depth examination of a number of topics critical to future executive roles in a retailing environment. Topics include consumer trends, multichannel retail models, analysis of high-performance retailers, building information-centric organizations, category management, arts and science in merchandising decisions, data-driven sales promotion, and supply chain management. Prerequisites: MKTG 165, 181, or 181S, and declared retail studies minor. MKTG 168 must be taken prior to 169. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Internet Marketing and E-commerce",
      "classCode": "MKTG 175",
      "description": "This course introduces the fundamentals of internet marketing and e-commerce and provides students with hands-on experience in developing and evaluating effective digital strategies. Topics include: history of internet marketing and e-commerce, key elements of e-business models, and how to build and evaluate websites, display ads, search engine marketing, email marketing, mobile marketing, and social media marketing. Project required. Prerequisite: MKTG 181 or 181S. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Social Media Marketing",
      "classCode": "MKTG 177",
      "description": "This experiential course examines the role of social media in business and brand strategy, digital advertising, and overall marketing mix. The class introduces students to the current social media landscape, explores the strategic implications of social media as part of the overall marketing mix, explores the role of social media in message development and implementation, and evaluates which social platforms are the best fit for an organization’s strategic business and marketing goals. Topics include social media objectives and strategies, an overview of platforms, current social media trends and their implications, developing social media as an integral part of the marketing mix. Prerequisites: MKTG 181 or 181S. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Marketing Across Cultures",
      "classCode": "MKTG 178",
      "description": "Success in global markets requires developing marketing programs that are sensitive to cultural differences. This course emphasizes the cultural factors that drive consumption behavior in international markets. A socio-cultural perspective is applied to traditional marketing concepts to develop programs to successfully address international markets. Mechanisms for participating in foreign markets such as exports, licensing, and joint ventures are evaluated. Ethical marketing issues in international contexts are explored. Students who take this class may not receive credit for MKTG 178L taken in the Santa Clara London Program, or any equivalent course taken in a study abroad program. Prerequisites: MKTG 181 or 181S and MGMT 80. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Effective Communication in Business",
      "classCode": "MKTG 179",
      "description": "In this pragmatic professional development course, students will learn the following business communication skills: business writing, informal and formal presentations, networking, and personal brand. Students will produce quantitative and qualitative analyses and evaluations and create professional multimedia projects, proposals, and presentations. Students will also develop skills in formal and informal business writing and discourse (briefings, reports, emails, memos, interviews, social media, infographics, etc.). Prerequisites: CTW1 & CTW2. Must have completed at least 60 units.  Also listed as BUSN 179. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Effective Communication in Business",
      "classCode": "MKTG 179S",
      "description": "In this pragmatic professional development course, students will learn the following business communication skills: business writing, informal and formal presentations, networking, and personal brand. Students will produce quantitative and qualitative analyses and evaluations and create professional multimedia projects, proposals, and presentations. Students will also develop skills in formal and informal business writing and discourse (briefings, reports, emails, memos, interviews, social media, infographics, etc.).Prerequisites: Enrollment restricted to students in the Leavey Scholars Program. CTW1 & CTW2.  Must have completed at least 60 units. Also listed as BUSN 179S. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Principles of Marketing",
      "classCode": "MKTG 181",
      "description": "Introduction to the fundamental principles of contemporary marketing. Covers the role of marketing in driving business and organizational success , marketing strategy and planning, segmentation, targeting, positioning, product policy, pricing decisions, promotion, and distribution. The course stresses topical examples. Emphasizes application of basic principles, information sourcing, analytical thinking, and communication skills. Prerequisite: Must have 60 units or greater, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Principles of Marketing",
      "classCode": "MKTG 181S",
      "description": "Introduction to the fundamental principles of contemporary marketing. Covers the role of marketing in society, marketing strategy and planning, segmentation, product policy, pricing decisions, promotion, and distribution. Stresses topical examples. Emphasizes application of basic principles, information sourcing, analytical thinking, and communication skills. Prerequisite: Enrollment restricted to students in the Leavey Scholars Program. Must have 60 units or greater, or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Analysis for Marketing Decisions",
      "classCode": "MKTG 182",
      "description": "An analytical approach toward understanding consumers and markets to support profitable marketing decisions in such areas as market segmentation, new product development, positioning, and promotions. The focus is on frameworks for structuring marketing problems, and techniques for using data to improve marketing decisions. Cases and projects are emphasized. Prerequisites: OMIS 41 or ECON 42 and MKTG 181 or 181S. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Customer Behavior",
      "classCode": "MKTG 183",
      "description": "How consumers process information and make buying decisions. Investigation of influence factors, such as attitudes, personality, culture, motivation, perception, and reference groups on consumer decision making. Decision-making processes of industrial buyers in business-to-business markets are also studied and compared to those of individuals in consumer markets. Particular emphasis on understanding the decision-making process (both consumer and industrial) and its application to the development of sound marketing strategy. An applied project, videos, and mini-cases are used to illustrate the practical application of various concepts. Prerequisites: OMIS 41 or ECON 42 and MKTG 181 or 181S or permission of instructor. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Sales Management",
      "classCode": "MKTG 185",
      "description": "This course puts the student in the role of being a prospective sales or marketing manager. The objective is to provide students with user-level knowledge of sales concepts and management methodologies necessary to effectively perform and manage the sales function. The format of the course enables the student to apply these concepts to selling both consumer high-tech and industrial products and services. Project required. Prerequisite: MKTG 181 or 181S. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Integrated Marketing Communications",
      "classCode": "MKTG 186",
      "description": "Integration of the marketing mix, brand message, and media is essential to successfully meeting corporate objectives. The course arms students with an understanding of new media plus the skills to plan, develop, execute, coordinate, and measure integrated marketing communications (IMC) programs. Personal attributes, demeanor, and business ethics are addressed in preparation for moving from the classroom to the boardroom. Interaction with business practitioners, industry-experienced instruction, and a service/learning project for an actual company are integral to the course. Prerequisite: MKTG 181 or 181S. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Innovation and New Product Marketing",
      "classCode": "MKTG 187",
      "description": "Focuses on both quantitative and qualitative techniques associated with identifying, researching, and analyzing new product opportunities. Exposes students to important tools for designing, testing, and introducing profitable new products and services. Prerequisite: MKTG 181 or 181S. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Entertainment Marketing",
      "classCode": "MKTG 188",
      "description": "The course explores marketing strategies that shape the development, distribution, and consumption of interactive entertainment. Emphasis is on feature online games but class materials also include emerging platforms, music, fashion, and other creative industries. Key areas include advertising, licensing, sponsorships, publishing, syndication, and promotion that apply across the entertainment industry. Prerequisite: MKTG 181 or 181S. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Sustainability Marketing",
      "classCode": "MKTG 189",
      "description": "The course is designed to explore the relationship between sustainability and marketing, especially for students interested in business and society and the environmental concerns that affect marketing managers. Key areas include understanding the economic foundation of sustainability marketing and its place in contemporary society, sustainability marketing standards and strategies, and global and ethical considerations. Prerequisite: MKTG 181 or 181S. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Brand and Content Marketing",
      "classCode": "MKTG 190",
      "description": "Brand & Content Marketing examines the components of brand and brand strategy and how they inform content marketing principles, strategies, function, form and style of an integrated physical and online portfolio of paid, owned, shared and earned (POSE) media. The course will examine the written, verbal and visual frameworks, formats and styles required to execute an integrated message strategy across multiple media platforms. Students will demonstrate their comprehension by completing a number of tactical executions against real-life project and marketing objectives. Prerequisite: MKTG 181 or 181S. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Customer Experience Management",
      "classCode": "MKTG 191",
      "description": "This course provides strategic, operational, and analytical aspects of customer experience management. Customer experience management is a core marketing strategy that integrates internal processes and external networks to create and deliver exceptional value to customers. The course covers customer acquisition, journey, retention and development, loyalty, and the associated tools and technology that create superior customer experiences. Prerequisite: MKTG 181 or 181S. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Special Topics in Marketing",
      "classCode": "MKTG 197",
      "description": "Occasional current and interdisciplinary courses offered on a one-time or infrequent basis or cross-listed with offerings in other departments. Consult the quarterly schedule of classes for description. Prerequisites: MKTG 181 or 181S and declared marketing major. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Internship",
      "classCode": "MKTG 198",
      "description": "Opportunity for upper-division students to work in local firms and complete a supervised academic project in that setting. Prerequisites: Declared marketing major, MKTG 181 or 181S, 182, and permission of faculty coordinator. (1–3 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Reading/Directed Research",
      "classCode": "MKTG 199",
      "description": "Independent projects undertaken by upper-division students with a faculty sponsor. Independent studies are normally permitted only under special circumstances. Prerequisite: Written proposal must be approved by instructor and chair at least two weeks prior to registration. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    }
  ]