[
    {
      "courseName": "Introduction to Spreadsheets",
      "classCode": "OMIS 15",
      "description": "Using spreadsheets to analyze business data and present the findings in tables, charts, and graphs. Topics covered will include spreadsheet formulas, functions, pivot tables, and pivot charts. Students will also learn how to retrieve data from sources such as text files, relational databases, and servers. Students may not take both OMIS 15 and 17 for credit. Students must have less than 87.5 units completed. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Introduction to Programming with Python",
      "classCode": "OMIS 30",
      "description": "Fundamental methodologies and approaches to computer programming, with emphasis on problem solving, top-down program design, and thinking like a programmer. Students will learn basic structures of computer programming; analyze real business problems from a computer programmer perspective; and program, test, and debug well-structured programs. Focuses on essential aspects of writing software that include good design, modularity, efficiency, documentation, clarity, portability, and style. Students will obtain hands-on programming skills through several programming assignments. This course is the basis for business application development in database design and systems programming courses. Students who receive credit for CSCI 10 (formerly MATH 10), COEN 6, COEN 11, or OMIS 31 may not take this course for credit. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Science, Information Technology, Business, and Society",
      "classCode": "OMIS 34",
      "description": "Examines the complex relationship among science, information technology, business, and society. Investigates major breakthroughs in information technology, how they were influenced by business needs, and how they affect business and society. Explores social and cultural values in business science and technology, and economic challenges posed by rapid business information technology. Also examines the workings of major components of information technology used in business today. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Statistics and Data Analysis I",
      "classCode": "OMIS 40",
      "description": "First course in a two-course sequence. Students learn to summarize and describe sets of data using numerical and graphical methods; to quantitatively express the probability of events and utilize probability rules; to employ probability distributions to describe the probabilities associated with discrete and continuous random variables, and to compute means and variances; to evaluate sample data collection plans for quantitative and qualitative data; and to construct interval estimates for the population mean. Students analyze real-world data using spreadsheet software. Prerequisites: MATH 11 or 30, and OMIS 15 or 17. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Statistics and Data Analysis II",
      "classCode": "OMIS 41",
      "description": "Second course in a two-course sequence. Students learn to construct confidence intervals and test hypotheses about means, proportions, and variances for one and two populations; to formulate and test hypotheses about multinomial data; to construct both simple and multiple regression models, evaluate model quality and predict the value of dependent variables using regression. Students analyze real-world data using spreadsheet software. Prerequisites: OMIS 15 or 17, and OMIS 40. (4 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Data Wrangling and Visualization",
      "classCode": "OMIS 43",
      "description": "Cross-listed with ECON 43. Prerequisites: OMIS 40. (2 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Database Management Systems",
      "classCode": "OMIS 105",
      "description": "This course presents issues related to databases and database management systems (DBMS). Students will acquire technical and managerial skills in planning, analysis, design, implementation, and maintenance of databases. Hands-on training in relational database design, normalization, SQL, and database implementation will be provided. Use of DBMS software is required. Emphasis is placed on the issues of managing a database environment. Prerequisite: OMIS 30. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Systems Analysis and Design",
      "classCode": "OMIS 106",
      "description": "This course presents methodologies and approaches to the analysis and design of computer-based information systems for business applications. Topics include the systems development lifecycle, development methodologies, requirements determination, use case analysis, process modeling, systems architecture, program, and interface design, systems implementation, and organizational transition. Application of the studied methodologies and techniques to a systems analysis and design project is required. Prerequisite: OMIS 30. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Systems Programming",
      "classCode": "OMIS 107",
      "description": "Discussion of the fundamental concepts of systems programming. Major focus on the overall structure and capabilities of modern operating systems (LINUX/UNIX, Windows, etc.) and how to use operating system facilities to manipulate files and processes. Also covers shells and scripting programming concepts for performing system-level programming assignments on dedicated computer systems. Development of several software assignments utilizing systems programming concepts is required. Prerequisite: OMIS 30. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Operations Management",
      "classCode": "OMIS 108",
      "description": "Survey of analysis and design methods for business systems that produce and deliver goods and services. Topics chosen from the following: process analysis, sales forecasting, production planning and scheduling, inventory management, material requirements planning, quality control, lean manufacturing, and supply chain management. Prerequisite: OMIS 41 or ECON 41 and 42. This section is equivalent to OMIS 108E.(5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Sustainable Operations Management",
      "classCode": "OMIS 108E",
      "description": "This version of OMIS 108 emphasizes applications to sustainable business practices. Prerequisite: OMIS 41 or ECON 41 and 42. This section is equivalent to OMIS 108. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Operations Management",
      "classCode": "OMIS 108S",
      "description": "Enrollment in this version of OMIS 108 is restricted to students in the Leavey Scholars Program. Prerequisite: OMIS 41 or ECON 41 and 42. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Prescriptive Analytics",
      "classCode": "OMIS 109",
      "description": "Mathematical methods for solving decision problems encountered in business situations. Emphasis on problem formulation and application of spreadsheet-based algorithms for solution. Linear models and linear programming. Sensitivity analysis. Network models. Integer and nonlinear programming. Decision analysis and value of information. Dynamic analysis and the principle of optimality. Prerequisite: OMIS 41 or ECON 41 and 42. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Computer Communications Systems",
      "classCode": "OMIS 111",
      "description": "Designed to provide the information systems professional with a basic literacy in communication technologies driving the digital economy. Basics of data and telecommunications, LANs, WANs, broadband, analog and digital communications, Internet architecture and concepts, wireless including cellular and WLANs, and market and regulatory issues are covered. Emphasis on being able to assess the business impact of networking technologies. Prerequisite: OMIS 30 or 34. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Data Warehousing and Business Intelligence",
      "classCode": "OMIS 113",
      "description": "This course examines a broad collection of software tools and analytical applications that allow enterprises to analyze data maintained in data warehouses and operational databases for business intelligence. Topics include data storage and data integration architecture, enterprise analytics, and business intelligence tools and presentations. Students will acquire hands-on experience in building business intelligence applications. Prerequisites: OMIS 30 and 105. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Data Science with Python",
      "classCode": "OMIS 114",
      "description": "The objective of this course is to teach the analytical mindset and programming skills relevant to data science. Students will learn the principal tools for data science in Python, including the Jupyter (IPython) Notebook, Pandas, Seaborn, and Scikit-learn. Students will learn skills that cover the various phases of exploratory data analysis: importing data, cleaning and transforming data, algorithmic thinking, grouping and aggregation, visualization, time series, statistical modeling/prediction and communication of results. The course will utilize data from a wide range of sources and will culminate with a final project and presentation. Prerequisite: OMIS 30. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Predictive Analytics",
      "classCode": "OMIS 115",
      "description": "This course aims to teach conceptual foundations of predictive analytics and practical data analytics skills in order to perform out-of-sample predictions on real-world data. The course (1) introduces multiple data structures (e.g., time series, cross-sectional) that are frequently used in several different business contexts, (2) demonstrates predictive model construction techniques on different data structures, and (3) focuses on improving out-of-sample predictive performance. Topics include time series analysis and forecasting, regression models, classification and prediction models, text mining and analytics, and social network analysis. Prerequisite: OMIS 114. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Applied Machine Learning",
      "classCode": "OMIS 116",
      "description": "This course examines applications of machine learning using Apache Spark and Python. Topics include supervised and unsupervised machine learning algorithms such as regression, decision trees, support vector machines, clustering, and dimensionality reduction. Students will develop and run Spark jobs using Python and have hands-on experience on cases such as developing predictive models, generating recommendations with Collaborative Filtering, analyzing unstructured data with text mining, etc. Prerequisite: OMIS 30 and 114. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Software Development Project",
      "classCode": "OMIS 117",
      "description": "Integration of system and programming concepts to develop a comprehensive software system. Also presents an overview of software development methodology. Prerequisite: OMIS 30. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Social Media Analytics",
      "classCode": "OMIS 118",
      "description": "User generated content on social media platforms has increased dramatically. This includes rich data about various user communities, their interests, interactions and requirements. To understand, analyze and extract knowledge from social media data, this course employs a multidisciplinary approach that combines graph analysis, natural language processing, and machine learning. This approach is applied on real world data of social media platforms like Twitter, Facebook and Yelp for different applications such as sentiment analysis, topic modeling and user interaction mining. Students will have hands-on experience by developing all applications in Python throughout the course. Prerequisite: OMIS 114 and 116. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Web Programming",
      "classCode": "OMIS 120",
      "description": "The course will focus on the design and development of Web-based applications using a number of currently popular tools and strategies, and also explore the use of databases as data repositories for Web applications. Core technologies including HTML, CSS,JavaScript, PHP, MySQL, and AJAX will be emphasized. Prerequisites: OMIS 30 and 105. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Enterprise Resource Planning Systems",
      "classCode": "OMIS 135",
      "description": "Enterprise Resource Planning (ERP) systems are the foundation of modern business processes. Study of business process integration, ERP technology, and ERP implementation. Students will have the opportunity to work with ERP software from SAP. Includes a team project and case studies. Prerequisite: OMIS 105 or COEN 178. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Object-Oriented Programming",
      "classCode": "OMIS 137",
      "description": "Introduction to object-oriented design methodology. Discussion of different programming paradigms, concepts of data abstraction, inheritance, and encapsulation. Topics include an overview of Java programming language, classes and objects, data abstraction, inheritance, I/O packages, exceptions, threads, and GUI. Development of several programming assignments using Java is required. Prerequisite: OMIS 30. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Competitive Quality",
      "classCode": "OMIS 145",
      "description": "Slogans like “Quality is Job 1”; “When it absolutely, positively has to be there overnight”; and “The Dependability People” leave little doubt as to the importance of quality in commercial competition. This course explores how quality contributes to competitiveness. The course starts by defining quality and introducing methods for measuring quality. The course investigates variation in quality and its effect on firm performance, and studies methods for monitoring and controlling quality including quality control charts and sampling inspection. Finally, in light of new developments in operations theory and in technology for tracking and monitoring products, the course also tackles strategic supply chain issues associated with quality. Case studies and field trips are used to bolster student understanding. Prerequisites: ECON 1 and OMIS 108/108E/108S. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Financial Information Systems",
      "classCode": "OMIS 150",
      "description": "Course focuses on computer-based financial information systems that allow finance and accounting professionals to acquire and manage a company’s financial system. Topics include the business functions of a financial information system, the technical aspects of the system, and the management issues of implementing such a system. Students will acquire hands-on experience using ERP systems. Students who receive credit for ACTG 155 may not take this course for credit. Also listed as ACTG 155. Prerequisites: OMIS 30 and 105. (5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Internship",
      "classCode": "OMIS 198",
      "description": "Opportunity for selected upper-division students to work in local businesses or government units. Requires a faculty advisor and should be fairly well structured. Note: A student cannot use a collection of internship courses to satisfy the upper-division course requirement for any of the ISA department’s major or minor programs. Prerequisites: Upper-division standing and approval of the undergraduate committee one week prior to registration. Written proposal must be approved by instructor and chair one week prior to registration. (1 unit)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    },
    {
      "courseName": "Directed Reading/Directed Research",
      "classCode": "OMIS 199",
      "description": "Independent projects undertaken by upper-division students with a faculty advisor. Note: A student cannot use a collection of directed reading/directed research courses to satisfy the upper-division course requirement for any of the ISA department’s major or minor programs. Prerequisites: Upper-division standing and approval of the undergraduate committee one week prior to registration. Written proposal must be approved by instructor and chair one week prior to registration. (1–5 units)",
      "professors": [],
      "ratingCount": 0,
      "ratingTotal": 0,
      "quarterAvailability": [],
      "tags": [],
      "rating": null
    }
  ]